{"title":"Dark Invasion: 1915 (audiobook) by Howard Blum 2014 mp3","uid":9655359,"size":305568265,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0013a5b8d883f2a98c1d25c8a2180d4cf2c6692a&amp;dn=Dark+Invasion%3A+1915+%28audiobook%29+by+Howard+Blum+2014+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobpocket","files":9,"time":1393173637,"description":"Dark Invasion: 1915: Germany's Secret War and the Hunt for the First Terrorist Cell in America (Audiobook) by Howard Blum, read by Pete Larkin\nEnglish | February 11, 2014 | ISBN: 1482996405 , 1482996391 | ASIN: B00HDPCQS4 | 10 hours and 36 minutes | MP3 64 kbps | 291 MB\n\nCombining the pulsating drive of Showtime's Homeland with the fascinating historical detail of such of narrative nonfiction bestsellers as Double Cross and In the Garden of Beasts, Dark Invasion is Howard Blum's gritty, high-energy true-life tale of German espionage and terror on American soil during World War I, and the NYPD Inspector who helped uncover the plot - the basis for the film to be produced by and starring Bradley Cooper.\nWhen a &quot;neutral&quot; United States becomes a trading partner for the Allies early in World War I, the Germans implement a secret plan to strike back. A team of saboteurs - including an expert on germ warfare, a Harvard professor, and a brilliant, debonair spymaster - devise a series of &quot;mysterious accidents&quot; using explosives and biological weapons, to bring down vital targets such as ships, factories, livestock, and even captains of industry like J. P. Morgan.\n\nNew York Police Inspector Tom Tunney, head of the department's Bomb Squad, is assigned the difficult mission of stopping them. Assembling a team of loyal operatives, the cunning Irish cop hunts for the conspirators among a population of more than eight million Germans. But the deeper he finds himself in this labyrinth of deception, the more Tunney realizes that the enemy's plan is far more complex and more dangerous than he suspected. Full of drama and intensity, Dark Invasion is riveting war thriller that chillingly echoes our own time.\n","torrent":{"xt":"urn:btih:0013a5b8d883f2a98c1d25c8a2180d4cf2c6692a","amp;dn":"Dark+Invasion%3A+1915+%28audiobook%29+by+Howard+Blum+2014+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0013a5b8d883f2a98c1d25c8a2180d4cf2c6692a","infoHashBuffer":{"type":"Buffer","data":[0,19,165,184,216,131,242,169,140,29,37,200,162,24,13,76,242,198,105,42]},"announce":[],"urlList":[]}}