{"title":"Bonnie Tyler - Holding Out For A Hero","uid":4644413,"size":172748804,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:00d02f5dd7ac9be73584fe1c3684e57e7216f2d2&amp;dn=Bonnie+Tyler+-+Holding+Out+For+A+Hero&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1231831365,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Holding Out for a Hero&quot; is a song by Bonnie Tyler that was originally released in 1984 and appeared on the soundtrack to the film Footloose. It later appeared on Tyler's Secret Dreams and Forbidden Fire album. Written by Jim Steinman and Dean Pitchford, it hit #2 on the UK charts in 1985 (#69 in 1991) and #34 on the US charts on initial release.\n\nBonnie Tyler (born 8 June 1951 in Skewen, Neath, Wales) is a Welsh rock singer. Born Gaynor Hopkins, she is recognisable by her highly distinctive, husky voice.\n\nFaster Than the Speed of Night was released in Spring 1983 and included the ballad &quot;Total Eclipse of the Heart,&quot; written by Jim Steinman. The song was a worldwide hit, reaching no.1 in the UK, France, Australia and in the United States (where it remained for four weeks). Faster Than the Speed of Night entered the UK album chart at No.1, making Tyler a Guinness Record holder as the first ever British female solo artist to have an album enter the UK chart at no. 1. The album also became a Top Five bestseller in the US and Australia. Total Eclipse of the Heart also brought Tyler a nomination for the Grammy Award for Best Female Pop Vocal Performance. In 1984, she performed the track at the Grammy Awards, and received another Grammy nomination as Best Rock Female Vocalist for &quot;Here She Comes,&quot; a song that was part of the soundtrack for the 1984 restoration of the film Metropolis. She also released the singles &quot;A Rockin' Good Way&quot; (a duet with fellow Welshman Shakin' Stevens) which made #5 in the UK, and &quot;Holding Out for a Hero&quot; from the film soundtrack Footloose which made the Top 40 in the U.S., and peaked at #2 in UK in the summer of 1985. The track was also used as the main theme for the 1984 US television series &quot;Cover Up&quot;, though the version heard on the TV series was not sung by Tyler but by a Tyler sound-alike. &quot;Holding Out for a Hero&quot; also appeared in the pilot of Lois and Clark: The New Adventures of Superman as well as in the Shrek 2 soundtrack sung by Jennifer Saunders in her role as Fairy Godmother.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:00d02f5dd7ac9be73584fe1c3684e57e7216f2d2","amp;dn":"Bonnie+Tyler+-+Holding+Out+For+A+Hero","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00d02f5dd7ac9be73584fe1c3684e57e7216f2d2","infoHashBuffer":{"type":"Buffer","data":[0,208,47,93,215,172,155,231,53,132,254,28,54,132,229,126,114,22,242,210]},"announce":[],"urlList":[]}}