{"title":"Drumkick","uid":6905150,"size":6754986649,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:012c6a3c8619d7be93c3e2e70a74ff0e035c2b49&amp;dn=Drumkick&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gergith","files":-1,"time":1324514475,"description":"[img]http://bayimg.com/jaLEfAAdi[/img]\n[img]http://bayimg.com/jaLehaAdi[/img]\n\n\nDrumkick! Radio Complete Recordings\n\n\nThis is my first torrent!\n\nI stumbled upon Drumkick! Radio shortly after it came to air.\nI'm from Canada and the radio station is both posted online in German as well as broadcast locally.\nI would download all the latest mixes the same way I would weekly listen to Essential Mix back in the day.\n\nIt's a beautiful mix of Alternative, Hip-Hop, Jazz, Funk, Downbeat, Techno and Drum'n'Bass\n\nRecently Drumkick! Radio went off the air. I decided at that point to collect and post 100% of there content.\n\nIn this package you will find all of Drumkick! Radio's sets that I downloaded from: &lt;a href=&quot;\nhttp://www.drumkick.de/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.drumkick.de/&lt;/a&gt;\nThey're in a rar that's been split every 100mb.\nThis way if there is a problem, you can only re-download the rar that's messed up. Also the files have a bit more integrity as a result.\nAlso the files stopped being seperated with the 57th show.\nThis is how they were released.\n\nThey were from between 14.11.2003 and 17.07.2010.\n\n\nYou can listen to everything on here first to get an idea: &lt;a href=&quot;\nhttp://www.mixcloud.com/brayaz/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mixcloud.com/brayaz/&lt;/a&gt;\n\n\nYou will also find Brayaz own music in it's own rar file.\nHis music can be freely obtained from: &lt;a href=&quot;\nhttp://www.brayaz.de/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.brayaz.de/&lt;/a&gt;\nOther sites: &lt;a href=&quot;\nhttp://soundcloud.com/brayaz&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://soundcloud.com/brayaz&lt;/a&gt; &lt;a href=&quot;\nhttp://www.discogs.com/user/Brayaz&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.discogs.com/user/Brayaz&lt;/a&gt;\n\n\nAll of this music is/was freely available at the two above websites, but I've collected it as a torrent.\nMP3/128KBs bitrate for the most part.\n\nSorry if you don't like this torrent, but I wanted to post this awesome music.\n\n\nIgnore the ugly filenames, I've taged everything by hand in mp3tag for iTunes :)\n\n\nI've included a tracklist.txt to know what's in this collection before downloading.\n\nHere are most of the artists collected within:\n\n2001, 2econd Class Citizen, 386DX, 3DJ Junk, 808 State, 88Komaflash, 9 Lazy 9, A Forest Mighty Black, A Tribe Called Quest, Absolute Beginner, Aceyalone, Acrylik, Adolf Noise, Air, Akasha, Akbar, Amon Tobin, Anti MC, Antipop Consortium, Anubian Lights, Aphex Twin, Arabian Prince, Aretha Franklin, Arsonists, Art of Noise, Asup, Atari Teenage Riot, Atmosphere, Audio Active, Audio88, Avalanches, Backdoor Band, Bahamadia, Bajka, Balduin, Ballistic Brothers, Barry Adamson, Beans, Beastie Boys, Beatnuts, Beck, Beginner, Bel Air Project, Benjamin &amp; the Spils, Billy Cobham, Bing Crosby, Biz Markie, Black Grass, Blackmoon, Blade, Blockhead, Blowm, BlowmBeats, Blueprint, Blumentopf, Bobby Byrd, Boca 45, Boca45, Bonobo, Boris Jojie, Brand Nubian, Brayaz, Brayaz feat der Wisch, Brayaz, Greepy, Der Wisch, Breakestra, Breakout, Brian Bennett / Alan Hawkshaw, Brother Brown, Bumps, Burnt Friedman And The Nu Dub Players, Busdriver, Bush, Cali Agents, Canoe Man, Carol Kaye, CazpaCozmo, Ceschi, Charizma &amp; Peanut Butter Wolf, Charming Boys, Chemical Brothers, Cherrystones, Chilly Gonzales, Chris Bowden, Cinematic Orchestra, CissyClouddead, Coldcut, Company Flow, Cora E, Cujo/Kraut, Cut Chemist, Cypress Hill, DAAU, Dada Swing, Daedelus, Daft Punk, DÃƒÂ¤lek, DÃƒÂ¤lek vs. Techno Animal, Dan The Automator, Dan the Automator, Dan The Automator Feat. DJ Q-Bert, Danger Mouse &amp; Jemini, Danger Mouse &amp; Murs, Dangerdoom, Dani Siciliano, Daniel Licht, Dare Deep, Das EFX, David Holmes, Davy Dave, Dayton Sidewinders, De La Soul, De la Soul, Death in Vegas, Declaime, Defari, Deichkind, Del The Funky Homosapien, Deltron 3030, Dendemann, Depth Charge, Der Lange, Der Tobi &amp; Das Bo, Detroit Grand Pubahs, Dilated Peoples, Dimitri From Paris, Diplo, DITC, Dizzee Rascal, DJ Babu, DJ Def Cut, DJ Design, DJ Fangkiebassbeton, DJ Food, DJ Format, DJ Junk, DJ Krush, DJ Marius No. 1, DJ No-Tribe, DJ Nu-Mark &amp; Pomo, DJ Peabird, DJ Phyr, DJ Rectangle, DJ Rels, DJ Revolution feat. Evidence, DJ Scientist, DJ Seppokalypse &amp; Junktion, DJ Shadow, DJ Sharp One, DJ Spinna, DJ Spooky, DJ Stickeltodd, DJ Stylewarz, DJ Vadim, DM &amp; Jemini, Doctor L., Doctor Rockit, Donald Duck, Donqui Shot, Doppelkopf, Dr. Doom, Dr. Kaya, Dr. Octagon, Dr. Zaius, Drillem, Dub Syndicate, Dubadelic, Dubspin, Dudley Perkins, Edan, EDV-Roboter, Egogrill, Egon, Eighty Mile Beach, Eins, Zwo, El-P, ElmBeatz, Emiliana Torrini, Emogen Heap, EPMD, Erektions, Eric B. &amp; Rakim, Estetik, Eve Nin, F.H.H. (Feat. Jakki), Fatboy Slim, Fatembalo, Fatman, Faust Vs. DÃƒÂ¤lek, Fingathing, Fink, Fischmob, Flanger, Flashdance &amp; Mixwell, Flomega, Fog, Four Ted, Franz Ferdinand, Fred Wesley &amp; The JBÃ‚Â´s, Freddie Love, Freddy Fresh, Freestylers, Funkaho, Funki Porcini, Gary Davis, Gary Wilson, Gaslamp Killer, Georgia Anne Muldrow, Gianfranco Plenzio, GLS United, Gonzales, Gorillaz, Gotan Project, Grand Agent, Grandmaster Flash &amp; The Furious Five, Group Home, Guido e Maurizio de Angelis, Gus Gus, Handsome Boy Modeling School, Heiner Stadler, Heliocentrics, Herbaliser, Herbert, Hexstatic, Hezekiah, Hieroglyphics, Hint, Hiob Dilemma, Homelife, Husky Rescue, Ice Cube, Ill K, Infesticons, International Pony, IntroKinderzimmer Productions, Isaac Hayes, J Dilla, J-Live, J. Rawls feat. J-Live, J.Rocc, Jaga Jazzist, Jake the Rapper, James Brown, James Lars and the sexual Chocolate, James Pants, Jamyz Nylon, Jan Delay, Jaylib, Jazzanova, Jean Michel, Jimi Tenor, Joe Tex, Johnny Guitar Watson, Jungle Brothers, Jurassic 5, Justice, K-Otix, Kania Tieffer, Karhu, Kazi, Kid Koala, Kinderzimmer Productions, King Khan &amp; The Shrines, Koffeinfrei, Koushik, Koushik &amp; Percee P, Kraddy, Kraftwerk, KRS One, Kulturni Program, Kyoto Jazz Massive, La Boom, La Familia, Ladyscraper, Lateef &amp; The Chief Are Maroons, LB, LCD Soundsystem, Le Peuple de LÃ‚Â´Herbe, LL Cool J, London Funk Allstars, Loop Guru, Looptroop, Lootpack, Lord Digga, LSD, M-Boogie, M. Arfman, Mad Skills, Madlib, Madonna, Madvillain, Main Concept, Malente, Marc Hype &amp; Jim Dunloop, Mardi Gras.BB, Masta Ace, Mc Rene Feat. Der Tobi &amp; Das Bo, MC Shan, MCK, Megasuff, Mez, MF Doom, MF Doom feat MF Grimm, Mike Ladd, Miki Mikron Feat. Jake The Rapper, Miles Bonny, Mimok, Misanthrop &amp; Aqua Luminus III, Misanthrop Interview, Mr. Lif, Mr. Oizo, Mr. On Vs. The Jungle Brothers, Mr. Scruff, Mum, Munk, Mykill Miers, N.E.R.D., Nathaniel Merriwheater Presents The Lovage, Nelly Fortado, Neneh Cherry, New Order, Nightmares on Wax, Nils Petter Molvaer, Nilsmusic, No Remorze, Nobody, Nusrat Fateh Ali Khan, Olafur Arnalds, Olympic Lifts, One Self, Optms Prme, OSTR, Pass Into Silence, Peaches, Peanut Butter Wolf, Pendulum, Percee P, Percee P &amp; the Keystones, Pest, Peter-Thomas-Sound-Orchestra (New Astronautic Sound), Pharcyde, Plaid, Plattenschnack, Prefuse 73, Princess Superstar, Project Polaroid, Promoe, Public Enemy, Quannum, Quasimoto, Raid, Red Snapper, Rhythm &amp; Sound Feat. Cornell Campbell, Rjd2, Roisin Murphy, Roots Manuva, Ruckus Roboticus, Run DMC, Sage Francis, Salaryman, Sam Ragga Band, Sara Bourgeois, Saul Williams, Schoolly D, Scotty Hard, Screwball, Shinichi Kinoshita, Sirius Mo, Sixtoo, Skalpel, Skelf, Skylab, Slotek, Smut Peddlers, Socalled, Soul Position, Soul Vibrations, Souls of Mischief, Soulwax, Sound Directions, Special Ed, Squarepusher, St. Germain, Stark Reality, Stepchild, Stereo MC's, Stereo MCÃ‚Â´s, Stereo McÃ‚Â´s, Stickeltodd, Stieber Twins, Stieber Twins Feat. Das Bo, Strong Army Steady, Subtle, Suff Daddy, Sun Ra, Super Numeri, Syclops, Take It Off (feat. Vast Aire), Talib Kweli &amp; Madlib, The 5th Dimension Earthbound, The Creators, The Creators feat. Delirious, The Death Set, The Dust Brothers, The Four Tops, The Go-Team, The Heavy, The High &amp; The Mighty, The High &amp; The Mighty Feat. Mos Def, El-P &amp; Mike Zoot, The Irresistable Force, The Mooncakes Project, The Skatalites, The Streets, Tom Tyler, Tone Loc vs. Nirvana, Tony Touch, Too Strong, Tosca, Track#9, Twilight Circus Dub Soundsystem, Two Fingers, Uffie, Ugly Duckling, Ultramagnetic MCÃ‚Â´s, Up, Bustle And Out, Urchin v Rasmus, Van McCoy &amp; The Soul City Symphony, Vangel, Venetian Snares, Viktor Vaughn, Wagon Christ, Wajeed, Wale Oyejide, Wax Tailor, Waxolutionists, Waxolutionists Feat. Manuva, Weisheitszene, White Hole, Wu-Tang Clan, X-Ray, Xaver Fischer Trio, Yonderboi, Zee, Zenit, Zentrifugal","torrent":{"xt":"urn:btih:012c6a3c8619d7be93c3e2e70a74ff0e035c2b49","amp;dn":"Drumkick","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"012c6a3c8619d7be93c3e2e70a74ff0e035c2b49","infoHashBuffer":{"type":"Buffer","data":[1,44,106,60,134,25,215,190,147,195,226,231,10,116,255,14,3,92,43,73]},"announce":[],"urlList":[]}}