{"title":"[SoM]This is England[DvdRip-Xvid-Eng-Sub Ita- Mp3]","uid":4736573,"size":744269824,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0175c32748883183702a0d4bc91ad7ff59f2cdfe&amp;dn=%5BSoM%5DThis+is+England%5BDvdRip-Xvid-Eng-Sub+Ita-+Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1235319718,"description":"Spoken language(s):Inglese  sub Italiano\n\n\nThis Is England ÃƒÂ¨ la storia di Shaun, un undicenne inglese particolarmente tranquillo e quieto, ma che cambia radicalmente quando a scuola alcuni ragazzi deridono la morte del padre caduto nella guerra delle Falkland (1982).\nProprio in questo periodo turbolento, Shaun, entra a far parte di un gruppo di skinhead, e trovando il coraggio che gli ÃƒÂ¨ sempre mancato inizia a conoscere Smell, una ragazza punk piÃƒÂ¹ grande di lui.\nDopo una breve detenzione, al gruppo fa ritorno Combo, ex leader ora in cerca di farsi valere nuovamente. Istiga i ragazzi a essere razzisti inculcandogli lezioni sulla supremazia dei bianchi sugli altri popoli, specialmente i neri.\nA causa degli insegnamenti di Combo, parte del gruppo, tra cui Woody, il ragazzo che ha per primo avvicinato alla cultura skinhead Shaun, decidono di abbandonare la comitiva e la sua deriva pro-National Front, preferendo una connotazione apolitica e antirazzista.Combo guida invece i giovani razzisti e nazionalisti bianchi, tra loro anche Shaun.\nMa Combo non ÃƒÂ¨ solo la faccia che mostra, infatti una notte fuma della marijuana comprata da Milky, un ragazzo di colore appartenente agli skinhead antirazzisti e migliore amico d Woody, e improvvisamente perde la testa aggredendo brutalmente Milky stesso, picchiandolo a morte invidioso della felicitÃƒÂ  che la famiglia del giovane di colore aveva raggiunto in Inghilterra.\nL'accaduto fa aprire gli occhi a Shaun, che abbandona Combo deluso e disgustato dall'atto di violenza.\nIl film si conclude con immagini di repertorio della tv britannica che celebrano gli eroici militari di ritorno dalle Falkland e con Shaun che, con negli occhi e nel cuore il ricordo del padre, getta nel mare la St George's Cross regalatagli da Combo.","torrent":{"xt":"urn:btih:0175c32748883183702a0d4bc91ad7ff59f2cdfe","amp;dn":"%5BSoM%5DThis+is+England%5BDvdRip-Xvid-Eng-Sub+Ita-+Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0175c32748883183702a0d4bc91ad7ff59f2cdfe","infoHashBuffer":{"type":"Buffer","data":[1,117,195,39,72,136,49,131,112,42,13,75,201,26,215,255,89,242,205,254]},"announce":[],"urlList":[]}}