{"title":"DVDFab 8 Qt v8.2.2.9 Final (2-click run)(registred)","uid":8602943,"size":27745987,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:022c8d8ee52c58624f83ab9922364c427272fe51&amp;dn=DVDFab+8+Qt+v8.2.2.9+Final+%282-click+run%29%28registred%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1371930407,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nVersion: DVDFab 8.2.2.9 Qt is out (June 19, 2013)\n\nDescription:\nWhat's New:\nNew: Updated decryption keys.\nNew: Added support for new Java protections.\nNew: Added support for a new Java protection as found on &quot;The Last Stand&quot;.\nNew: Added support for a new copy protection as found on &quot;Jack Reacher&quot;.\nNew: Improved &quot;Remove annoying PGCs (like FBI warning)&quot;.\nNew: Added support for a new protection from Japan AV DVDs.\nNew: Updated VSO burning engine.\nNew: Updated language files.\nNew: Some user interface and user experience improvements.\nFix: Some localization problems for pt-BR, it-IT, ja-JP, de-DE, zh-TW, fr-FR and es-ES.\nFix: Some crash problems which caused by CUDA encoder.\n\nDVD Ripper:\nFix: A problem that cannot split file for vob.passthrough in DVD Ripper.\n\nBlu-ray Copy:\nFix: A 1000 error problem when copying Blu-ray with external subtitle.\nFix: A wrong resolution problem with special Blu-ray disc which has the black bar in the left and right side, such as: 007_Dr.No.\nFix: A freeze problem when copying Blu-ray disc to BD25, such as: Led Zeppelin Celebration Day.\n\nBlu-ray to DVD:\nFix: A crash problem when converting Blu-ray to DVD in certain cases, such as: Bad teacher, Battleship, Prometheus, Chris_Botti.iso.\n\nBlu-ray Ripper:\nFix: A freeze problem when ripping Blu-ray with external subtitle at the second time.\nFix: A wrong multiple angles info in Summary when ripping Blu-ray in certain cases.\nFix: A 500 error when remux one internal subtitle or two external subtitles.\nFix: A crash problem when ripping to Blu-ray with colored subtitle.\nFix: An A/V sync problem when ripping with CoreAVC decoder in certain cases.\n\nDVD Creator:\nFix: An aspect ratio problem when creating DVD disc.\nFix: A freeze problem when creating DVD or Blu-ray in certain cases.\nFix: A problem that the created DVD cannot be played by DVDFab Media Player.\n\nInstallation instructions:\n1. Execute the DVDFab 8 Qt v8.2.2.9 Final (2-click run)(registred).exe file.\n2. Click next.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:022c8d8ee52c58624f83ab9922364c427272fe51","amp;dn":"DVDFab+8+Qt+v8.2.2.9+Final+%282-click+run%29%28registred%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"022c8d8ee52c58624f83ab9922364c427272fe51","infoHashBuffer":{"type":"Buffer","data":[2,44,141,142,229,44,88,98,79,131,171,153,34,54,76,66,114,114,254,81]},"announce":[],"urlList":[]}}