{"title":"Infernal Restraints--Indiscernible  Haley Rue","uid":9312324,"size":3391194093,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:033e26f2b1e6043d1c4e6def09e75e83eba28dd6&amp;dn=Infernal+Restraints--Indiscernible++Haley+Rue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1386422238,"description":"Indiscernible | Haley Rue\n\nDecember 6, 2013\n\n\nHigh and Low Bitrate MP4 + Pics.\n\n\nHaley Rue is a fascinating young lady. She's got an amazing ass, perfectly formed breasts, and a great attitude. Even more fascinating than her stats is the fact that she is legally blind. Haley's primary means of contact with the world is through her sense of touch. What better way to touch her than to tie her up and play with her. In this addition to Infernal Restraints we explore what's on the mind of a young lady who can never see what's coming.\n\nHer mouth is packed wide with an INSEX style gag. Black leather straps hug her tightly in a worm position. Her beautiful young body wiggles and kicks. She moans into the red rag locked behind her teeth. Then all of a sudden there are hands on her; feeling her breasts, pinching her nipples, flipping her on her belly, and touching her ass. They explore her most intimate parts. Then she's hauled over his knee where she's given a sound spanking. Her cheeks are bright red from the ordeal. When it's over she's back on the ground. Her torn stockings and red ass a lovely reminder of what she has waiting for her.\n\nStill tightly bound in the leather straps Haley is now free to talk. Her high heel shoes are replaced by ankle cuffs. She struggles again and calls out for him, but there is no response. When he comes back he wordlessly attaches her to the pulley and pulls her into an inverted suspension. She dangles in midair. Then he shreds her clothing. Her tender white skin is exposed and he takes full advantage. The singletail leaves beautiful red lines across her milky white skin. She grunts and screams, but that doesn't stop him. He only stops when he is satisfied. That's when he teases her. The little pink vibrator makes her quiver, but all too quickly before she is left without orgasm. He yanks her up over 16 feet in the air.\n\nHaley wanted to join the sexy women on Infernal Restraints and show what she was made of. Being blind she relates to the world in a vastly different manner. Haley Rue is a sexy little chick with a cute ass and perky little breasts. In this update she's bound, gagged, fondled, spanked, suspended, whipped, teased, hooded, hogtied, nipple tied, vibrated, and orgasmed. \n \nScreens &lt;a href=&quot;\nhttp://www.infernalrestraints.com/device/bondage/2013/12_06hrue/InfernalRestraints-Haley-Rue-Indiscernible.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.infernalrestraints.com/device/bondage/2013/12_06hrue/InfernalRestraints-Haley-Rue-Indiscernible.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:033e26f2b1e6043d1c4e6def09e75e83eba28dd6","amp;dn":"Infernal+Restraints--Indiscernible++Haley+Rue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"033e26f2b1e6043d1c4e6def09e75e83eba28dd6","infoHashBuffer":{"type":"Buffer","data":[3,62,38,242,177,230,4,61,28,78,109,239,9,231,94,131,235,162,141,214]},"announce":[],"urlList":[]}}