{"title":"7 Wonders of the Industrial World - Disc 2","uid":3767614,"size":734532383,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0360ed0c625878207853403b1b29d555bdff9734&amp;dn=7+Wonders+of+the+Industrial+World+-+Disc+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ayowodimaya","files":5,"time":1186664946,"description":"Compressed AVIs of the DVD &lt;a href=&quot;\nhttp://shop.abc.net.au/browse/product.asp?productid=728156&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://shop.abc.net.au/browse/product.asp?productid=728156&lt;/a&gt;\n\nDescription\n========\nMeet the most brilliant pioneers if the industrial age, and their most remarkable feats of engineering. See how, against the odds, their burning ambitions, extravagant dreams, passion and rivalry produced seven key technological monuments of the Industrial evolution, &amp;#039;Seven Wonders of the Industrial World&amp;#039; uses a compelling mix of computer-generated and dramatic re-creations to bring these fascinating stories to life. \n\n\nThe Great Ship\n-----------------\nIn 1851, Isambard Kingdom Brunel, dreamed of creating the largest ship ever built. At 692 feet, it would be able to sail without stopping to Australia and unite the two ends of the empire. Yet his &amp;#039;Great Ship&amp;#039; would destroy him, and those who were associated with it. \n\nThe Brooklyn Bridge\n------------------------\nIn the mid 19th Century, New York was growing faster than any city in the world. A scheme was devised to unite Manhattan and Brooklyn, spanning the East River with the longest suspension bridge ever built. But John Roebling?s ambitious dream fast turned into a nightmare ? a technological feat set against greed, corruption and a double family tragedy. \n\nBell Rock Lighthouse\n-----------------------\nThe deadly Bell Rock Reef in Scotland had been a ship?s graveyard for centuries. When young Robert Stevenson proposed building a lighthouse on it, other engineers thought him mad. A treacherous rock, it is almost constantly submerged and set 11 miles offshore in hazardous seas. Despite ridicule, greedy financiers, personal tragedy and the elements, the lighthouse was finally erected and still shines it?s warning to sailors. \n\nThe Sewer King\n------------------\nIn the hot summer of 1858, London?s decaying sewage stopped Parliament with its ?Great Stink?. Sanitation had not changed since medieval times. Joseph Bazalgette?s vision was to build 1300 miles of new sewers. London had to be completely redesigned to accommodate the vast plan, but the eventual success led to the end of cholera epidemics. \n\nThe Panama Canal\n----------------------\nConceived by Ferdinand de Lesseps, the Panama Canal was a miracle of engineering and human endeavour. He was beaten by jungle, swamps, rainstorms, mudslides, the death of 20,000 workers and financial ruin. American John Stevens took over the project and saw it through, in the process creating a new country and the largest lock and canal system in the world. \n\nThe Line\n-----------\nThe enthralling story of two corporate giants, pitched against each other in a race to join the east and west coasts of America with a transcontinental railway..The surveyors and labourers had to battle floods, food shortages and even a war to complete the epic project... \n\nThe Hoover Dam\n-------------------\nIn 1902, Arthur Powell-Davis conceived a plan to build a dam to harness the power of the dangerous and unpredictable Colorado River. At 727 feet, it would stand 60 storeys high with a larger volume than the Great Pyramid at Gaza. Ruthless Frank Crowe succeeded where he failed, but it came at a price ? lives lost, legal wranglings and major fund disputes. \n\n\nSubtitles: None\nAspect: 16:9 \n\nRated: E (exempt from classification) \nDuration: 350 mins. \n2004 ","torrent":{"xt":"urn:btih:0360ed0c625878207853403b1b29d555bdff9734","amp;dn":"7+Wonders+of+the+Industrial+World+-+Disc+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0360ed0c625878207853403b1b29d555bdff9734","infoHashBuffer":{"type":"Buffer","data":[3,96,237,12,98,88,120,32,120,83,64,59,27,41,213,85,189,255,151,52]},"announce":[],"urlList":[]}}