{"title":"Umberto Eco - The Mysterious Flame of Queen Loana","uid":4932672,"size":23027416,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03c745e5d3a8d70b7e119a5ee75f250535ca772c&amp;dn=Umberto+Eco+-+The+Mysterious+Flame+of+Queen+Loana&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":null,"files":1,"time":1244111459,"description":"Approaching 60, Giambattista Bodoni, known as Yambo, a Milanese antiquarian book dealer, has been plunged by a sudden attack into a brief coma, from which he emerges with his autobiographical memory entirely missing. The memories of a lifetime of reading, however, remain intact, and his mind is a fog of fragmented quotations and encyclopaedic facts.\n\nAmnesia, as a pretext for analysing how the narrative of our selves is created by editing or fictionalising memories, is a well-used trope in literature and film, but Eco fully humanises Yambo's anguish at the dream-like quality of his life. \n\nYambo too has been born a tabula rasa, at 60, and must follow the course of his life backwards if he is to understand who he was. He returns to his grandfather's country estate, to which he was evacuated as a boy during the war, and there immerses himself in an attic full of his childhood reading matter, together with his grandfather's newspapers and magazines from the time of Mussolini and a collection of old records. Many of these images, such as a half-clad Josephine Baker, kindle the mysterious flames of the title, surges of recognition frustratingly divorced from context.\n\nIt ends with another shocking discovery that precipitates a second attack; within his coma, his memory returns in overdrive, and all the clues are shaped in the final section into a compelling narrative of wartime heroics and first love. Eventually, this rush of memory becomes phantasmagoric, an apocalyptic vision couched in the language of Dante and the Book of Revelation, in which all the figures of fact and fiction appear to him in a Busby Berkeley dance of hyperreality, climaxing in a horror for which the reader is unprepared.\n\nFor all its vivid cartoons, this is a novel about fog, with a dark vision. What begins with the most advanced science of the mind ends with deliberate echoes of CalderÃƒÂ³n de la Barca's questions about dreams and reality, and confirms Eco as an outstanding writer of philosophy dressed as fiction. [Observer review]","torrent":{"xt":"urn:btih:03c745e5d3a8d70b7e119a5ee75f250535ca772c","amp;dn":"Umberto+Eco+-+The+Mysterious+Flame+of+Queen+Loana","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03c745e5d3a8d70b7e119a5ee75f250535ca772c","infoHashBuffer":{"type":"Buffer","data":[3,199,69,229,211,168,215,11,126,17,154,94,231,95,37,5,53,202,119,44]},"announce":[],"urlList":[]}}