{"title":"Hitler - The Fight for Supremacy (Documentary)","uid":4855359,"size":512480933,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:043eadba9f17a954bef653ef6e4470f9b6e1e43f&amp;dn=Hitler+-+The+Fight+for+Supremacy+%28Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Katkwaraye","files":-1,"time":1240045762,"description":"Source: DVD\nFormat: mkv (because Matroska is how I roll)\nRunning Time: 1:00:25\nOrg Year: 2007\nSize: 488 MB\nripped by myself\n\nThe History Makers of World War II: Hitler - The Fight for Supremacy\n\nMention the name of Adolf Hitler and worldwide the reaction will be one of horror, fuelled by his actions, which led to World War II and the atrocities committed at his command. Images of Hitler addressing huge crowds, dramatic hand gestures and a small, square Charlie Chaplin like moustache complete the picture but this is no more than a caricature of a man who truly did alter the course of 21st Century history.\n\nThe story of Adolf Hitler is as complex as it is fascinating and this is an intriguing journey of discovery to explore who he was, how it was possible for him to rise to power, his campaign to dominate the world and the aftermath of his actions. With extensive archive footage, see Adolf Hitler at the key points in his military career and follow his progress from supremacy to suicide in a Berlin underground bunker in 1945.\n\nAdolf Hitler in his fight for supremacy resulted in the most appalling of human tragedies, yet his place in the history books is crucial, confirming once and for all that absolute power corrupts absolutely, a lesson the world is sadly still learning to this day.\n\nIf you need a seed, PM me here: http://suprbay.org/member.php?u=74576\n","torrent":{"xt":"urn:btih:043eadba9f17a954bef653ef6e4470f9b6e1e43f","amp;dn":"Hitler+-+The+Fight+for+Supremacy+%28Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"043eadba9f17a954bef653ef6e4470f9b6e1e43f","infoHashBuffer":{"type":"Buffer","data":[4,62,173,186,159,23,169,84,190,246,83,239,110,68,112,249,182,225,228,63]},"announce":[],"urlList":[]}}