{"title":"The Last War - David Allan Lewis","uid":11773246,"size":15914892,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0494089a2d250bad239f14808775ef4c063375d4&amp;dn=The+Last+War+-+David+Allan+Lewis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"starxteel","files":2,"time":1427159932,"description":"\nExclusive interview with Ariel Sharon! A probing look at the war on terrorism. Conflict in the Middle East has simmered and boiled for decades. Now, war and terrorism are global in scope. The Last War contains supremely relevant information for all concerned:\n\n- Why do Islamic radicals hate the West?\n- What is the radical Moslem?s world view?\n- Who are Osama bin Laden?s allies?\n- Who are the ?Little Satan? and the ?Great Satan??\n- Are we being told the whole truth about our enemies?\n\nTragically, a decade of intense diplomacy and negotiation has given way to widespread violence: some analysts, aware of the real potential for catastrophic war in the region, openly wonder if this will all lead to a ?last war? of sorts. After seven years of &quot;confidence-building&quot; measures that are the framework of the Oslo Accords - an ambitious attempt to bring Israelis and Palestinians to a final peace agreement - the whole affair is unraveling. Violence in the West Bank has accelerated dramatically since Yitzak Rabin and Yasser Afarat signed the Declaration of Principles on the White House lawn in 1993. In this in-depth study of the peace process, the reader will learn little-reported facts about the peace process and the people involved, and will be able to see clearly that the latest confrontations are a prelude to a devastating conclusion.\n\n\nAbout the author:\nDavid Lewis has been a stalwat friend of Israel for 50 years, and has made 67 trips to the Holy Land. He is considered one of the leading experts in America on Bible prophecy, and is the author of numerous articles and books including Prophecy 2000 and Signs of His Coming. He is a licensed minister with the Assemblies of God, and lives in Springfield, Missouri","torrent":{"xt":"urn:btih:0494089a2d250bad239f14808775ef4c063375d4","amp;dn":"The+Last+War+-+David+Allan+Lewis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0494089a2d250bad239f14808775ef4c063375d4","infoHashBuffer":{"type":"Buffer","data":[4,148,8,154,45,37,11,173,35,159,20,128,135,117,239,76,6,51,117,212]},"announce":[],"urlList":[]}}