{"title":"Factory Man - Beth Macy - Audiobook MP3","uid":11321924,"size":400894463,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:04fd124e12721029c1894646369af176811bc752&amp;dn=Factory+Man+-+Beth+Macy+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1414606827,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nFactory Man: How One Furniture Maker Battled Offshoring, Stayed Local - and Helped Save an American Town\n\nWritten by: Beth Macy\nNarrated by: Kristin Kalbli\nLength: 13 hrs and 51 mins\nUnabridged Audiobook\nRelease Date:07-15-14\n\nWith over $500 million a year in sales, the Bassett Furniture Company was once the world's biggest wood furniture manufacturer. Run by the same powerful Virginia family for three generations, it was also the center of life in Bassett, VA-an unincorporated town that existed solely for the people who built the company's products. But beginning in the 1980s, the Bassett company suffered from an influx of cheap Chinese furniture as the first waves of Asian competition hit, and ultimately was forced to send its production offshore to Asia.\n\nOnly one man fought back. That man is John Bassett III, a descendant of the Bassetts who is now chairman of Vaughan-Bassett Furniture Co, which employs more than 700 Virginians and has sales of over $90 million. In Factory Man, Beth Macy brings to life Bassett's deeply personal furniture and family story. As she shows how he uses legal maneuvers, factory efficiencies, and sheer grit, cunning, and will to save hundreds of jobs, she also discovers the hidden and shocking truth about industry and America","torrent":{"xt":"urn:btih:04fd124e12721029c1894646369af176811bc752","amp;dn":"Factory+Man+-+Beth+Macy+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04fd124e12721029c1894646369af176811bc752","infoHashBuffer":{"type":"Buffer","data":[4,253,18,78,18,114,16,41,193,137,70,70,54,154,241,118,129,27,199,82]},"announce":[],"urlList":[]}}