{"title":"Padres 1x01 Al 1x04 DVB Spanish","uid":5236795,"size":997906093,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:05b645caa896346060f3b79efbea0bcc6bd0b68f&amp;dn=Padres+1x01+Al+1x04+DVB+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":5,"time":1261528301,"description":"Padres es una serie hace un retrato, en clave de humor, de la familia de hoy dÃƒÂ­a, y que se basa en su homÃƒÂ³nima canadiense, &quot;Les Parent&quot;, que se emitiÃƒÂ³ con gran ÃƒÂ©xito de audiencia el aÃƒÂ±o 2008 en CanadÃƒÂ¡. Muestra la vida de dos familias; los Mellizo y los Nieto. A travÃƒÂ©s de ellos y de las diversas situaciones que vivan, los espectadores se podrÃƒÂ¡n ver plenamente identificados ya que todas las tramas son universales y cualquiera se puede ver reflejado.\n\nEl reparto de &quot;Padres&quot; estÃƒÂ¡ compuesto por Lola Marcelli y JosÃƒÂ© BarÃƒÂ³n, que interpretan al matrimonio Nieto (Silvia y Alberto). Roser Tapias y Alexandra Petrarrota son Elena y Marta Nieto, las hijas de la pareja. Cristina de Inza interpreta a Natalia, la madre de la familia Mellizo; JosÃƒÂ© RamÃƒÂ³n Iglesias es Luis Mellizo, su marido e Ignacio JimÃƒÂ©nez (Alex), Jaime Furcci (Daniel) y Guillermo Estrella (Guille) son los tres hijos de la pareja de la otra familia protagonista.\n\nLos Mellizo: &quot;Natalia y Luis y sus tres hijos varones: Alex, Dani y Guille de 16, 12 y 7 aÃƒÂ±os respectivamente. Son Los Mellizo, una familia como tantas: los dos padres trabajan, ella fuera y ÃƒÂ©l en casa como creativo de publicidad. En principio, todos se reparten el trabajo de casa..., pero sÃƒÂ³lo en principio. La madre carga con la mayor parte de los quehaceres domÃƒÂ©sticos, los hijos escurren el bulto todo lo que pueden... y el padre intenta buscar soluciones imaginativas a los problemas diarios que no siempre dejan contenta a su mujer.\n\nLos Nieto: Alberto y Silvia son los padres de Elena, una guapa adolescente de\ndiecisÃƒÂ©is aÃƒÂ±os, y Marta, una niÃƒÂ±a muy avispada de doce aÃƒÂ±os, que tiene sus mÃƒÂ¡s y sus menos con su hermana mayor. Son los Nieto, una familia que podrÃƒÂ­an ser nuestros vecinos. Silvia y Alberto trabajan fuera (ella en una editorial; ÃƒÂ©l es odontÃƒÂ³logo) y comparten las tareas domÃƒÂ©sticas y la educaciÃƒÂ³n de sus hijas. Silvia es comprensiva y pragmÃƒÂ¡tica con sus hijas. Alberto intenta comprender a todas las mujeres con las que vive... pero estÃƒÂ¡ muy lejos de conseguirlo. A pesar de tener valores y formas de vivir distintas, las similitudes entres los Mellizo y los Nieto son mayores de lo que podrÃƒÂ­a suponerse. Y es que en el fondo es mÃƒÂ¡s lo que nos une que lo que nos diferencia&quot;.","torrent":{"xt":"urn:btih:05b645caa896346060f3b79efbea0bcc6bd0b68f","amp;dn":"Padres+1x01+Al+1x04+DVB+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05b645caa896346060f3b79efbea0bcc6bd0b68f","infoHashBuffer":{"type":"Buffer","data":[5,182,69,202,168,150,52,96,96,243,183,158,251,234,11,204,107,208,182,143]},"announce":[],"urlList":[]}}