{"title":"End Of Days - Be Ready (Signs of the Last Days)","uid":4979267,"size":161523891,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:05c916bdc4ee481524e56044090ca6a59fb88909&amp;dn=End+Of+Days+-+Be+Ready+%28Signs+of+the+Last+Days%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mardu33","files":17,"time":1246148164,"description":"----------------------------------------------------------------------\n       End Of Days - Be Ready (Signs of the Last Days):\n----------------------------------------------------------------------\nType.................: Interwiev / Audio Book\nYear.................: 2009\nFile Format..........: MP3\nAudio................: MP3 / English\nAudio Bitrate........: 128kbps \nGenre................: Audio Book\nDuration.............: 80mins\n\n\nDescription..........: \nEnd Of Days - Be Ready (Signs of the Last Days):\n \n\nAbout The Audio:\n\nSigns of the Last Days:\n\nEvents of the twentieth century alerted Bible students to the tremendous \npotential for fulfilled prophecy, and many students of the Bible and eschatology \nrecognize the events continuing to unfold in the world today as signs of the last days.\n\nThe signs are visible all around us.\n\n&quot; wars and rumors of wars&quot; - Matthew 24:6\n\nEndless war seem to rage in Iraq and Afghanistan and the war on terrorism is \nspreading to nearly every corner of the globe. Since 2000 alone, America has been \nmired in conflict in Sierra Leone, Yemen, East Timor, Afghanistan, Philippines, \nCote d'Ivoire, Iraq, Liberia, Georgia, HaÃƒÂ¯ti, Pakistan, Lebanon, and Somalia.\n\n\n&quot;Nation will rise against nation, and kingdom against kingdom.&quot; - Matthew 24:7\n\nOther conflicts are raging in Darfur, Saudi Arabia, Central African Republic, \nDemocratic Republic of Congo, Thailand, Chad, Gaza Strip and the West Bank in Israel, \nNiger and Mali, Kenya, and Sri Lanka.\n\n&quot;There will be famines and earthquakes in various places.&quot; - Matthew 24:7\n\nEvery year, earthquakes cause thousands of deaths, either directly or \ndue to the resulting tsunamis, landslides, fires, and famines.\n\n        * 3,000 people died in the 1906 San Francisco earthquake.\n\n        * Around 110,000 were killed in the 1948 earthquake in Ashgabat,  Turkmenistan.\n\n        * More than 5,700 deaths were reported following the strongest earthquake ever \n\t  recorded in 1960 in Southern Chile.\n\n        * While only 15 people died in the 1964 Prince William Sound in Alaska quake itself, \n          110 more people were killed in the resulting tsunami.\n\n        * 66,000 were killed off the western coast of South America in the 1970 Peru earthquake.\n\n        * Between 250,000 and 655,000 died in the 1976 China earthquake that struck Tangshan, \n          then a city of one million people.\n\n        * 63 people were killed in the 1989 Loma Prieta quake -- which struck the San Francisco area.\n\n        * 60 people were killed in the 1994 Northridge quake in Southern California.\n\n        * More than 5,000 were killed the 1995 Kobe, Japan earthquake.\n\n        * 230,000 (and perhaps as many as 290,000) people in 12 countries -- including about 168,000 \n          in Indonesia alone were killed in the 2004 earthquake just off the west coast of the \n          island of Sumatra, and the tsunami that followed.\n\n        * More than 80,000 people were killed in the 2005 Pakistan earthquake.\n\n        * More than 69,000 people died in the 2008 Sichuan China earthquake.\n\nWe're hearing of an increasing scarcity of food on a worldwide scale, due to increased \nconsumption in growing countries such as China and India and rising fuel costs. These shortages \nhave caused riots in some places and some predict the future outbreak of wars fought over increasing food scarcities.\n\n    Change:\n\n    The twentieth century was an unprecedented period of change and the twenty-first century is \n    proving to be even more dramatic. At no time in history have more changes occurred in science and in the \n    political structure of the world.\n    * \t\n\n    More changes occur in science in a single year than formerly occurred in a century.\n\n\n    * \t\n\n    With Israel restored as a nation in 1948, the panorama of end-time prophecy came into a focus in which \n    Israel will be a prominent player.\n\n\n    * \t\n\n    The introduction of the concept of a world government, made real by the United Nations paints a scenario that is in \n    harmony with prophecy concerning a future world government.\n\n\n    * \t\n\n    The wholesale collapse of ethical and moral values throughout society and government. Children are killing their classmates, \n    employees are killing fellow employees, and government leaders are promising change.","torrent":{"xt":"urn:btih:05c916bdc4ee481524e56044090ca6a59fb88909","amp;dn":"End+Of+Days+-+Be+Ready+%28Signs+of+the+Last+Days%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05c916bdc4ee481524e56044090ca6a59fb88909","infoHashBuffer":{"type":"Buffer","data":[5,201,22,189,196,238,72,21,36,229,96,68,9,12,166,165,159,184,137,9]},"announce":[],"urlList":[]}}