{"title":"The Making Of Fairytale Of New York","uid":3425603,"size":1547530176,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0611cf6760a6db17b3a2bc155f5da04145015ee3&amp;dn=The+Making+Of+Fairytale+Of+New+York&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kufen","files":1,"time":1135864124,"description":"Documentaries &amp; Arts:\nThe Story of...\nFairytale of New York\n\nMade:2005\n \n\nWe?ve all been there. You?re down the pub on Christmas Eve, cheesy Yuletide songs are being belted out non-stop and you want to kick the jukebox.\n \nAnd then you hear those magical opening lines:\n?It was Christmas Eve babe / In the drunk tank??\n\nAll your troubles melt away, and by the time the chorus has come around, the whole pub is singing along:\n\n?The boys of the NYPD choir were singing Galway Bay / And the bells were ringing out for Christmas Day?.\n\nIf you?ve ever wondered how this very special seasonal song came into existence, The Story of... Fairytale of New York is essential viewing. Even if you haven?t, with Pogues rogue Shane MacGowen involved, it?s a tale that could never be less than fascinating.\n\nIn The Story of... Matt Dillon, Nick Cave, Jools Holland and gap-toothed wonder Shane MacGowan, as well as the rest of the Pogues, lift the lid on this amazing track.\n\nFor the first time in twelve years, all eight members of the band are re-united in a recording studio, as they return to the place they cut the original sessions.\n\nProducer Steve Lillywhite strips Fairytale down to the basics and un-picks his mix, while video director Peter Dougherty reveals the tricks behind the making of the video. \n\nMatt Dillon ? who stars as a rookie cop in the video ? talks about his part in the mayhem, and we also find out exactly who ?the boys of the NYPD choir? were.\n\nThe film also answers that all important question ? who drank most on the video shoot, the police or the Pogues??\n\nWe also learn how the all-male Pogues came to choose Kirsty MacColl (pictured above) to sing the timeless female vocals.\n\nTogether, they made perhaps the most stirring and raucous Christmas song ever captured on vinyl.\n\nAltogether now: ?Happy Christmas your arse, I pray God it?s our last.?\n \n","torrent":{"xt":"urn:btih:0611cf6760a6db17b3a2bc155f5da04145015ee3","amp;dn":"The+Making+Of+Fairytale+Of+New+York","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0611cf6760a6db17b3a2bc155f5da04145015ee3","infoHashBuffer":{"type":"Buffer","data":[6,17,207,103,96,166,219,23,179,162,188,21,95,93,160,65,69,1,94,227]},"announce":[],"urlList":[]}}