{"title":"The Corner 1x03x04 HDTV Spanish by tony","uid":6597692,"size":1411129544,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:062c6aed750cc35a4b26c69f881747e8a85a8f89&amp;dn=The+Corner+1x03x04+HDTV+Spanish+by+tony&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"carambolas","files":4,"time":1313081410,"description":"Si quieres mas series, peliculas, juegos, etc... tanto por descarga directa como por torrent. visitanos:\n     &lt;a href=&quot;\nhttp://www.tonytorrent.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tonytorrent.com&lt;/a&gt;\n\nThe Corner es una miniserie de la cadena de televisiÃƒÂ³n HBO basada en el libro The Corner: A Year in the Life of an Inner-City Neighborhood de David Simon y Ed Burns, los creadores de la mejor serie de la historia, The Wire, que fue adaptada para televisiÃƒÂ³n por el mismo Simon y David Mills.\n\nThe Corner narra la vida de una familia de Baltimore Oeste sumida en la pobreza y las drogas. Para muchos, es una especie de piloto para lo que mÃƒÂ¡s tarde serÃƒÂ­a The Wire. El escenario es el mismo, aunque varÃƒÂ­a un poco el tratamiento: aquÃƒÂ­ no hay investigaciones, ni intrigas, ni delitos que resolver. AquÃƒÂ­ lo que hay es una familia de mediana edad caÃƒÂ­da de la clase media al pozo sin fondo de la heroÃƒÂ­na.\n\nLa miniserie fue aclamada por la crÃƒÂ­tica y ganÃƒÂ³ varios premios Emmy en 2000, incluyendo el de mejor miniserie. Charles S. Dutton lo ganÃƒÂ³ por su direcciÃƒÂ³n y David Mills y David Simon ganaron Emmys por el guiÃƒÂ³n.\n\nOtro de los alicientes de esta miniserie es ver a muchos de los actores de The Wire haciendo papeles distintos, polis o polÃƒÂ­ticos de T.W. aparecen interpretando a yonquis en T.C. Otros personajes de TW aparecen en pequeÃƒÂ±os papeles de extra con frase. Espero que los fans de The Wire disfruten con ella tanto como yo he disfrutado; televisiÃƒÂ³n de la buena de verdad.","torrent":{"xt":"urn:btih:062c6aed750cc35a4b26c69f881747e8a85a8f89","amp;dn":"The+Corner+1x03x04+HDTV+Spanish+by+tony","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"062c6aed750cc35a4b26c69f881747e8a85a8f89","infoHashBuffer":{"type":"Buffer","data":[6,44,106,237,117,12,195,90,75,38,198,159,136,23,71,232,168,90,143,137]},"announce":[],"urlList":[]}}