{"title":"Love Affair (1339) Xvid 1cd - Irenne Dunne, Charles Boyer - late","uid":9352257,"size":734208000,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:063d5132e09375e4a34af3cacb84157d6d8d9eec&amp;dn=Love+Affair+%281339%29+Xvid+1cd+-+Irenne+Dunne%2C+Charles+Boyer+-+late&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1387152939,"description":"Love Affair (1339) Xvid 1cd - Irenne Dunne, Charles Boyer - later remade as 'An Affair to Remember 1957' [DDR]\n\nLove Affair is a 1939 romantic film starring Irene Dunne and Charles Boyer and featuring Maria Ouspenskaya. \nIt was directed by Leo McCarey and written by Delmer Daves and Donald Ogden Stewart, based on a story by McCarey and Mildred Cram.\n\nLove Affair film was remade by McCarey in 1957 as An Affair to Remember with Cary Grant and Deborah Kerr in the lead roles, using a very similar screenplay, \nand by Glenn Gordon Caron in 1994 as Love Affair, starring Warren Beatty, Annette Bening and, in her last feature film appearance, Katharine Hepburn. \nA 1999 Bollywood movie, Mann, was made based on the same storyline.\n\nCAST:-\nIrene Dunne as Terry McKay\nCharles Boyer as Michel Marnet\nMaria Ouspenskaya as Grandmother Janou\nLee Bowman as Kenneth Bradley\nAstrid Allwyn as Lois Clarke\nMaurice Moscovitch as Maurice Cobert, art dealer\n\nDirected by Leo McCarey\nProduced by Leo McCarey\nScreenplay by Delmer Daves, Donald Ogden Stewart,\nStory by Leo McCarey, Mildred Cram\n\nMOVIE REVIEW:- Love Affair (1939)\nFrench painter Michel Marnet (Charles Boyer) meets American singer Terry McKay (Irene Dunne) aboard a liner crossing the Atlantic Ocean. They are both already engaged, he to heiress Lois Clarke (Astrid Allwyn), she to Kenneth Bradley (Lee Bowman). They begin to flirt and to eat dinner together on the ship, but his notoriety and popularity on the ship make them conscious that others are watching. Eventually, the decide they should eat separately and not associate with each other. At a stop at Madeira, they visit Michel's grandmother Janou (Maria Ouspenskaya), who approves of Terry and wants Michel to settle down.\n\nAs the ship is ready to disembark at New York City, the two make an appointment to meet six months later on top of the Empire State Building. Michel chooses six months because that is the amount of time he needs to decide whether he can drop the life of a playboy and start making money to support a relationship with Terry. When the rendezvous date arrives, they both head to the Empire State Building. However, Terry is struck by a car right as she arrives, and is told that she may not be able to walk, though that will not be known for certain for six months. Not wanting to be a burden to Michel, she does not contact him, preferring to let him think the worst. Meanwhile, Terry recovers at an orphanage teaching the children how to sing.\n\nSix months go by, and during Terry's first outing since the accident, the two couples meet by accident at the theater, though Terry manages to conceal her condition. Michel then visits her at her apartment and finally learns the truth. He assures her that they will be together no matter what the diagnosis will be.\n\n\nInternationally renowned French artist Michel Marnet, who is engaged to marry American industrial heiress Lois Clarke, meets Terry McKay aboard a ship sailing from Naples to America, and falls in love with her. Though Terry, a nightclub singer, is engaged to Kenneth Bradley, the man who saved her career, she falls in love with Michel. To prevent scandal at home, Terry avoids being seen publicly with Michel, but when the ship docks at Madiera, Michel's grandmother, who lives on the island, tells Terry that she, not Lois, is the right woman for Michel. Having received the grandmother's blessing, Terry and Michel's romance flourishes, and before docking in New York, the two make a pact to meet six months later on top of the Empire State building, after they have made successes of themselves. During their separation, Terry moves to Philadelphia and is successful singing in nightclubs, while Michel paints. Both dream of the day when they will be reunited, but tragically, Terry is struck by a car on her way to the rendezvous. In the hospital, she is told that she may be crippled for life, but that her fate will not be known for certain for another six months. Because of her condition, Terry decides not to tell Michel what happened and does not contact him at all. While recuperating, Terry gets a job at an orphanage. One evening, while attending a theater performance, Terry and Kenneth see Michel with a female companion. Terry and Michel greet each other, but do not acknowledge each other as recent lovers. Kenneth expresses interest in getting Terry back together with Michel, but she insists on waiting until she is well. After having tracked her down, Michel pays Terry a visit at her apartment, where he discovers her condition, forgives her silence, and assures her that they should always be together regardless of her condition.  \n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 87 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 87 mins","torrent":{"xt":"urn:btih:063d5132e09375e4a34af3cacb84157d6d8d9eec","amp;dn":"Love+Affair+%281339%29+Xvid+1cd+-+Irenne+Dunne%2C+Charles+Boyer+-+late","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"063d5132e09375e4a34af3cacb84157d6d8d9eec","infoHashBuffer":{"type":"Buffer","data":[6,61,81,50,224,147,117,228,163,74,243,202,203,132,21,125,109,141,158,236]},"announce":[],"urlList":[]}}