{"title":"Ice Cold: Tales of Intrigue by Jeffrey Deaver, et al. (ePub Reta","uid":9867841,"size":556005,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:067587d0efe7d73088aa4cba3f3a1037170a7928&amp;dn=Ice+Cold%3A+Tales+of+Intrigue+by+Jeffrey+Deaver%2C+et+al.+%28ePub+Reta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TxJag","files":3,"time":1396378953,"description":"Nuclear brinksmanship. Psychological warfare. Spies, double agents, femme fatales, and dead drops.\n\nThe Cold War--a terrifying time when nuclear war between the world's two superpowers was an ever-present threat, an all-too-real possibility that could be set off at the touch of a button--provides a chilling backdrop to this collection of all-new short stories from today's most celebrated mystery writers.\n\nBestselling authors Jeffery Deaver and Raymond Benson--the only American writers to be commissioned to pen official James Bond novels--have joined forces to bring us twenty masterful tales of paranoia, espionage, and psychological drama. In Joseph Finder's &quot;Police Report,&quot; the seemingly cut-and-dry case of a lunatic murderer in rural Massachusetts may have roots in Soviet-controlled Armenia. In &quot;Miss Bianca&quot; by Sara Paretsky, a young girl befriends a mouse in a biological warfare laboratory and finds herself unwittingly caught in an espionage drama. And Deaver's &quot;Comrade 35&quot; offers a unique spin on the assassination of John F. Kennedy--with a signature twist.\n\nFull Retail. ePub and Calibre Reader ready. Metadata is complete and up to date.","torrent":{"xt":"urn:btih:067587d0efe7d73088aa4cba3f3a1037170a7928","amp;dn":"Ice+Cold%3A+Tales+of+Intrigue+by+Jeffrey+Deaver%2C+et+al.+%28ePub+Reta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"067587d0efe7d73088aa4cba3f3a1037170a7928","infoHashBuffer":{"type":"Buffer","data":[6,117,135,208,239,231,215,48,136,170,76,186,63,58,16,55,23,10,121,40]},"announce":[],"urlList":[]}}