{"title":"Arch Enemy - We Will Rise (2nafish)","uid":6003777,"size":150247428,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:07477549b80c27938bc52bd48ebfb9911ba7526f&amp;dn=Arch+Enemy+-+We+Will+Rise+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1291259969,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nAnthems of Rebellion is the fifth studio album by Swedish melodic death metal band Arch Enemy. This is the only Arch Enemy album to feature clean vocals. The clean vocals were sung by Christopher Amott on &quot;End of the Line&quot; and &quot;Dehumanization&quot;.\n\nA music video was produced for the album's single, &quot;We Will Rise,&quot; which saw moderate airing on Headbanger's Ball and Uranium. It featured a legion of people racing across a beach under a darkened sky. According to the band, one of the participants in the video hurt an ankle considerably in leaping off a large hill but did not sue.\n\nA video was also produced for Dead Eyes See No Future, which consisted of a live performance. The song also appeared on the Alone in the Dark Original Soundtrack.\n\nAt its time of release, Anthems of Rebellion gave Century Media its then highest first-week Soundscan sales in the United States, and later became one of the top ten best-selling albums under the record label.\n\nArch Enemy is a Swedish melodic death metal band, originally a supergroup, from Halmstad, formed in 1996. Its members were in bands such as Carcass, Armageddon, Carnage, Mercyful Fate, Spiritual Beggars, and Eucharist to name a few. It was founded by Carcass guitarist Michael Amott along with Johan Liiva, who were both originally from the influential death metal band Carnage. The band has released seven studio albums, a live album (Burning Japan Live 1999), two DVDs and three EPs. The band was originally fronted by Johan Liiva, who was replaced by Angela Gossow as lead vocalist in 2000.\n\nThe first album with songs featuring Gossow was Wages of Sin, released in 2001. This is also the first album where the band used C tuning, which they have kept until the present, except on several occasions. In December of the same year, Arch Enemy took part in the &quot;Japan's Beast Feast 2002&quot; concert, playing alongside Slayer and MotÃƒÂ¶rhead.\n\nAnthems of Rebellion was released in 2003 and brought some innovations, such as the use of a second voice singing in harmony; such as in the &quot;End of the Line&quot; and &quot;Dehumanization&quot; tracks. In November of the following year, the band released the EP Dead Eyes See No Future, which featured live recordings, along with covers of Manowar, Megadeth and Carcass songs. In June 2004, the band embarked upon Japan touring with Japanese act Edge of Spirit.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:07477549b80c27938bc52bd48ebfb9911ba7526f","amp;dn":"Arch+Enemy+-+We+Will+Rise+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07477549b80c27938bc52bd48ebfb9911ba7526f","infoHashBuffer":{"type":"Buffer","data":[7,71,117,73,184,12,39,147,139,197,43,212,142,191,185,145,27,167,82,111]},"announce":[],"urlList":[]}}