{"title":"Fringe - Seasons 3 thru 5","uid":14624836,"size":8342618099,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:088cadd62ca3336496c739bb16e8018c0fae8897&amp;dn=Fringe+-+Seasons+3+thru+5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":57,"time":1463288369,"description":"Fringe - Seasons 3 thru 5\r\n\r\n\r\n\r\nSeason 3 presents episodes that alternate between the two universes. &quot;Walternate&quot;, Walter's doppelgänger in the parallel universe, is the U.S. Secretary of Defense and has set events in motion to assemble the Machine, a doomsday device that reacts only to Peter's biology.[7] He also sent his Olivia, &quot;Fauxlivia&quot;2, to the prime universe, in Olivia's place, to engage the Fringe Division and assemble the prime universe's version of the device, while he studies Olivia's Cortexiphan-induced powers.[8] By happenstance, Fauxlivia becomes pregnant with Peter's child, Henry, before being outed and extracted to the parallel universe.[9] Walternate orchestrated acceleration of the pregnancy to gain a sample of the baby's blood, which he uses to activate the machine.[10] Peter, with Olivia's help, enters the prime version of the machine, and experiences a vision of the future where the parallel universe has been destroyed and the same fate threatens the prime one, and learns the Machine is really a device created by Walter and his associates from this future, sent back in time purposely to relay this vision of the future to Peter. Recovering in the present, Peter alters his plan and uses the Machine to merge the two rooms, creating a bridge where inhabitants of both universes can solve their dilemma, before disappearing and being forgotten by both Walter and Olivia.[11]\r\n\r\nSeason 4 begins in an alternate timeline, one in which September had failed to save the alternate version of Peter in 1985, according to the Observers.[12] This creates a butterfly effect influencing the main characters' pasts but otherwise stabilizing both universes due to the creation of the bridge. Peter is pulled into this new timeline due to the actions of the alternate timeline's Fringe team, which includes Lincoln Lee (Seth Gabel). Peter initially works to return to his own timeline, fueled by fears that his memories are altering Cortexiphan-dosed Olivia's of this timeline, but after encountering a wounded September, Peter comes to learn that this timeline is truly his home, and both he and Olivia come to accept the change, rekindling their affair.[13] September also reveals to Peter that the Observers needed to erase Peter's son, Henry, to assure their future will be created, though noting that Peter's future child with Olivia will be important.[14] Meanwhile, in the present, William Bell has instructed David Robert Jones, alive in this timeline, to work with the parallel universe's version of Nina Sharp to synchronize the two universes, aiming to collapse them both and pave the way for a third universe under Bell's control, using Olivia's Cortexiphan powers to enable the collapse. The Fringe division is forced to close the dimensional bridge, but this fails to stop Bell's plan. Walter is left with one choice, to shoot and kill Olivia, her death disrupting the process and saving the world. Olivia's &quot;death&quot; is only temporary, as the Cortexiphan in her body is consumed to repair the bullet wound, leaving her alive and healthy but lacking her psionic abilities. As Olivia and Peter begin their lives together, September appears to Walter and warns that the Observers &quot;are coming&quot;.[15]\r\n\r\nThe fifth and final season begins in 2036, following from the flash-forward fourth season episode &quot;Letters of Transit&quot;.[16] As September warned, Observers from the far future, having ruined Earth for themselves, time-traveled to 2015 and instituted &quot;The Purge&quot;, wiped out much of humanity, subjected the survivors to their control, and began modifying the planet's environment to be more suitable for themselves.[17] The Fringe team was able to seal themselves in amber to avoid capture shortly after the Purge, and are reunited through Henrietta (&quot;Etta&quot;) (Georgina Haig), Peter and Olivia's now adult daughter who disappeared shortly after the Observer arrival in 2015. Walter reveals he and September developed a plan to defeat the Observers, revealed through a series of pre-recorded videotapes ambered in the lab. The tapes lead to several components of a device, including a young Observer child, named Michael (Spencer List in Season 1 and Rowan Longworth in Season 5), but further allude to a man named Donald that had helped Walter prepare the plan. Etta is killed during these events, driving Olivia and Peter to complete the plan for her sake. Through Michael, they discover Donald is September, having been stripped of his Observer powers for helping the Fringe team, and that Michael is his genetic son, having been purposely grown as an anomaly in the far future. September explains the plan is to send Michael to the year 2167, where human genetic experiments to sacrifice emotion for intelligence would be started and leading to the creation of the Observers; by showing them Michael, who possesses both emotion and intelligence, the experiments would be stopped and the Observers never created. September is prepared to take Michael to the future as the plan is set in motion, but he is shot and killed at the last moment; Walter, already made aware that he will have to make a sacrifice, takes Michael through to the future to assure the plan's completion. As predicted, time is reset from the invasion onwards in 2015; the Observers never invade, and Peter, Olivia, and Etta, live their lives peacefully—though Peter receives one final letter from his father: a drawing of a white tulip","torrent":{"xt":"urn:btih:088cadd62ca3336496c739bb16e8018c0fae8897","amp;dn":"Fringe+-+Seasons+3+thru+5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"088cadd62ca3336496c739bb16e8018c0fae8897","infoHashBuffer":{"type":"Buffer","data":[8,140,173,214,44,163,51,100,150,199,57,187,22,232,1,140,15,174,136,151]},"announce":[],"urlList":[]}}