{"title":"NBA 2K11 [PC-DVD][Multi5][Spanis][www.consolasatope.com]","uid":5869124,"size":5467439458,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:089f1047b829712b65def140a12e0b90f0299a1a&amp;dn=NBA+2K11+%5BPC-DVD%5D%5BMulti5%5D%5BSpanis%5D%5Bwww.consolasatope.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"consolasatope","files":3,"time":1286392181,"description":"NBA 2K11 es uno de los juegos mÃƒÂ¡s ambiciosos que han hecho y esto no solo se refleja en la cantidad de opciones o la atenciÃƒÂ³n a cada detalle que pusieron en las distintas modalidades de juego, sino que han tomado la decisiÃƒÂ³n de incluir a Michael Jordan como la cereza del pastel, lo cual nos recordarÃƒÂ¡ lo viejos que somos\n\nÃ‚Â¿QuÃƒÂ© hay de nuevo?\n\nComenzando con los cambios principales, aquellos que hayan jugado el demo seguro ya se dieron cuenta de algunos ajustes que se hizo al sistema de control. Una de las crÃƒÂ­ticas mÃƒÂ¡s sonadas para NBA 2K10 fue que tenÃƒÂ­amos que esperar a que la animaciÃƒÂ³n terminara para ejecutar otro movimiento, esto ha sido corregido en la nueva versiÃƒÂ³n y podremos cambiar de ritmo y hacer fintas con nuestro jugador.\n\nEl modo franquicia (Association) tambiÃƒÂ©n tiene agregados, como jugar con estadÃƒÂ­sticas en tiempo real sacadas de los partidos de la NBA. El juego ofrece la posibilidad de conectarse a los servidores y descargar actualizaciones de las alineaciones y desempeÃƒÂ±o de los jugadores reales. Otra modalidad que vimos fue My Player que consiste en crear a nuestra estrella y guiarla en el modo carrera a travÃƒÂ©s de varias temporadas. Hay cientos de opciones para personalizar tanto en cuestiÃƒÂ³n fÃƒÂ­sica como en movimientos.\n\nVisual Concepts tambiÃƒÂ©n tiene opciones para aquellos que quieren disfrutar una sesiÃƒÂ³n mÃƒÂ¡s arcade como las tradicionales clavadas, un concurso de tres puntos y la modalidad street donde podremos jugar con estrellas como Snoop Dog y otros famosos. McDaniels nos comentÃƒÂ³ que fueron los artistas quienes se interesaron por prestar sus rostros y movimientos para aparecer en el juego y no al revÃƒÂ©s, algo que demuestra el poder de influencia que tiene la saga NBA 2K.\n\nAl completar los diez retos se desbloquea un modo carrera donde jugaremos con Jordan en nuestro equipo favorito. A la pregunta de cÃƒÂ³mo balanceas el juego teniendo a alguien como Jordan, McDaniels nos mostrÃƒÂ³ que iniciaremos con el Jordan de 1986, el cual en clavada puede ser maestro, pero en tiros a distancia todavÃƒÂ­a estÃƒÂ¡ demasiado verde. Nuestro objetivo serÃƒÂ¡ ir ajustando sus habilidades a medida que avanzamos.\n","torrent":{"xt":"urn:btih:089f1047b829712b65def140a12e0b90f0299a1a","amp;dn":"NBA+2K11+%5BPC-DVD%5D%5BMulti5%5D%5BSpanis%5D%5Bwww.consolasatope.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"089f1047b829712b65def140a12e0b90f0299a1a","infoHashBuffer":{"type":"Buffer","data":[8,159,16,71,184,41,113,43,101,222,241,64,161,46,11,144,240,41,154,26]},"announce":[],"urlList":[]}}