{"title":"Vancouver 2010 [pcgame-Multi5] [Tntvillage]","uid":5788987,"size":3655270400,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:09d28aff9e43114c56c5d35d5a7da93663411be4&amp;dn=Vancouver+2010+%5Bpcgame-Multi5%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"l.diliberto","files":1,"time":1282765301,"description":"Vancouver 2010 [pcgame-Multi5] [Tntvillage]\n\n[img]http://img641.imageshack.us/img641/2576/cozs.jpg[/img]\n\nData di uscita: 15 gennaio 2010\nVancouver 2010 - Il videogioco ufficiale delle Olimpiadi Invernali.\nSviluppato da Eurocom Entertainment\nPubblicato da Sega\nDistribuito da Halifax\nSupporto: 1 DVD5\nLingue: Multi 5 (Francese-Inglese-Italiano-Spagnolo-Tedesco)\nGenere: simulazione sportiva\n\nVisit this link: \n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=220843&amp;view=findpost&amp;p=12279774&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=220843&amp;view=findpost&amp;p=12279774&lt;/a&gt;\n\nVisit this link: \n &lt;a href=&quot;\nhttp://translate.google.com/?hl=en&amp;sl=auto&amp;tl=en#&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://translate.google.com/?hl=en&amp;sl=auto&amp;tl=en#&lt;/a&gt;\n\n\n.::.Recensione.::.\n\nÃƒË† la seconda volta che il Canada ospita le Olimpiadi Invernali (nel 1988 toccÃƒÂ² a Calgary), ed ÃƒÂ¨ altresÃƒÂ¬ la seconda volta che SEGA si occupa di portare su PC e console il videogame ufficiale dei Giochi. In questo caso il lavoro ÃƒÂ¨ stato affidato a un team di sviluppo interno, che risulta quindi differente rispetto a Beijing 2008; ed ÃƒÂ¨ forse per questo motivo che il gioco finisce per &quot;svolgere il compitino&quot; senza offrire numeri e sostanza.\nMa andiamo con ordine: Vancouver 2010 si presenta come il piÃƒÂ¹ classico dei prodotti multipiattaforma, e nella sua versione per PC (oggetto di questa recensione) non fa nulla per nascondere i molteplici riferimenti al controller per Xbox 360, dispositivo quindi piÃƒÂ¹ che consigliato per godere al meglio dell'esperienza. A parte l'allenamento, sono solo due le modalitÃƒÂ  presenti: la prima, &quot;Giochi Olimpici&quot;, ci permette semplicemente di cimentarci con la disciplina desiderata fra le quattordici disponibili, creando eventualmente una sequenza di gare diverse che vengono coronate dalla simpatica sequenza del podio con tanto di inno nazionale per il vincitore; la seconda, &quot;Sfide&quot;, consiste in una serie di trenta prove d'abilitÃƒÂ  (divise per tre livelli di difficoltÃƒÂ ) che ci chiedono di portare a termine le gare tenendo una certa velocitÃƒÂ , ottenendo un determinato punteggio o producendoci in manovre particolari. Il multiplayer online, tecnicamente di buona qualitÃƒÂ , purtroppo prevede le sole gare contro un singolo avversario e la pubblicazione dei record in una classifica mondiale.\n\n[img]http://img193.imageshack.us/img193/1606/93052483.jpg[/img]  [img]http://img186.imageshack.us/img186/4760/97500478.jpg[/img]\n\nCandide distese\nCome accennato in precedenza, ci sono quattordici discipline che costituiscono le varianti di otto sport. Per lo Sci Alpino abbiamo la Discesa Libera Maschile, il Super-G Maschile, lo Slalom Gigante Femminile e lo Slalom Femminile.\nSi tratta probabilmente dei Giochi piÃƒÂ¹ divertenti e immediati, visto anche il sistema di controllo adottato: bisogna premere ripetutamente il pulsante A del controller alla partenza per ottenere la spinta iniziale, quindi controllare la traiettoria della discesa muovendo lo stick analogico sinistro e la posizione del personaggio utilizzando il grilletto sinistro e destro, rispettivamente per farlo alzare (e quindi stringere di piÃƒÂ¹ le curve) e per farlo abbassare (guadagnando velocitÃƒÂ ). Ci sono due visuali disponibili (si puÃƒÂ² passare dall'una all'altra premendo il pulsante B), ovvero in terza e in prima persona, che offrono un feeling molto differente: quella in terza persona fornisce maggiore controllo e permette di goderci l'animazione del personaggio, quella in prima persona ÃƒÂ¨ senz'altro piÃƒÂ¹ spettacolare e coinvolgente, grazie anche a un effetto &quot;tremore&quot; che conferisce alla discesa un grande realismo. Il Salto ÃƒÂ¨ presente in un'unica variante, ovvero il Trampolino lungo: individuale maschile. Si tratta della tipica disciplina basata esclusivamente sul tempismo, e infatti ci viene chiesto di premere il pulsante A per selezionare l'attimo di partenza in base alla forza del vento, premerlo nuovamente per regolare lo slancio prima del volo e infine per predisporci all'atterraggio dopo avere eventualmente mantenuto l'equilibrio tramite i grilletti dorsali. Imparare a saltare in lungo ÃƒÂ¨ una faccenda che porta via poco tempo, ma altrettanto in fretta scema il fascino della disciplina rispetto ad altre dotate di maggior spessore.\n\n[img]http://img266.imageshack.us/img266/9845/38017098.jpg[/img]  [img]http://img18.imageshack.us/img18/452/67736357.jpg[/img]\n\nAtmosfera natalizia\nIl Freestyle ÃƒÂ¨ presente in Vancouver 2010 sotto forma di Ski Cross femminile e Salti femminile: nel primo caso si tratta di affrontare una gara di velocitÃƒÂ  in gruppo, dunque con tutti gli avversari in pista contemporaneamente, e per ottenere una buona prestazione ÃƒÂ¨ necessario imparare bene le traiettorie del percorso nonchÃƒÂ© spiccare i salti al momento giusto per non perdere velocitÃƒÂ .\nLa disciplina dei Salti, molto differente, risulta davvero spettacolare nelle sue implicazioni visive e piuttosto complessa nell'esecuzione: si sceglie una manovra piÃƒÂ¹ o meno difficile fra quelle disponibili, quindi ci si lancia sul trampolino e poi si muovono gli stick analogici disegnando dei cerchi &quot;coordinati&quot; con quelli visualizzati sullo schermo. Un'esperienza breve, dunque, ma che richiede un bel po' di pratica per essere padroneggiata nelle sue applicazioni piÃƒÂ¹ avanzate. Lo Snowboard ci propone due prove, Slalom Gigante Parallelo maschile e Snow Cross maschile, che alla fine dei conti fanno il verso rispettivamente allo Slalom Gigante femminile e all'appena citato Ski Cross femminile: le regole e il feeling sono praticamente gli stessi, dunque ci sono ben poche sorprese. Il Pattinaggio ancora una volta va a piazzarsi in fondo nell'ordine di preferenza degli sport invernali in versione videoludica, purtroppo, con due alternative (500 m e 1500 m femminile) di scarso valore, mentre completano l'offerta tre discipline di velocitÃƒÂ  abbastanza simili fra loro: Bob a due, Skeleton maschile e Slittino singolo maschile. I risvolti spettacolari sono indubbi, ma si pone forse troppa enfasi sulla precisione e ne risulta un'esperienza un po' frustrante.\n\n[img]http://img51.imageshack.us/img51/4951/12910110.jpg[/img]  [img]http://img21.imageshack.us/img21/8214/24153368.jpg[/img]\n\nNeve al sole\nIl comparto tecnico del nuovo titolo SEGA risulta molto ben curato, con una serie di soluzioni davvero spettacolari e indovinate: la visuale in prima persona (vedi soprattutto il salto in lungo), l'effetto &quot;scossone&quot; a sottolineare la foga e la velocitÃƒÂ , le ottime animazioni dei personaggi e una conta poligonale di tutto rispetto, in grado di offrirci paesaggi dettagliati anche in lontananza.\nSembra che la componente visiva sia stata messa al primo posto, sacrificando magari tutto il resto, e bisogna ammettere che il lavoro svolto ÃƒÂ¨ encomiabile. Persino i siparietti con le premiazioni sul podio risultano simpatici e verosimili, mentre tutto viene arricchito da una regia sapiente e dinamica, che dÃƒÂ  il proprio meglio anche e soprattutto durante gli immancabili replay al termine di ogni gara. Provato su un tutt'altro che mostruoso Athlon64 X2 5000+ con ATI HD4870 al seguito, alla risoluzione di 1680 x 1050 pixel, con tutti gli effetti al massimo e il v-sync attivato, il gioco si ÃƒÂ¨ comportato molto bene, ancorandosi a un frame rate di 30 fps e mostrando il fianco a poche incertezze: la sensazione ÃƒÂ¨ che si possa giocarlo in modo dignitoso anche su configurazioni relativamente modeste. Merita senz'altro una menzione il comparto sonoro, costituito da una serie di brani firmati di buona qualitÃƒÂ , coinvolgenti al punto giusto, e da effetti realistici e convincenti.\n\nVisit thelink:\n\nInstallazione:\nMontate o masterizzate il file immagine. Installate il gioco e buon divertimento.\nNote: tenete presente che A=J e B=K\n\nIl gioco ÃƒÂ¨ stato testato su windows XP SP3\n\nRequisiti Minimi  \nProcessore Pentium 4 da 3.0 GHz o equivalente AMD\n1 GB di RAM\nScheda video nVidia GeForce 7600GT o ATI Radeon 2900\n6 GB di spazio libero su hard disk\nSistema operativo Windows XP, Windows Vista o Windows 7\n\nRequisiti Consigliati\nProcessore Intel Core 2 Duo da 1,8 GHz o equivalente AMD\n2 GB di RAM\nScheda video nVidia GeForce 8600GT o ATI Radeon 3600\n6 GB di spazio libero su hard disk\nSistema operativo Windows XP, Windows Vista o Windows 7\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:09d28aff9e43114c56c5d35d5a7da93663411be4","amp;dn":"Vancouver+2010+%5Bpcgame-Multi5%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09d28aff9e43114c56c5d35d5a7da93663411be4","infoHashBuffer":{"type":"Buffer","data":[9,210,138,255,158,67,17,76,86,197,211,93,90,125,169,54,99,65,27,228]},"announce":[],"urlList":[]}}