{"title":"Tokyo Drifter (1966)","uid":6549821,"size":1219110582,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:09ebad8f4536a2aad5485977bb7a2ab901643a74&amp;dn=Tokyo+Drifter+%281966%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"jericho_cane","files":6,"time":1311031907,"description":"Movies : Crime : DVD Rip : Japanese\nActors: Tetsuya Watari, Chieko Matsubara, Hideaki Nitani, Ryuji Kita, Tsuyoshi Yoshida\nDirectors: Seijun Suzuki\nFormat: Black &amp; White, Color, Letterboxed, Subtitled, Widescreen, NTSC\nLanguage: Japanese\nRegion: Region 1\nAspect Ratio: 2.35:1\nNumber of discs: 1\nRating NR\nStudio: Criterion\nDVD Release Date: February 23, 1999\nRun Time: 83 minutes\nDVD Features:\n\n* Available Subtitles: English\n* Available Audio Tracks: Japanese (Dolby Digital 1.0)\n\nEditorial Reviews\nSeijun Suzuki transforms the yakuza genre into a pop-art James Bond cartoon as directed by Jean-Luc Godard. The near-incomprehensible plot is almost negligible: hitman &quot;Phoenix&quot; Tetsu (Tetsuya Watari), a cool killer in dark shades who whistles his own theme song, discovers his own mob has betrayed his code of ethics and hits the road like a questing warrior, with not one but two mobs hot on his trail. In a world of shifting loyalties Tetsu is the last honorable man, a character who might have stepped out of a Jean-Pierre Melville film and into a delirious, color-soaked landscape of a Vincent Minnelli musical turned gangster war zone. The twisting narrative takes Tetsu from deliriously gaudy nightclubs, where killers hide behind every pillar, to the beautiful snowy plains of Northern Japan and back again, leaving a trail of corpses in his wake. Suzuki opens the widescreen production in stark, high-contrast black and white\nwith isolated eruptions of color that finally explode in a screen that glows in oversaturated hues, like a comic book come to life. His extreme stylization, jarring narrative leaps, and wild plot devices combine to create a pulp fiction on acid, equal parts gangster parody and post-modern deconstruction. Andrew Sarris described Sam Fuller's films as works that &quot;have to be seen to be understood,&quot; a characterization that applies even more in this case. Mere description cannot capture the visceral effect of Suzuki's surreal cinematic fireworks. --Sean Axmaker\n\nProduct Description\nIn this free-jazz gangster film, reformed killer &quot;Phoenix&quot; Tetsu drifts around Japan, awaiting his own execution until he's called back to Tokyo to help battle a rival gang. Seijun Suzuki's &quot;barrage of aestheticised violence, visual gags, [and] mind-warping color effects&quot; got him in more trouble with Nikkatsu studio heads, who had ordered him to &quot;play it straight this time.&quot; Instead he gave them equal parts Russ Meyer, Samuel Fuller, and Nagisa Oshima. Criterion presents the DVD premiere of Tokyo Drifter in a lush color transfer from the original, glorious Nikkatsu-scope master.","torrent":{"xt":"urn:btih:09ebad8f4536a2aad5485977bb7a2ab901643a74","amp;dn":"Tokyo+Drifter+%281966%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09ebad8f4536a2aad5485977bb7a2ab901643a74","infoHashBuffer":{"type":"Buffer","data":[9,235,173,143,69,54,162,170,213,72,89,119,187,122,42,185,1,100,58,116]},"announce":[],"urlList":[]}}