{"title":"Sebastian Fitzek - The Child","uid":12625988,"size":267501310,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0c02a91f9ed52063e296cedd14248fd283bb172e&amp;dn=Sebastian+Fitzek+-+The+Child&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":55,"time":1445772997,"description":"My name is Simon. I’m 10 years old. I’m a serial killer. Robert Stern (Rupert Penry-Jones), a successful defense attorney, doesn’t know what lies in store for him when he agrees to meet a new client in a derelict estate on the outskirts of Berlin. Stern is more than surprised, when his old love interest and professional nurse Carina (Emilia Fox) presents him a ten year old boy as his new client. Simon (Jack Boulter), a terminally ill child, who is convinced he has murdered many men in a previous life.\r\n\r\nRobert’s surprise turns into horror when he and Carina find human remains in a cellar the boy has led them to. The remains of a man whose head has been split with an axe 15 years ago - just like Simon claimed he had. Things go from bad to worse within hours when Stern discovers more dead bodies, the investigating police officer Engler (Andy Serkis) starts to chase him as a suspect in the murder cases, and his own past comes to haunt him. Stern’s friend and former criminal Andi Borchert (Stephen Marcus) is the only one to believe Stern and Carina. Hunted by the police, and led by Simon’s memories, they start to investigate shady sub cultures of Berlin, and soon discover things that more gruesome than anything they could have imagined…\r\n\r\nAudible Studios London presents a gripping audio dramatisation by Sebastian Fitzek, Germany’s most successful thriller writer, whose books are read around the world in more than 20 different languages. This unabridged dramatisation introduces listeners to a completely new approach to audio entertainment, a full-length dramatised book adaption with an original score and soundscapes from the heart of Berlin. Featuring amazing performances by a cast of over 20 actors in a breathtaking plot, The Child provides a truly immersive listening experience.\r\n\r\n\r\nRead by Rupert Penry-Jones, Jack Boulter, Emilia Fox, Stephen Marcus, Robert Glenister, Andy Serkis\r\nFormat: MP3\r\nBitrate: 96 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:0c02a91f9ed52063e296cedd14248fd283bb172e","amp;dn":"Sebastian+Fitzek+-+The+Child","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c02a91f9ed52063e296cedd14248fd283bb172e","infoHashBuffer":{"type":"Buffer","data":[12,2,169,31,158,213,32,99,226,150,206,221,20,36,143,210,131,187,23,46]},"announce":[],"urlList":[]}}