{"title":"Heavenly Creatures (Peter Jackson, 1994)","uid":3417668,"size":735747739,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0d2a107ca5b987e17d35bd5e215e967e201a0634&amp;dn=Heavenly+Creatures+%28Peter+Jackson%2C+1994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Bluesoul","files":5,"time":1133794162,"description":"Heavenly Creatures\nDirected by: Peter Jackson\t\nYear: 1994\nLanguage: English\nSubtitles: English, French, Spanish, Swedish\n\nRuntime: 01:35:19 \nVideo Codec: XviD\nVideo Bitrate: 889 kb/s\nResolution: 608x256 (2.38:1) [=19:8]\nFPS: 25.000\nAudio:  MP3 131 kb/s (65/ch, stereo) VBR LAME3.92\n\nPlot: Based on the true story of Juliet Hulme and Pauline Parker, two close friends who share a love of fantasy and literature, who conspire to kill Pauline's mother when she tries to end the girls' intense and obsessive relationship. \n\nHeavenly Creatures is not your average film; it's done with a technique that is not common in the business, and therefore has been both criticised and praised. The technique is used by not just filming a story and it's actions, but by actually showing the side of the girls' vivid imaginations. \n\nThis was done through the elaborate sequences of the girls' fantasies. This way of filming shows how the pair justified the crime they commit, a vital part of the story. The plot itself does not trail far from the true story, except for the fact of inferred lesbianism between the two girls. (Something the real-life Juliet Hulme has vehemently denied) So it's anyone's guess as to whether or not which possibility is the truth. Visually, this movie is stunning. The landscape of Christchurch and the surrounding area is beautiful, and adds a sense of authenticity to the film. The voice overs are extracts from the real Pauline's diary, and explain very well what exactly is going on inside of her head. All in all, a very good portrayal by all of the actors (obviously on the part of Melanie Lynskey and Kate Winslet) and the music is exquisite.\n\nPeter Jackson did make movies like Braindead, the whole LOTR Trilogy and now King Kong, but this is something quite different not similar to anything else he had done (before and after), an extraordinary movie with brilliant acting, my favorite PJ movie, enjoy it! :)\n\n\n***********************************************************************************\n\nwww.freakyflicks.tk\n\nSEED AS LEAST AS MUCH AS YOU HAVE DOWNLOADED...PLEASE!\n\n'If we all seed just 1:1, give at least what we take, these torrents will NEVER DIE'\n\nSimply search for 'freakyflicks' \n*************************************** \n************** FREAKYFLICKS ************* \n***************************************","torrent":{"xt":"urn:btih:0d2a107ca5b987e17d35bd5e215e967e201a0634","amp;dn":"Heavenly+Creatures+%28Peter+Jackson%2C+1994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d2a107ca5b987e17d35bd5e215e967e201a0634","infoHashBuffer":{"type":"Buffer","data":[13,42,16,124,165,185,135,225,125,53,189,94,33,94,150,126,32,26,6,52]},"announce":[],"urlList":[]}}