{"title":"Pringle&amp;Spigelman - The Nuclear Barons (architects of nuclea","uid":8508478,"size":2342845,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d8eed3e770cdee728887286f7a755561e5b8602&amp;dn=Pringle%26amp%3BSpigelman+-+The+Nuclear+Barons+%28architects+of+nuclea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1369499156,"description":"This is Peter Pringle's and James Spigelman's shocking book The Nuclear Barons - The Inside Story of How They Created Our Nuclear Nightmare (1982) which documents how an international elite of scientists, technocrats and businessmen controlled the world's destiny for decades. When the first atomic bomb erupted over the New Mexican desert the world lost its innocence. Within a decade the column of cloud and fire which was meant to lead to a promised land of endless peace and energy was leading instead to Armageddon. This fascinating book tells for the first time the full story of the nuclear era and its architects. It details the tests, from Australia to Bikini atoll, and exposes the deadly accidents, cynical cover-ups, ruthless profiteering, megalomanic ignorance and wilfull evasions of democratic control which characterise the nuclear industry. Their decisions - usually kept secret, often shortsighted, sometimes veiled by lies and obfuscations - have led inexorably to the present nuclear mess. Radiation hazards, prohibitively costly energy, waste-disposal problems, plant safety, weapons proliferation: the nuclear nightmares we live with are the direct result of choices that were never thought through to their logical conclusions, never opened to public debate. The Nuclear Barons is a damning indictment of the folly and greed of a race for power which has brought the world to the edge of destruction. 560 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:0d8eed3e770cdee728887286f7a755561e5b8602","amp;dn":"Pringle%26amp%3BSpigelman+-+The+Nuclear+Barons+%28architects+of+nuclea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d8eed3e770cdee728887286f7a755561e5b8602","infoHashBuffer":{"type":"Buffer","data":[13,142,237,62,119,12,222,231,40,136,114,134,247,167,85,86,30,91,134,2]},"announce":[],"urlList":[]}}