{"title":"Castle Story v0.4.1","uid":11988803,"size":257372452,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0da743c91cc59c8bf2d47015b7159360fc16d6e8&amp;dn=Castle+Story+v0.4.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1433441217,"description":"\nAbout This Game\nCastle Story is a creative voxel-based strategy game in which you can build castles one brick at a time using an army of little characters called Bricktrons.\n\nYour goal will be to explore a vast landscape full of mysteries and dangers, and defend your castle against onslaughts of hostile creatures and possibly other players.\n\nThe world of Castle Story takes place on flying islands, high above an infinite ocean. The islands are made of voxels, cubes made of various elements, which means you can dig, carve and build anything you can imagine in the landscape. Digging underground to gather resources, stacking bricks on top of each other to build a wall or even tunnelling through a mountain is all possible and even necessary to keep your Bricktrons safe.\n\nCarefully designing your castle not only requires creativity and imagination, but thanks to pathfinding AI and physics simulations, Castle Story has layers of strategy and depth on top of an otherwise free-form sandbox experience.\n\nCastle Story will be released for Windows &amp; Mac (with possible Linux support once Unity4 is released).\nKey Features\n\n    Build any structure you can imagine! Using 2x1 blocks, create structures that are not only good-looking, but also functional. Your Bricktrons need to be able to navigate your castle to build it and to keep the monsters out!\n    Physics! Watch a tower crumble to the ground realistically when its foundations can no longer support it. The entire world obeys to the laws of physics which means that you need to build cleverly so your castle can withstand attacks from projectiles and explosives.\n    Sandbox! Build a huge sprawling fortress, a single impenetrable bunker or a network of underground tunnels. The choice is yours. Castle Story rewards imagination and ingenuity.\n    Strategy! Command your Bricktrons as they build your castle brick by brick. Manage the way they work, what resources they gather, and the places they explore. Use your resources to build weapons and armor for your Bricktrons and all kinds of upgrades for your castle.\n    Combat! Using shields, swords, bows and lots more, your Bricktrons can defend themselves against the hostile creatures inhabiting the world of Castle Story. Lead your Bricktrons through tough fights, and use your wits to gain an advantage. You can even build catapults to rain destruction on your foes!\n    Magic! The world of Castle Story is permeated with all kinds of magic. Discover resources with magical auras and learn to mix them to create effects. Explore strange places and find mysterious artifacts left behind by unknown civilizations","torrent":{"xt":"urn:btih:0da743c91cc59c8bf2d47015b7159360fc16d6e8","amp;dn":"Castle+Story+v0.4.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0da743c91cc59c8bf2d47015b7159360fc16d6e8","infoHashBuffer":{"type":"Buffer","data":[13,167,67,201,28,197,156,139,242,212,112,21,183,21,147,96,252,22,214,232]},"announce":[],"urlList":[]}}