{"title":"Metallica - Master Of Puppets 1986 (Unique Custom Remaster, 2007","uid":3746876,"size":109057358,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0ee65d2b6f7faaa6e13177f1abd35e7e33070881&amp;dn=Metallica+-+Master+Of+Puppets+1986+%28Unique+Custom+Remaster%2C+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Tech-Noir","files":10,"time":1184867964,"description":"(Note: I have uploaded both a Lossless .FLAC and a VBR .MP3 of this album).\n\n\nMetallica - Master Of Puppets 1986 (Unique Custom Remaster, 2007) MP3 VBR\n\n\n-----------------------------------------------------------------------\nTechnical Info\n-----------------------------------------------------------------------\n\n-Source material:\nTracks 1-8: FLAC Lossless (&quot;Metallica - Master Of Puppets (Remastered) (FLAC) {Team Gnostic}&quot;)\n\n\n-New Encoding:\nMP3 VBR (Variable Bitrate, High Quality)\n\n\n-Total Size:\n104 MB\n\n\n-Total Play Time:\n0:54:44\n\n\n-Tracklist:\n1. Metallica - Battery (Remastered) (5:12)\n2. Metallica - Master of Puppets (Remastered) (8:36)\n3. Metallica - The Thing That Should Not Be (Remastered) (6:37)\n4. Metallica - Welcome Home (Sanitarium) (Remastered) (6:27)\n5. Metallica - Disposable Heroes (Remastered) (8:16)\n6. Metallica - Leper Messiah (Remastered) (5:40)\n7. Metallica - Orion (Instrumental) (Remastered) (8:27)\n8. Metallica - Damage, Inc. (Remastered) (5:29)\n\n\n\n\n-----------------------------------------------------------------------\nGeneral info\n-----------------------------------------------------------------------\n\nI &quot;remastered&quot; Slipknots &quot;vol 3 - The Subliminal Verses&quot; about 2 years ago or something, and it became a pretty popular torrent with about 3000+ downloads from TPB. The comments were also very positive for it. Not saying that the people who downloaded it, or me for that matter, are qualified to properly judge audio fidelity or quality. But the result was pretty good I reckon.\n\nSo now I thought I would do the same again. I recently downloaded Metallica&amp;#039;s &quot;Master Of Puppets&quot; mostly because I thought I&amp;#039;d see what all the fuzz is about. I only enjoy some select groups in rock and such, mostly a Trance, Electronic, Vangelis type listener.\n\nAnyways, I liked the songs alot (I enjoy nice guitar lines sliiightly more than &quot;emo&quot; lyrics, or screaming your head off, you know, things like that).\n\nBut I was struck by the extremely poor quality. Now, unlike Slipknot&amp;#039;s &quot;Vol. 3&quot; (2005) this was recorded back in 1986, so I&amp;#039;m not really complaining.\nBut I even managed to track down a .FLAC torrent which specified it as &quot;remastered&quot;, and I found no differences other than the volume and maybe some very subtle changes. The remaster was from 1999, so I guess they just took the original tapes, and ran them through some other equipment that didn&amp;#039;t change a whole lot (still very weirdly mixed, and very hard to listen to in my opinion.\n\n\nStill, people enjoy this album so much, so imagine how much they might like a more &quot;proper&quot; version which has been thoroughly processed to meet the standards of recent or even current records... :)\n\n\nAnyways, I can objectively say that there is a HUGE difference between the source album and the final results. Not just a subtle vacuum compressor added, or something like that. There is alot of stuff I&amp;#039;ve done, that together help in taking the sonics of a 1986 album to 2007.\n\n\n\nHere are some examples:\n\n\nDenoising: The tapenoise is present on all tracks, especially on quiet sections or on soft guitar-intros etc (&quot;Battery&quot; intro for example). It has also been made alot more audible with some Equalizing I&amp;#039;&amp;#039;ve done. But thanks to the wonders of VSTs, that&amp;#039;s gone, and I mean completely. Care has been taken to keep all the actual music in, and only affect the noise that shouldn&amp;#039;t be there.\n\n\nEqualizing: Lots of it. Balancing the audio spectrum to make sure no parts stick out and pierce your eardrums when you turn up the volume. Also, this balancing makes the sound just sound overall &quot;fatter&quot;. The original had certain parts of the spectrum boosted compared to other, so you ended up with thin &quot;peaks&quot; of sound, and the rest was not easily heard from underneath.\n\n\nBass Processing: Subharmonic generators are great. Because of the quite poor mixing and equalizing of the original source (aswell as probably limitations and such of older recording technology), the bassguitar is often not heard at all, except for during less busy parts of tracks. There isn&amp;#039;t much low-end or bass in it (if you are used to listen to modern records you will notice it alot). The low-end was also quite wobbly and weirdly recorded, it lacked alot of tightness.\nSO what I have done is actually high-passing some of the low-end, to get rid of some of that. After that, a Bass-ehancer is used to get some low-end back. It actually analyses a higher portion of the audio spectrum (for example the more high-frequency part of the bass guitar present in the mixes) and from that it constructs a synthetic low-end that matches the higher part. If done right, the result can be excellent. I think it sounds pretty good. :)\n\n\nStereo work: Some slight stereo-enhancing has taken place. Nothing big, but it adds to the overall sound. If you overdo this, you can ruin the dept-perception of far-sounding instruments like the reverb of a snaredrum, or a guitar line with reverb. So subtle changes only.\n\n\nHigh-End enhancing: Similar to Bass Processing and Subharmonic generators, only it affects the high-end. It analyses audio to add new content to the audio signal. This can be used to great effect to add new sparkle to a track that lacks a high-end altogether, or you can just use it to spice up the already present sizzle of a track. Also, it can add a great sense of air to the highest part of the audio spectrum. If the recording sounds very muffled or &quot;closed&quot; for some reason, this little processor can add a &quot;shimmer&quot; that helps alot in making the track easier to listen to thanks to a much more &quot;open&quot; feel. A subtle change also (and not really necssary in this case because there was high-end already there), but the openness you get, along with the slight uppwards expansion of certain instruments and reverbs, makes it a welcome contribution.\n\n\nCompression etc: I&amp;#039;m not a fan of compression with traditional compressors, especially not in situations like these. I&amp;#039;ve instead used tape-like processors, that don&amp;#039;t have the prone-ness to pumping that normal &quot;threshold&quot; compressors can have.\nThe effect of tape-processors is transparent and continuous, so you never get a sense of the compression kicking in at a certain volume. The source here is quite punchy and transient-rich, so you can use quite aggressive settings with great results. Even thought it can be very hard to actually &quot;hear&quot; the result, A-B-ing reveals a &quot;fatter&quot; sounds that still retains alot of punch and openness.\n\n\nTransient Processing: Nothing changed in the upper frequencies, but the low-end kicks a bit more and is less flat. Bass-frequencies bounce and move more volume-wise.\n\n\n\nOther notes:\n\nSome &quot;issues&quot; are still there. There is clicking in parts of tracks or just a small section or just a single click here and there. In some cases it sounds like clipping (and in some cases it could be clipping from the original source) but I didn&amp;#039;t introduce any of the obvious ones atleast. :) Some weren&amp;#039;t even audible before I equalized and such, and others are just do to old technology while recording. I don&amp;#039;t have the desire to swat them out one by one, and click-reduction almost always affects the attacks and &quot;good&quot; clicks from snares, hihats and such, if only little. So this was not a priority and not used here.\n\n\nDistorted and &quot;loose&quot;-sounding Bassguitar in certain parts (certain sections of &quot;The Thing That Should Not Be&quot; where the guitar goes down low in pitch and climbs back up). Not my fault, its in the original recordings and made somewhat &quot;worse&quot; by equalizing. It would need re-recording to fix properly, and although I don&amp;#039;t like the sound of it at all, you will have to take it as nostalgia. Besides, if you were enjoying the original sound... ;)\n\nOverall, this is, in quality aspects, a really polished turd. So the sound will sometimes be accordingly.\n\n\n\nCreative changes: There are a few &quot;Creative&quot; changes made, that are different from equalizing and other things (that only alter volume etc of already existing sound information). Some processors add new audio that wasn&amp;#039;t there before, namely the Bass and High-End Processors. The Stereo work also add some new material, although it only adds a subtle &quot;presence&quot; and is largely negligible.\n\n\nBut, since I think that some of these aspects add to the sound, and some were necessary, I added them with good conscience. I also think this album really deserved some really large changes to cram the most out of it.\n\n\nSo, that&amp;#039;s all the info you&amp;#039;ll need I think. Any questions PM or just ask directly in the torrent-message thingy area.\n\n\n\n\nNow, just turn up the volume, and enjoy. ;)","torrent":{"xt":"urn:btih:0ee65d2b6f7faaa6e13177f1abd35e7e33070881","amp;dn":"Metallica+-+Master+Of+Puppets+1986+%28Unique+Custom+Remaster%2C+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ee65d2b6f7faaa6e13177f1abd35e7e33070881","infoHashBuffer":{"type":"Buffer","data":[14,230,93,43,111,127,170,166,225,49,119,241,171,211,94,126,51,7,8,129]},"announce":[],"urlList":[]}}