{"title":"Roger Morrice Entring Book","uid":4821570,"size":15337201,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f0ae641843ab6399f9c7427153b2295642d0e3c&amp;dn=Roger+Morrice+Entring+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"historyman","files":1,"time":1238782907,"description":"The Roger Morrice Entring Book Project\n\n\nIntroducing the Morrice Project\nThe Morrice Project exists to publish Roger Morrice's Entring Book, the most important unpublished record of British political and religious history of the second half of the seventeenth century. The fragile, three volume, 1500 page manuscript of Roger Morrice's Entring Book is in Dr Williams's Library, 14 Gordon Square, London, the pre-eminent research library of English Protestant Nonconformity. The Entring Book is 900,000 words long and covers the years 1677 to 1691 \n\nThe Entring Book and its author\nThe Entring Book is a key resource for British history during the later seventeenth century. Its author, Roger Morrice (1628-1702), was a puritan minister turned political journalist and agent for senior Whig politicians. He was astonishingly well connected and well informed, a discreet go-between, a conduit of public business, and a barometer of public opinion. \n\nMorrice was passionately committed to the defeat of absolutism in government and intolerance in the church. The Entring Book is not a personal diary but a chronicle of public affairs. It sets out to record the odyssey of a godly people - and of a class of parliamentary magnates - in the face of 'popery and arbitrary power'. Through it we can trace the transformation of puritanism into Whiggery and Dissent. \n\n\nMorrice's index to the Entring Book \n\nThe Scope of the Entring Book\nThe Entring Book is a rich source for much else besides. It touches upon many aspects of Restoration society: its social structure, urban growth, institutions and personalities, theatre, the royal court, the judges' courts, military and colonial affairs, foreign relations, London commerce, parish, ward and livery company politics, worship, piety and blasphemy, the culture of anti-popery, the governance of Scotland and Ireland, and the flow of news across Continental Europe. \n\nIt is informative about printing, bookselling, and the promotion and control of the press. It provides an intricate account of the fabric of metropolitan life, its topography and social geography. It offers closely observed accounts of spectacle, ceremonial, drama, music, celebration, riot and demonstration. There are comments on plays, fireworks, masquerades, fires, the weather, duels, executions, and suicides. \n\nPublication\nIn 2007 the Entring Book was published in six volumes, including a companion volume and a biographical dictionary. See www.boydell.co.uk. \n\nVol. 1\n Roger Morrice and the Puritan Whigs \nDr Mark Goldie, University of Cambridge \n \nVol. 2\n The Reign of Charles II, 1677-1685 \nProfessor John Spurr, University of Wales, Swansea \n\n \nVol. 3\n The Reign of James II, 1685-1687 \nProfessor Tim Harris, Brown University, Providence, Rhode Island \n\n \nVol. 4\n The Reign of James II, 1687-1689 \nProfessor Stephen Taylor, University of Reading \n\n \nVol. 5\n The Reign of William III, 1689-1691 \nProfessor Mark Knights, University of Warwick \n\n \nVol. 6\n Biographical Dictionary and Glossary \nDr Jason McElligott, Merton College, Oxford \n \n","torrent":{"xt":"urn:btih:0f0ae641843ab6399f9c7427153b2295642d0e3c","amp;dn":"Roger+Morrice+Entring+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f0ae641843ab6399f9c7427153b2295642d0e3c","infoHashBuffer":{"type":"Buffer","data":[15,10,230,65,132,58,182,57,159,156,116,39,21,59,34,149,100,45,14,60]},"announce":[],"urlList":[]}}