{"title":"Charmed","uid":8554560,"size":66405074432,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1043eb1e8e26c9548c1734db86fec7042e99a918&amp;dn=Charmed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Nailit","files":203,"time":1370728419,"description":"This torrent is for the TV series &quot;Charmed&quot; beginning with season one and ending at season eight.  All of the files have been named so they will be recognized by XBMC immediately.\n  \nCharmed is an American television series created by writer Constance M. Burge and produced by Aaron Spelling and his production company Spelling Television, with writer/director Brad Kern as showrunner. The series was originally broadcast by The WB Television Network for eight seasons from October 7, 1998, until May 21, 2006.\n\nThe series narrative follows three sisters, known as the Charmed Ones, the most powerful good witches of all time, whose prophesied destiny is to protect innocent lives against evil beings such as demons and warlocks. Each sister possesses individual unique magical powers that grow and evolve, while they attempt to maintain seemingly normal lives in modern day San Francisco. Keeping their supernatural identities separate and secret from their ordinary lives often becomes a challenge for them, with the exposure of magic having far-reaching consequences on their various relationships and resulting in a number of police and FBI investigations throughout the series.","torrent":{"xt":"urn:btih:1043eb1e8e26c9548c1734db86fec7042e99a918","amp;dn":"Charmed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1043eb1e8e26c9548c1734db86fec7042e99a918","infoHashBuffer":{"type":"Buffer","data":[16,67,235,30,142,38,201,84,140,23,52,219,134,254,199,4,46,153,169,24]},"announce":[],"urlList":[]}}