{"title":"Medieval Romantic Legends - Kathryn Le Veque","uid":13419838,"size":1182325,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10524f8e73c535b5d6b725fdf0b2e88263d0bba8&amp;dn=Medieval+Romantic+Legends+-+Kathryn+Le+Veque&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1454537705,"description":"Le Veque... Prince... Rose... Woodbury.\r\n\r\nFour bestselling Medieval authors come together in yet another magnificent collection. Welcome to Medieval Romantic Legends, where the passion and pagentry of the Middle Ages weaves its particular brand of magic. This bundle contains:\r\n\r\nThe Gorgon by Kathryn Le Veque: A battle-scarred warrior joins the tournament circuit after his wife dies, trying to flee memories and rumors. When he meets a lady with painful secrets, an unexpected love develops that may cost him everything.\r\n\r\nThe Baron's Quest by Elizabeth Rose: Muriel Draper, daughter of a clothmaker, is forced to take a job as the personal clothier of Lord Nicholas Vaughn - Baron of the Cinque Ports, in order to pay back her late father's debt. Will a man's title and a woman's pride stop the passion that is spinning out of control between them?\r\n\r\nHighland Redemption by Emma Prince: When a hardened Highland warrior is sent by Robert the Bruce to the borderlands, he never expects to encounter the most beautiful lass he's ever seen, but when he learns that she is his enemy's sister, he must choose between his mission and his heart.\r\n\r\nThe Lion of Wales by Sarah Woodbury: A tale of timeless love, heroic courage … and a race to change the course of destiny itself. This is King Arthur as you've never seen him before","torrent":{"xt":"urn:btih:10524f8e73c535b5d6b725fdf0b2e88263d0bba8","amp;dn":"Medieval+Romantic+Legends+-+Kathryn+Le+Veque","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10524f8e73c535b5d6b725fdf0b2e88263d0bba8","infoHashBuffer":{"type":"Buffer","data":[16,82,79,142,115,197,53,181,214,183,37,253,240,178,232,130,99,208,187,168]},"announce":[],"urlList":[]}}