{"title":"The Nightmare Scenario - Gunnar Duvstig","uid":11645251,"size":563752,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10d45b3ebf6dd9e0af243254261473969685e0ff&amp;dn=The+Nightmare+Scenario+-+Gunnar+Duvstig&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"svantung","files":2,"time":1417815926,"description":"Review from Amazon that says it all:\n\nThe Nightmare Scenario is a rare gem of a book. In a genre plagued by shallow dialogue and medical inaccuracies, Gunnar Duvstig has clearly taken his time to do the research. In this suspenseful medical thriller, Duvstig paints a bleak picture of a future society threatened by a potent pandemic, and the ultimate risk of annihilation. He guides the reader through interwoven stories from far flung corners of the world, and introduces characters that it is hard to let go of when you read the last page. A well-written, exhilarating read.\n\n---\n\nPlot:\n\nWhen a catholic nurse discovers an entire village wiped out in the Papua province of Indonesia, the WHO sends a team to investigate. The investigation yields no definitive results and speculations within the team ranges from a freak immune system response to ebola. \n\nThree weeks later a local hospital in the Maluku Islands reports seven deaths from something they believe to be a new strain of influenza. \n\nAs the closest lab in Singapore concludes its analysis of these cases it becomes clear that the cause of death is neither a freak immune system response nor ebola. \n\nIt's something much worse - a virus with the potential to kill more than a billion people and bring the entire world to a halt","torrent":{"xt":"urn:btih:10d45b3ebf6dd9e0af243254261473969685e0ff","amp;dn":"The+Nightmare+Scenario+-+Gunnar+Duvstig","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10d45b3ebf6dd9e0af243254261473969685e0ff","infoHashBuffer":{"type":"Buffer","data":[16,212,91,62,191,109,217,224,175,36,50,84,38,20,115,150,150,133,224,255]},"announce":[],"urlList":[]}}