{"title":"Micronauts","uid":4347454,"size":955096601,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:11292f5a8606fd1b428439e79600d0bb72b5541a&amp;dn=Micronauts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"gilgamesh07","files":116,"time":1218958582,"description":"By request from the forums. This torrent contains all of the Micronauts comics that I have.\n\nv1 (Marvel) v2 (Marvel) v3 (Image) v4 (Devil&amp;#039;s Due) plus appearances and mini series.\n\nFrom Wikipedia, the free encyclopedia\nThe Micronauts are a group of fictional group of characters that appear in comic books published by Marvel Comics. The Micronauts first appear in Micronauts #1 (Jan. 1979) and were created by Bill Mantlo and Michael Golden. The group are based on a toy line of the same name.\n\nThe Micronauts originate in the Microverse, a microscopic series of diverse habitats that are linked together in the fashion of molecule chains. The original team is formed in response to the threat posed by former academic and now murderous dictator, Baron Karza. Commander Arcturus Rann - in suspended animation for 1,000 years - and his co-pilot the robot Biotron return from their voyage on the HMS (Homeworld Micro Ship) Endeavor to discover Karza has slain the royal family, who are in fact Rann&amp;#039;s parents. What follows is an epic war across the Microverse between Rann and his allies against Karza.\n\nIn addition to Biotron, Rann&amp;#039;s team of &quot;Micronauts&quot; includes Princess Mari of Homeworld, who with her brother, Prince Argon, are the only survivors of the slaughtered figurehead royal family. Known to the team as Marionette, she falls in love with Rann and leads the team on occasion. The warriors Acroyear and Bug also join Rann&amp;#039;s cause, and although completely different - one a noble warrior prince and the other a joking insectoid - the two become best friends and staunch allies of all Micronauts. The last member of the original team is Microtron, Mari&amp;#039;s robot tutor. Although small, Microtron is very resourceful and very supportive of all team members.\n\nAfter a series of bloody and brutal battles against Karza and his genetically engineered armies of soldiers, the Micronauts triumph and Karza is apparently killed. Rann is able to claim victory with the possession of the Enigma Force - a semi-sentient power source that bonded with him during his period of suspended animation - which enables him to perform incredible feats. [5] The team then encounters the superhero team the Fantastic Four, who have traveled to a different region of the Microverse to battle the villain Psycho-Man. Unfortunately, Bug&amp;#039;s great love, Jasmine, is killed during the climax of the battle. It is shortly after this encounter that the Micronauts become trapped on Earth, but still at a greatly reduced size. [6]\n\nAfter encounters with the villains Plantman and Molecule Man, [7] the team battle the Fixer and Mentallo, who have allied themselves with the organization HYDRA. Joined by one of Acroyear&amp;#039;s people - Dagon - the team discovers that the villains and HYDRA are secretly under the control of Baron Karza, who courtesy of Prince Argon&amp;#039;s body is able to resurrect himself. Although the organization S.H.I.E.L.D. and several representatives of the races of the Microverse help the Micronauts finally defeat Karza, the battle is costly. Biotron is murdered by Dagon - an agent of Karza; Bug&amp;#039;s Queen dies in battle; Rann is rendered comatose and Acroyear&amp;#039;s traitorous brother Shaitan dies summoning the Worldmind - the parallel power to the Enigma Force that sustains their own homeworld. In desperation Acroyear bonds with the Worldmind to defeat Karza but in doing so destroys his world. [8]\n\nThe remnants of the team have an encounter with the villain Nightmare whilst trying to awaken Rann, and accidentally discover that the Microverse is unraveling. A warning left in Rann&amp;#039;s mind reveals that three keys will restore balance to the Microverse. The team embarks on a new quest across three new regions of the Microverse, being Oceania, Polaria, and the Dead Zone. The Micronauts are eventually successful and also acquire several team mates, including the bestial Devil and his companion Fireflyte and the robot Nanotron. [9]\n\nA new problem arises when Prince Argon begins displaying paranoia regarding the Micronauts and eventually sends a special Death Squad to kill them. [10] The Micronauts defeat the unit, and then have an encounter with the mutant Nightcrawler and battle a new foe called Huntarr. Huntarr is genetically engineered by Argon to destroy the Micronauts, but is made to see by Marionette that Argon is simply using him. [11] A war against Argon and his forces follows, with several beings from various locations in the Microverse - Pharoid, Slug, Margrace and Solitaire - joining the team in a bid to stop Argon. After several more encounters with beings such as Doctor Doom; the heroine Wasp and villain Arcade, [12] Microtron and Nanotron sacrifice themselves to reanimate Biotron&amp;#039;s consciousness in the Micronauts&amp;#039; new vessel. Argon is finally revealed to be controlled by the spirit of Baron Karza, who returns once more. After killing Argon, Karza deals the Micronauts a crushing defeat by killing Devil, Pharoid, Slug and Margrave. [13] After regrouping and a series of skirmishes, the remaining Micronauts confront and defeat Karza once and for all. [14]\n\nThe first series of the Micronauts ran from January 1979 to May 1984 and included 59 issues and two Annuals. The series was written by Bill Mantlo and featured art by Michael Golden, Gil Kane, Pat Broderick, Butch Guice and others. As of #38, the series was no longer available from newsstands and was sold via direct distribution only.\n\nIn 1984, a four part mini-series featuring the Micronauts and the X-Men was published, written by Chris Claremont and drawn by Butch Guice.\n\nThe second volume of Micronauts, subtitled &quot;The New Voyages,&quot; was published from 1984 to 1986 and was numbered from #1 - 20. The series was written by Peter Gillis and featured early-career artwork by Kelley Jones. After this series the Marvel-owned licence lapsed.\n\nFrom the late 1990s the characters of Marionette, Arcturus Rann and Bug (all Marvel properties) have appeared in various Marvel titles (without referencing the Micronauts label).\n\nIn 2002, a new series by Image Comics was published that ran for 10 issues before its cancellation in 2003. This was followed the same year by the three-issue Micronauts:The Time Traveler Trilogy by Byron Preiss Visual Publications and written by Steve Lyons.\n\nIn 2004, a new series was launched by Devil&amp;#039;s Due Publishing, mixing new characters with those based on the toyline. The series ran for 10 issues and featured art by Pat Broderick. [1] The same year this was followed by a three-issue limited series featuring Baron Karza&amp;#039;s origin and his relationship with the Time Traveler entity. [2]\n\nThe character of Bug has appeared in a solo one-shot [3] and together with cosmic hero Star-Lord, [4] and will be part of a new incarnation of the Guardians of the Galaxy.\n\nThanks to the scanners and the original sources.\n\nPlease seed. Please enjoy.\n\n\n\n\n\n","torrent":{"xt":"urn:btih:11292f5a8606fd1b428439e79600d0bb72b5541a","amp;dn":"Micronauts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11292f5a8606fd1b428439e79600d0bb72b5541a","infoHashBuffer":{"type":"Buffer","data":[17,41,47,90,134,6,253,27,66,132,57,231,150,0,208,187,114,181,84,26]},"announce":[],"urlList":[]}}