{"title":"Akel Ismail Kahera, &quot;Deconstructing the American Mosque&amp;quo","uid":10100292,"size":11043198,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:113ee18b20d57b1a88df1cd0616eb49196c031d5&amp;dn=Akel+Ismail+Kahera%2C+%26quot%3BDeconstructing+the+American+Mosque%26quo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":-1,"time":1399385755,"description":"\n\n Akel Ismail Kahera, &quot;Deconstructing the American Mosque: Space, Gender, and Aesthetics&quot; \n 2002 | pages: 209 | ISBN: 0292743440 | PDF | 10,5 mb\n\n From the avant-garde design of the Islamic Cultural Center in New York City to the simplicity of the Dar al-Islam Mosque in Abiquiu, New Mexico, the American mosque takes many forms of visual and architectural expression. The absence of a single, authoritative model and the plurality of design nuances reflect the heterogeneity of the American Muslim community itself, which embodies a whole spectrum of ethnic origins, traditions, and religious practices. In this book, Akel Ismail Kahera explores the history and theory of Muslim religious aesthetics in the United States since 1950. Using a notion of deconstruction based on the concepts of &quot;jamal&quot; (beauty), &quot;subject,&quot; and &quot;object&quot; found in the writings of Ibn Arabi (d. 1240), he interprets the forms and meanings of several American mosques from across the country.His analysis contributes to three debates within the formulation of a Muslim aesthetics in North America - first, over the meaning, purpose, and function of visual religious expression; second, over the spatial and visual affinities between American and non-American mosques, including the Prophet's mosque at Madinah, Arabia; and third, over the relevance of culture, place, and identity to the making of contemporary religious expression in North America.\n","torrent":{"xt":"urn:btih:113ee18b20d57b1a88df1cd0616eb49196c031d5","amp;dn":"Akel+Ismail+Kahera%2C+%26quot%3BDeconstructing+the+American+Mosque%26quo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"113ee18b20d57b1a88df1cd0616eb49196c031d5","infoHashBuffer":{"type":"Buffer","data":[17,62,225,139,32,213,123,26,136,223,28,208,97,110,180,145,150,192,49,213]},"announce":[],"urlList":[]}}