{"title":"Hannich-Marionettenstaat(society as puppets)(2005)","uid":4746561,"size":1178401,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:118ffe7e7696d402a188989a6c1edb7bce94cc29&amp;dn=Hannich-Marionettenstaat%28society+as+puppets%29%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"red_gonzo","files":1,"time":1235917164,"description":"For english-only speaking:\nThis book is in german language. English title would be: The puppet state - That's how you see through the methods of puppet masters (2005). GÃƒÂ¼nter Hannich attempts to describe our society as puppets controlled by invisible puppet masters working behind the scenes. The buildup of big brother state and corresponding shrinkage of our freedoms is just one of their methods to gain control over our minds. There are today so many laws and restrictions placed upon humans that noone can fully be aware of them anymore enabling the state to criminalize us at any given moment. Millions live in fear every day. Another powerful weapon against the uprisings are artificially created polarizations of society. Employers vs. employees, young vs. old, employed vs. jobless, men vs. women all create endless wars that keep up in chains. This books will enable you to see the puppetmasters through as you'll learn of many of their tricks to keep you enslaved while they laugh behind your back. 145 pages.\n\nFur Deutschsprachige:\nDie Probleme unserer Zeit werden immer grÃƒÂ¶ÃƒÅ¸er, die Politiker zugleich zunehmend unfÃƒÂ¤higer, diese MiÃƒÅ¸stÃƒÂ¤nde zu beseitigen - es liegt am System. Kaum jemand weiÃƒÅ¸, daÃƒÅ¸ es Drahtzieher im Hintergrund gibt, die jeden von uns wie eine Marionette kontrollieren wollen. Der Aufbau eines ÃƒÅ“berwachungsstaates und die besorgniserregende EinschrÃƒÂ¤nkung der Freiheit durch immer schÃƒÂ¤rfere Gesetze sind nur ein Teil der Methoden, die Gesellschaft durch Angst zu beherrschen. Es werden so viele Vorschriften erlassen, daÃƒÅ¸ niemand mehr in der Lage ist sie alle zu kennen und einzuhalten; damit kann jeder zu jeder Zeit kriminalisiert werden - ein perfektes Druckmittel. Und die mittels immer ausgefeilterer Technik mÃƒÂ¶gliche lÃƒÂ¼ckenlose ÃƒÅ“berwachung tut ein ÃƒÂ¼briges. Unbehagen und Angst zu schÃƒÂ¼ren. Eine weitere Vorgehensweise der mÃƒÂ¤chtigen Intriganten ist die Spaltung der Gesellschaft. Die GegensÃƒÂ¤tze Ã‚Â»Unternehmer kontra ArbeitnehmerÃ‚Â«. Ã‚Â»Jung gegen AltÃ‚Â«. Ã‚Â»Arbeitende gegen ArbeitsloseÃ‚Â« wurden kÃƒÂ¼nstlich geschaffen, um die Gesellschaft zu zersetzen. Jede so geschaffene Gruppierung steht fÃƒÂ¼r sich alleine da. Abneigung. Neid und HaÃƒÅ¸ regieren. Nur wer die Methoden der Drahtzieher kennt und sie durchschaut, erkennt auch, wohin die dramatische Entwicklung geht und kann seine persÃƒÂ¶nlichen SchutzmaÃƒÅ¸nahmen ergreifen. 145 Seiten.\n","torrent":{"xt":"urn:btih:118ffe7e7696d402a188989a6c1edb7bce94cc29","amp;dn":"Hannich-Marionettenstaat%28society+as+puppets%29%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"118ffe7e7696d402a188989a6c1edb7bce94cc29","infoHashBuffer":{"type":"Buffer","data":[17,143,254,126,118,150,212,2,161,136,152,154,108,30,219,123,206,148,204,41]},"announce":[],"urlList":[]}}