{"title":"The Third Jihad (2008)","uid":8661317,"size":732080072,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:12282f95fe10725ec30e9541eaac26779bcf49a0&amp;dn=The+Third+Jihad+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MarcusVE","files":2,"time":1373321005,"description":"Told through the eyes of an American Muslim physician (and former officer in the Navy Medical Corps), this production does a VERY good job of laying-out the threat posed to the West by Islamic fundamentalists (Islamofascists, jihadists, Muslim radicals...call them what you will). The various chapters explore everything from the fund-raising support to terrorists (that largely emanates from Saudi Arabia, the Persian Gulf states, and other recipients of petrodollars), to the threat of surging numbers of totally unassimilated Muslims in Western Europe, to the threat of Al-Qaeda getting their bloody hands on a nuclear device, or developing their own radiological &quot;dirty bomb&quot; or biological or chemical weapons.\n\nIn my opinion, this film does NOT slander Muslims in general, nor does it over-state the threat. Since it's been 8 years since 9/11 with no successful further attack on US soil, I fear many North Americans have succumbed to the wishful-thinking indulgence of assuming that 9/11 was a one-off fluke that can never be repeated.\n\nThis film respectfully suggests that such thinking is dangerously deluded.","torrent":{"xt":"urn:btih:12282f95fe10725ec30e9541eaac26779bcf49a0","amp;dn":"The+Third+Jihad+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12282f95fe10725ec30e9541eaac26779bcf49a0","infoHashBuffer":{"type":"Buffer","data":[18,40,47,149,254,16,114,94,195,14,149,65,234,172,38,119,155,207,73,160]},"announce":[],"urlList":[]}}