{"title":"Alaska.The Last Frontier.Season 3.720p.x264","uid":11588419,"size":24062772354,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:1438f3126cc7d111f978bca4ed3d1ff33b8adcbb&amp;dn=Alaska.The+Last+Frontier.Season+3.720p.x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":17,"time":1417199843,"description":"Alaska: The Last Frontier, Season 3, 720p, x264, English\n\nS03E01 Cabin Fever\n  After 8 months of winter, the Kilchers have cabin fever. Eivin and Atz Lee\n  get caught overnight in the backcountry hunting an Alaskan delicacy. Otto\n  uses ingenuity to get an orphan calf to connect with an unwilling mother.\n  And there's much to do with poo.\n\nS03E02 Father-Son Ingenuity\n  Family projects: Before the spring thaw floods the area, Atz Sr. and his 3\n  sons build a bridge across a river using chainsaws and fallen logs. Otto and\n  Eivin create two amphibious crafts from their ATVs. Meanwhile, Atz Lee and\n  Jane build a new smokehouse.\n\nS03E03 Spring Has Sprung\n  Spring has sprung on the homestead. Atz and family head out on a black bear\n  hunt, but as Jane's confidence gets stronger, Atz Sr's waivers. Otto gives\n  CPR to two prematurely born calves. Eve plants the family garden while Eivin\n  takes on an arch nemesis.\n\nS03E04 Spring Delicacy\n  Atz Lee and Jane climb reefs to hunt for octopus. Jane must face her fear of\n  heights or be trapped by the tide. Otto struggles to keep a newborn calf\n  alive during the annual spring cattle drive. Eve gives Eivin news that will\n  change the homestead forever.\n\nS03E05 Parlors and Poop Chutes\n  Eivin and pregnant Eve decide to finally add running water to their home, but\n  Eivin hits more than water during the installation. Otto builds Charlotte a\n  milking parlor but takes a faceful of fuel in the process. Atz and Atz Lee\n  head out to hunt bear.\n\nS03E06 Outhouses, Cow Bras and Bears, Oh My\n  Midsummer: the Kilchers scramble to make the most of 22 hrs of sunlight. Atz\n  tracks down predators killing the herd. Otto gets creative to help a cow with\n  an udder problem. Eivin builds an outhouse. Atz Lee and Jane are startled\n  while fishing for salmon.\n\nS03E07 Hunt in the Clouds\n  Losing ten minutes of sunlight daily, the Kilchers continue winter prep. Atz\n  and children hunt wild goat while Otto protects a failing hay supply. Eivin\n  fends off a wasp invasion that endangers his honey bees.\n\nS03E08 Thanksgiving\n  Thanksgiving on the homestead. The Kilchers come together to enjoy the fruits\n  of their year-long labor and share each dish's story. From turkey and pumpkin\n  pie to Yule's famous nettlebread and Homesteader pie, nothing comes easy when\n  making this feast.\n\nS03E09 A Prickly Situation\n  A persistent porcupine nails several of the Kilchers' too-curious animals\n  with quills. Taking them out is a painful and sometimes dangerous procedure.\n  Atz and his family carefully jack up and move an old abandoned cabin. Eve\n  finds her garden decimated.\n\nS03E10 Of Moose and Men\n  Atz and Atz Lee swim their horses across a chilly lake to get to bull moose\n  hunting grounds. Bad weather and feeling under the weather won't deter them\n  from the prize. Eivin hunts clams while Eve collects wild mushrooms. Otto and\n  Charlotte bury a friend.\n\nS03E11 Homestead for the Holidays\n  Homestead holidays bring gifts of kindness: Otto decides to give his &quot;Wacky\n  Yak&quot; to a friend, but the gift rejects the idea of being given. Atz Lee\n  gathers lumps of coal--for the nice--as his gift. Atz deals with cows on ice\n  to bring a friend's herd home.\n\nS03E12 Predators and Prey\n  Grizzly bears, wolves, and coyotes remind the Kilchers that the humans aren't\n  always the apex predator on the homestead, but threats to the Kilcher's food\n  supplies and livelihood also come in many other shapes and sizes and from\n  unexpected places.\n\nS03E13 Marital Maintenance\n  With winter on their doorstep, the Kilchers race to finish their summer\n  projects. Otto's enormous new project strains his marital bliss. Atz's horse\n  strands him on the range. Eivin works some chicken magic. Atz Lee teaches\n  Jane to fell a tree.\n\nS03E14 Call of the Wild\n  Otto and Eivin use a duck hunt for some last minute father-son time before\n  Eivin becomes a dad himself. Atz and Atz Lee's father-son bonding time is\n  less fun; they're repairing the new bridge. Jane has her own adventure:\n  fishing--and shooting--halibut.\n\nS03E15 Circle of Life\n  In an effort to fill an empty freezer, Eivin and Atz Lee head to a remote\n  island to hunt for deer. Meanwhile, Charlotte must deal with the reality of\n  farm life and care for a dying cow.\n\nS03E16 Baby Kilcher Arrives\n  Fall is over. The Kilchers take care of last minute projects before the\n  winter freeze--and the baby-- arrive. Jane faces wicked weather and quicksand\n  while on her very first cattle drive with Otto. Eivin and Eve introduce the\n  newest Kilcher to the world.\n\nS03E17 Extreme Seasons\n  The Kilchers adapt to the seasons; rescuing calves; swarms of mosquitoes;\n  Otto tries to live down his fisherman's curse","torrent":{"xt":"urn:btih:1438f3126cc7d111f978bca4ed3d1ff33b8adcbb","amp;dn":"Alaska.The+Last+Frontier.Season+3.720p.x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1438f3126cc7d111f978bca4ed3d1ff33b8adcbb","infoHashBuffer":{"type":"Buffer","data":[20,56,243,18,108,199,209,17,249,120,188,164,237,61,31,243,59,138,220,187]},"announce":[],"urlList":[]}}