{"title":"The Chemical Components of Tobacco and Tobacco Smoke","uid":15565629,"size":55497211,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14bed315a7fec25c31f19033c50281f6fc359343&amp;dn=The+Chemical+Components+of+Tobacco+and+Tobacco+Smoke&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1471195180,"description":"The Chemical Components of Tobacco and Tobacco Smoke - Alan Rodgman, Thomas A. Perfetti (CRC, 2009).pdf\r\n\r\nThe Chemical Components of Tobacco and Tobacco Smoke chronicles the extraordinary progress made by scientists in the field of tobacco science, from its beginnings in the early 1800s to the present. This comprehensive text provides over 6000 references on more than 8400 components identified in tobacco and tobacco smoke.\r\n\r\nAuthored by two longtime researchers in tobacco science, the book examines the isolation and characterization of each component. It explores developments in pertinent analytical technology and results of experimental studies on biological activity, toxicity, and tumorigenicity, including the inhibition of adverse biological activity of specific tobacco smoke component by another tobacco smoke component. The authors discuss the controversies over the extrapolation of the biological effect of a specific component administered individually by one route versus its biological effect when the component is in a highly complex mixture and is administered by a different route. They also cite studies in which cigarette design technologies were developed to control the per cigarette mainstream smoke yield of Federal Trade Commission-defined tar and one or more specific tobacco smoke components of concern.\r\n\r\nThrough numerous references, this dynamic resource elucidates both the historical background of and recent studies in tobacco and tobacco smoke research. It furthers the knowledge base of components, arming scientists and public health officials worldwide with the most current information available.\r\nAuthors Alan Rodgman and Thomas A. Perfetti have been jointly awarded the 2010 CORESTA (Cooperative Centre for Scientific Research Relative to Tobacco) Prize for their extensive work on documenting the vast literature on the chemical composition of tobacco and tobacco smoke","torrent":{"xt":"urn:btih:14bed315a7fec25c31f19033c50281f6fc359343","amp;dn":"The+Chemical+Components+of+Tobacco+and+Tobacco+Smoke","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14bed315a7fec25c31f19033c50281f6fc359343","infoHashBuffer":{"type":"Buffer","data":[20,190,211,21,167,254,194,92,49,241,144,51,197,2,129,246,252,53,147,67]},"announce":[],"urlList":[]}}