{"title":"YOOTheme - Vida Jan 2014 template (J2.5, J3.x)","uid":9456708,"size":34777598,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:15014d6580dd33ffa844c959cc871e0b8a73dbbc&amp;dn=YOOTheme+-+Vida+Jan+2014+template+%28J2.5%2C+J3.x%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1389285484,"description":"It's January and that means that it is time for a clean start. So check out Vida, our first club theme of the new year. Its clear structure as well as its fresh and colorful design make it perfect for your e-commerce, magazine or blog website. Although it is so versatile that will suit any kind of web project.\n\nVida comes with a cool tiled layout, which is rich in contrast and can be split into light and dark sections. This allows you to create exciting designs with an overall flat and clean approach. You will find nice, subtle spots of color in various aspects of the theme, like the boxed panels, badges and particularly the spectral color scheme of the main menu that is different for each style. Take a look at the beautiful, tidy blog layout with the date and tags placed outside of the content to draw special attention. This theme also provides a bonus style for the Widgetkit Slideshow that perfectly fits its overall style.\n\nVida is based on Warp 7 and provides full support for LESS. The front-end is completely built with UIkit and can be modified through the Customizer. You can change colors, spacings and fonts without having to write a single line of code. To get you started, Vida already provides 8 different style variations with backgrounds to choose from for your project.","torrent":{"xt":"urn:btih:15014d6580dd33ffa844c959cc871e0b8a73dbbc","amp;dn":"YOOTheme+-+Vida+Jan+2014+template+%28J2.5%2C+J3.x%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15014d6580dd33ffa844c959cc871e0b8a73dbbc","infoHashBuffer":{"type":"Buffer","data":[21,1,77,101,128,221,51,255,168,68,201,89,204,135,30,11,138,115,219,188]},"announce":[],"urlList":[]}}