{"title":"Deadfall.Adventures.XBOX360-COMPLEX","uid":9163069,"size":7838699120,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:16cc43670b726f99e510964d607e643672807dab&amp;dn=Deadfall.Adventures.XBOX360-COMPLEX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Mr.Stifmeister","files":3,"time":1383908316,"description":"\n                           - C O M P L E X -\n\n\n                           P R E S E N T S   :\n\n               Deadfall Adventures  (c) Nordic Games\n\n\n       Region      : RF                    Languages: English\n       Size        : 1 DVD                 Genre    : FPS\n       Platform    : XBOX 360              Date     : Nov 2013\n\n\nRelease Info:\n~~~~~~~~~~~~~\n\n1938. James Lee Quatermain is a man of many talents, yet holding on to\nmoney isnt one of them. James is an adventurer by trade, just like his\nlegendary great-grandfather Allan Quatermain. And he knows how to squeeze\nmoney out of this famous name of his, while at the same time despising it.\nDespising those who believe his great-grandfathers tales of the supernatural\nand those who make fun of them alike. Accordingly, Quatermain isnt all too\nkeen on escorting Jennifer Goodwin, an US agent and former colleague of his,\nto an Egyptian temple structure in order to retrieve an ancient artifact -\nThe Heart of Atlantis. Neither does he believe in the reputed invigorating\nqualities of this artifact, nor does he care the least that a division of\nthe Ahnenerbe, the Nazi department specialized in the occult, is after The\nHeart as well. But life has its ways of changing ones perspective.\nQuatermain soon finds himself part of a hunt across the globe - from the\nstormy deserts of Egypt to the icy depths of the Arctic, and all the way\nto the steaming jungles of Guatemala. In long forgotten temple structures\nthe thrill of the chase awakens the true adventurer in Quatermain, as he\nand agent Goodwin strive to be one step ahead of the Nazis and the Russians,\none step closer to obtaining the Heart of Atlantis. And deep in these\ntemples, where age-old guardians awake from their eternal slumber, James\nsoon learns that his great-grandfathers stories are not as crazy as he\nhad always believed. For all things live forever, though at times they\nsleep and are forgotten.\n\n\nNotes:\n~~~~~~~\n\nEnjoy!\n\n\n                        Enjoy This Fine COMPLEX Release!\n\n                                                                        bmx!\n","torrent":{"xt":"urn:btih:16cc43670b726f99e510964d607e643672807dab","amp;dn":"Deadfall.Adventures.XBOX360-COMPLEX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16cc43670b726f99e510964d607e643672807dab","infoHashBuffer":{"type":"Buffer","data":[22,204,67,103,11,114,111,153,229,16,150,77,96,126,100,54,114,128,125,171]},"announce":[],"urlList":[]}}