{"title":"L'ispettore Coliandro S01E01 Il giorno del lupo [CR-Bt]","uid":4754236,"size":583543460,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:17340e56ce400eab57b48e0a657a77944ad2bfdb&amp;dn=L%5C%27ispettore+Coliandro+S01E01+Il+giorno+del+lupo+%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CR-Bt","files":1,"time":1236365570,"description":"L'Ispettore Coliandro ÃƒÂ¨ una serie televisiva diretta dai Manetti Bros. Creatore della serie ÃƒÂ¨ il famoso giallista Carlo Lucarelli: l'Ispettore Coliandro ÃƒÂ¨ nato dalla penna dello scrittore bolognese, ed ÃƒÂ¨ il protagonista di numerosi suoi gialli.\n\nIl giorno del lupo \nMessa in onda: 24 agosto 2006 (Rai Due)\nColiandro, un giovane poliziotto messo in punizione allo spaccio della Questura di Bologna, incontra per caso, nell'ufficio del suo amico e collega Trombetti, una ragazza, Nikita, che lo sta cercando per fargli vedere qualcosa che la inquieta. Si tratta di una grossa busta che Nikita (che fa la pony express) deve consegnare e che si ÃƒÂ¨ aperta, dopo aver subito un incidente in motorino, mostrando il contenuto: un floppy disk e 250.000 euro in contanti. Coliandro pensa sia una buona occasione per riscattarsi, tornare alla Mobile e venir via dallo spaccio. CosÃƒÂ¬ si infila in un traffico di cocaina che prospera grazie alla pericolosa protezione di ambienti mafiosi.\nSceneggiatura: Carlo Lucarelli, Giampiero Rigosi e Umberto Contarello.\nRegia: Manetti Bros (Marco e Antonio Manetti).\nGuest star femminile: Nicole Grimaudo (Nikita).\nAltri interpreti: Cesare Bocci (giudice Malerba), Raffaele Vannoli, Giuseppe Gandini (Psycho), Costantino Carrozza, Maurizio Comito, G.Max (Henchman). Con l'amichevole partecipazione di Nino Marazzita (nel ruolo di se stesso) e Neffa.\n","torrent":{"xt":"urn:btih:17340e56ce400eab57b48e0a657a77944ad2bfdb","amp;dn":"L%5C%27ispettore+Coliandro+S01E01+Il+giorno+del+lupo+%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17340e56ce400eab57b48e0a657a77944ad2bfdb","infoHashBuffer":{"type":"Buffer","data":[23,52,14,86,206,64,14,171,87,180,142,10,101,122,119,148,74,210,191,219]},"announce":[],"urlList":[]}}