{"title":"Coughlin-Money-Questions&amp;Answers(1971)","uid":4647742,"size":806271,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:175ec348228caaad26a44da2557b4f22eb28efc7&amp;dn=Coughlin-Money-Questions%26Answers%281971%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"red_gonzo","files":1,"time":1231943485,"description":"This is Charles E. Coughlin's amazing book Money!: Questions and Answers (1971) which is a compilation of hundreds of questions and answers about the true nature of wealth, money, central banking, debts, prices, taxation and much more. Rev. Coughlin, a Catholic Priest, wrote for the ordinary American citizen. He kept in mind the vast resources and virgin wealth of the United States of America where want needlessly reigns in the midst of plenty simply because there is a planned scarcity of money required for the transfer of wealth. Money is the most vital and fundamental problem to be solved before social justice can be reestablished. Needless to say, it is not convenient for the public press either to explain or to uphold many of the teachings herein contained. Consequently, Coughlin wrote as a service to the misinformed and uninformed public. The whole book consists in question/answer form about the always abused money system in hands of few men. Where does today's money really come from? Why do we need taxation at all? Why is private property necessary? What is a honest money system and who regulates it? What are the effects of a dishonest money system on the population? What is fiat money, inflation and deflation? All this and much more in a fascinating economic treatise intended for everyday individual from the street. 180 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:175ec348228caaad26a44da2557b4f22eb28efc7","amp;dn":"Coughlin-Money-Questions%26Answers%281971%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"175ec348228caaad26a44da2557b4f22eb28efc7","infoHashBuffer":{"type":"Buffer","data":[23,94,195,72,34,140,170,173,38,164,77,162,85,123,79,34,235,40,239,199]},"announce":[],"urlList":[]}}