{"title":"Swamp Thing Vol. 1 [Complete] and Vol. 2 [1-77] (Digital) (G85-E","uid":10042431,"size":2276210268,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1788ff990419e701abdea6a7336869e1cff19c6f&amp;dn=Swamp+Thing+Vol.+1+%5BComplete%5D+and+Vol.+2+%5B1-77%5D+%28Digital%29+%28G85-E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"hellblazer02","files":-1,"time":1398478489,"description":"The Swamp Thing character was created by Len Wein and Bernie Wrightson in the House of Secrets horror anthology for DC Comics back in the 70's. Therefore, &quot;Swamp Thing&quot; first appeared in House of Secrets #92 (July 1971) but that character is not the same as the one who became an established character in comics. The original Swamp Thing was Alex Olsen, but when Swamp Thing was deemed a hit the character was updated by his creators and became Alec Holland who first appeared in Swamp Thing #1 (November 1972).\n\nStarring in his first ongoing series, which lasted for four years and twenty-four issues, a lot of Swamp Thing's cast of characters were introduced including mainstays like Abigail Arcane, Anton Arcane and Matthew Cable. However, it was until the second series (originally entitled &quot;The Saga of the Swamp Thing&quot;) that Swamp Thing found the writer that would shape him in a run that is still one of the most acclaimed in comic history. With Swamp Thing #20, Alan Moore came onto the series and broke Swamp Thing down entirely and began to build him back from the ground up and make him a much more formidable being...transforming him from an almost-mute wandering lost soul to a plant elemental with the power to regenerate and travel the cosmos.\n\nAlan Moore stayed on the book until #64, and was followed by several other writers such as Rick Veitch, Doug Wheeler, Nancy A. Collins (during whose run the title became part of the Vertigo imprint with #129) and Mark Millar but none gained the success of Moore and the title ended at #171 in 1996. ","torrent":{"xt":"urn:btih:1788ff990419e701abdea6a7336869e1cff19c6f","amp;dn":"Swamp+Thing+Vol.+1+%5BComplete%5D+and+Vol.+2+%5B1-77%5D+%28Digital%29+%28G85-E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1788ff990419e701abdea6a7336869e1cff19c6f","infoHashBuffer":{"type":"Buffer","data":[23,136,255,153,4,25,231,1,171,222,166,167,51,104,105,225,207,241,156,111]},"announce":[],"urlList":[]}}