{"title":"Pimpadelic Discography (320k)","uid":8409668,"size":966258759,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:17be22be54230e5c895b35a8a2d84649830d1cdc&amp;dn=Pimpadelic+Discography+%28320k%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ForeColor","files":-1,"time":1366888399,"description":"Pimpadelic discography @ 320k!\n\nI had a hard time getting these, so I wanted to make it a bit easier for others.\nAlbums are listed below. I hope y'all enjoy!\n\n\nBarely Legal [1996]\nDo Unto Others [2004]\nDrink! Drugs! Sex! [2011]\nHomegrown [1995]\nReb De Ville [2003]\nRebelution - Two Thousand Six Sixx Sixxx [2006]\nShe's Dead [2008]\nSouthern Devils 2000 [1999]\nStatutory Rap [1998]\n\n\n\nA bit of band bio:\n\n\nPimpadelic has been making music now for years and show no signs of letting up. Making Ft Worth, TX their home and feeling comfortable in their own tattooed and scarred skin, these hellions make no excuses for themselves. Pimpadelic, in the beginning, were a straight up Glam band. Moving with the times, their sound slowly transformed into a rap/rock feel. Being so versatile is what helps this band stay on top of their game. Now, with a fresh new line-up, they are going back to their roots of good old fashion rock. These boys will let you know real quick they mean business when it comes to music. The music has a wide variety of genres and they refused to be labeled to one particular one. They are definitely known for playing music that appeals to the masses, as shown in every live show performed. Lead singer/Lead Guitarist Easy Jesus Coe came up in the small trashy suburb of Ft. Worth called Blue Mound. Tried and true, this boy has shown nothing but loyalty to the place where he first started jammin and writing music. Being the proud, illegitimate nephew of outlaw country singer David Allan Coe, Easy plays honk-tonk country on his days off in dives all across Texas. Not to mention being a real white trash rapper; there's nothin' this dirtbag can't do musically. . ","torrent":{"xt":"urn:btih:17be22be54230e5c895b35a8a2d84649830d1cdc","amp;dn":"Pimpadelic+Discography+%28320k%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17be22be54230e5c895b35a8a2d84649830d1cdc","infoHashBuffer":{"type":"Buffer","data":[23,190,34,190,84,35,14,92,137,91,53,168,162,216,70,73,131,13,28,220]},"announce":[],"urlList":[]}}