{"title":"K1 Fight MMA Japan December 31 2005","uid":3427650,"size":1468665856,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:17f5b9d60c68eddbdca499d982bc5f0ef51d0568&amp;dn=K1+Fight+MMA+Japan+December+31+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"turtle","files":1,"time":1136334849,"description":"Audio is Japanese.\nThe video is 512x384, 1 hour and 57 min, and 1.36 GB\n\nThere are some big names this year (Royce Gracie, Genki Sudo, Bob Sapp, Akebono..)\nSome of the bouts include: (quotiing liberally from the K1 website)\n\nThe Main Event, the Hero's Middle Weight Championship Tournament Final, was a showdown between two dynamic Japanese fighters -- Genki Sudo and Norifumi &quot;Kid&quot; Yamamoto. Sudo is very good on the ground, while Yamamoto is an aggressive fighter with superior strikes. Pre-event, a cocky Yamamoto quipped that the bout &quot;will be a piece of cake, I can just relax and take it easy -- the win will naturally follow.&quot;\n\nBoth these boys had won their previous three fights to get to the final, and so the atmosphere was electric as they made their ring entrances. Speaking of ring entrances, Sudo's was, as always, spectacular -- a dazzling postmodern pastiche of cyborgs, geisha and electrobeat. One wonders who Sudo spends more time with -- his trainer or his choreographer.\n\n\nBack to Hero's Rules, and a David versus Goliath matchup. American former Sumo Grand Champion Akebono brought a whopping 130kg/280lbs weight advantage to his fight with Bobby Ologun of Nigeria. Ologun is a popular television personality in Japan, and a sometime-fighter who shocked the Osaka Dome crowd a year ago with a mixed martial arts win over French fighter Cyril Abidi.\n\nJapan's best K-1 fighter, Musashi, took on powerhouse Bob &quot;The Beast&quot; Sapp of the Unites States in the next K-1 Rules fight. Before this one, Sapp joked, &quot;There is no question Musashi has conditioning and technical ability, the only question is -- will we still be friends after I knock his ass out?&quot; Musashi responded with a laugh, &quot;Yes, Bob, I do hope we can continue our friendship!&quot;\n\nA special format (10Min x 2R to KO/submission) bout which pitted the experience of Royce Gracie, a 39 year-old Brazilian Jiu-jitsu master bred of the sport's premier fighting family, against the intrepid 28 tear-old grappler Hideo Tokoro of Japan","torrent":{"xt":"urn:btih:17f5b9d60c68eddbdca499d982bc5f0ef51d0568","amp;dn":"K1+Fight+MMA+Japan+December+31+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17f5b9d60c68eddbdca499d982bc5f0ef51d0568","infoHashBuffer":{"type":"Buffer","data":[23,245,185,214,12,104,237,219,220,164,153,217,130,188,95,14,245,29,5,104]},"announce":[],"urlList":[]}}