{"title":"TSSeduction--TS-33787 Beau Warner and Jesssica Fox MP4","uid":8907326,"size":1417361884,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:1837268e508f1f3aa05886aa087f5d18ac78991e&amp;dn=TSSeduction--TS-33787+Beau+Warner+and+Jesssica+Fox+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"merzedes","files":-1,"time":1378939353,"description":"\nFootball Season Begins with a Locker Room Seduction &amp; Switch Fucking!\n\nSep 11, 2013 - Performers: Jesssica Fox  and  Beau Warner \n\n\nMP4 + Pics.\n \n\nJessica is working for a football recruit and her style of drafting involves more than just watching on field play. For a select few - who may or may never have professional football careers as that doesn't matter to Jessica - she convinces them to show her what they have under their pads and gets the guys turned on with her groping hand jobs and soft lips. \n\nBeau is easy pickings for Jessica and she has a special desire for his cock in her ass. She also wants to see his face when he opens his eyes while pounding her to discover he is not the only one with a hard cock. Jessica's proud cock slaps his belly while he pumps balls deep into her ass. At first, Beau refuses to touch her cock but after accepting that his own dick has stayed missile hard inside her ass, he figures he might as well see what another cock feels like - especially one attached to a soft, big titted babe. \n\nJessica seduces Beau blow job by blow job and slowly she convinces him to let her push her cock into his ass. She kisses him while thrusting into his ass, and Beau can no longer resist her. \nThis switch scene is so hot, Jessica cums twice - once while getting fucked by Beau and then while fucking him from behind. She even uses Beau cum load as lube for his ass. She spits the milked load right out of her mouth and all over his butt hole before plowing him for her second orgasm. \n\nScreens &lt;a href=&quot;\nhttp://www.tsseduction.com/site/shoot.jsp?shootId=33787&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tsseduction.com/site/shoot.jsp?shootId=33787&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:1837268e508f1f3aa05886aa087f5d18ac78991e","amp;dn":"TSSeduction--TS-33787+Beau+Warner+and+Jesssica+Fox+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1837268e508f1f3aa05886aa087f5d18ac78991e","infoHashBuffer":{"type":"Buffer","data":[24,55,38,142,80,143,31,58,160,88,134,170,8,127,93,24,172,120,153,30]},"announce":[],"urlList":[]}}