{"title":"The Arrangement 1 - H.M. Ward (mobi for Kindle)","uid":9940028,"size":97212,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:183819fb3baf8d38d85f4a407a4fc1b99b510ca5&amp;dn=The+Arrangement+1+-+H.M.+Ward+%28mobi+for+Kindle%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"W3Qy7HV","files":1,"time":1397225496,"description":"THE SERIES WITH OVER A MILLION COPIES SOLD\n~Volume 1 in the New York Times Bestselling Arrangement Serials~\nFML is becoming Avery's motto. Just when she doesn't think things could get any worse, they do. When her car stalls out at a busy intersection and she gets out to check under the hood, a guy steals her car. Armed with a dress and a pair of Chucks, Avery runs after the thief. When a hot stranger offers to help, she can't say no. That's how Avery meets Sean Ferro, the totally sexy, totally damaged guy with more secrets than she has time for.\n\nAvery doesn't have time for anything anymore. Her is life falling apart and it's not just the car. It's everything, and it doesn't matter how tightly she tries to hold on, there's nothing left to hold on to. With the sudden death of her parents, it's only a matter of months until Avery's shot at college is gone, and she's living in a cardboard box. Other students have their families to rely on when things get bad. Avery has no one.\n\nBut there's one option, one incredibly sexy, morally devoid, option. If Avery takes a job as a call girl, one guy could save her. One client. One time. She just has to say yes.\n\nGenre: New Adult Romance","torrent":{"xt":"urn:btih:183819fb3baf8d38d85f4a407a4fc1b99b510ca5","amp;dn":"The+Arrangement+1+-+H.M.+Ward+%28mobi+for+Kindle%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"183819fb3baf8d38d85f4a407a4fc1b99b510ca5","infoHashBuffer":{"type":"Buffer","data":[24,56,25,251,59,175,141,56,216,95,74,64,122,79,193,185,155,81,12,165]},"announce":[],"urlList":[]}}