{"title":"The Pirate Bay Android v1.6.5","uid":11157569,"size":2704006,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:1972a325c3e5cd0ad9134d77917becbdd54b60b8&amp;dn=The+Pirate+Bay+Android+v1.6.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"devhum","files":1,"time":1412463160,"description":"v1.6.5 [October 4, 2014]\n- You can now input a custom URL in the settings.\n- Fixed bug with no results loading due to the mobile version of the site.\n- Note that I don't support this app aymore (which is why I never got around to resolving the issues) so this may be the last update. I only did this update to maximize the life of the app so hopefully I do not need to make updates anymore.\n\n\nPlease view the What's New in the app for full change logs.\n\n------------------------------------------\n\nThis app was removed from the Play Store so I will be providing this application for free with no ads.\n\nScreenshots:        &lt;a href=&quot;\nhttp://imgur.com/a/8Fqov&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgur.com/a/8Fqov&lt;/a&gt;\n\n------------------------------------------\n\nSearch and browse torrents from The Pirate Bay with ease and download them using your favourite torrent application.\n\nMain Features:\n- Search torrents with any category and a default sort\n- Browse torrents in any category (including Top 100s)\n- View the most recent torrents\n- Favourite any of your search results or torrents for later use. (Backup + Restore capability)\n- Sort your search results\n- Download a torrent using your default torrent application (must handle magnet links)\n- Share or open browser for any search results and torrent links\n- Use custom URLs if The Pirate Bay is blocked or down.\n- Holo common look and feel from 2.2 and up\n\nThe application and I, the developer, are not affiliated with The Pirate Bay.\n\nThe application is optimized for large screens in landscape orientation for the search results and torrent info screens. Let me know if there are any issues with this since I don't actually have a tablet, only tested on emulators.\n\nThis application uses The Pirate Bay website. Please make sure that The Pirate Bay website is working if you encounter any issues. The application does not track any usage.\n\nPermissions:\n- INTERNET: Internet connection only for The Pirate Bay website\n- WRITE_EXTERNAL_STORAGE: For backing up and restoring your favourites\n\nEnjoy!","torrent":{"xt":"urn:btih:1972a325c3e5cd0ad9134d77917becbdd54b60b8","amp;dn":"The+Pirate+Bay+Android+v1.6.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1972a325c3e5cd0ad9134d77917becbdd54b60b8","infoHashBuffer":{"type":"Buffer","data":[25,114,163,37,195,229,205,10,217,19,77,119,145,123,236,189,213,75,96,184]},"announce":[],"urlList":[]}}