{"title":"Gambling (NEW 2015 MetArt Films) [Split Scenes] WEB-DL","uid":12484163,"size":1169217784,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1a05fb8b6b89a5a0897076fd5891e881d089f497&amp;dn=Gambling+%28NEW+2015+MetArt+Films%29+%5BSplit+Scenes%5D+WEB-DL&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"UniX","files":4,"time":1443090787,"description":"SCREENS;\r\n \nhttp://imgurx.net/share-B1A8_5603B5DA.html - COVER\r\n \nhttp://imgurx.net/share-15FC_5603B4D0.html\r\n \nhttp://imgurx.net/share-A420_5603B4D0.html\r\n \nhttp://imgurx.net/share-F5A7_5603B4D0.html\r\n \nhttp://imgurx.net/share-46BC_5603B4D0.html\r\n\r\n\r\n\r\nReleased: 2015\r\nCountry: USA\r\nDirector: Guy Ranieri Sblattero\r\nStudio: Viv Thomas, MetArt Films, Girlfriends Films\r\nGenre: Lesbian, All Girl, Romance\r\nStarring: Taylor Sands, Amber Nevada, Lady Dee, Bailey Ryder\r\nDuration: 1 hrs. 34 mins.\r\n\r\nDescription: Lucky at cards, but unlucky in love? Not if you play to win ... 'Gambling' shows you do not have to hold all the cards to have a good time! Amber Nevada is first to take on the role of croupier, winning Taylor Sands' chips. Taylor goes all in and loses her shorts, bra and panties. Is Amber cheating? We'll never know, but Taylor is happy with the suggestion they play another game, one that involves a lot more touching. Amber sucks Taylor's lightly-furred pussy, strumming her clit with tongue and fingers. After a powerful climax, Taylor laps at Amber's pussy, then gets eaten from behind, before some mutual masturbation. Lady Dee is next to try her luck at Amber's casino. Cardshark Amber keeps on winning; the game forgotten, Dee gets on her knees and Amber eats her from behind. Dee straddles Amber and rides her fingers, then turns into reverse cowgirl and frigs herself before Amber makes her cum explosively. Amber moves into doggy position, Dee spanking her ass cheeks and spreading them apart to lick her succulent pussy. Taylor has a blast as she assumes the position of croupier in scene three, winning all Bailey Ryder's chips, and then her clothes too. Bailey's mood lifts as Taylor pushes her down on the bed and licks her pussy. Bailey rocks her hips with pleasure as Taylor's probing tongue and fingers drive her wild. When she's on the verge of climaxing, Taylor straddles her face and rides until she's also at fever pitch, then moves Bailey into doggy position, fingering and eating her ravenously. Bailey takes her turn to lick Taylor's pussy again, driving her to a powerful orgasm, then grinding on her until they both climax. Dee has not learned her lesson. Having been trounced by Amber, she goes back for another round with Taylor. But when she wins a hand she chooses Taylor's clothes, rather than chips, as her reward. Taylor mounts Dee in a sixty-nine, breaking off from her voracious sucking to moan with delight as Dee licks her pink folds. They move into scissors, grinding their pussies together. Taylor goes face down, ass up to enjoy her orgasm, before they rub themselves to a noisy climax. Win or lose, these girls know how to have fun!\r\n\r\nQuality: WEBRip / SD\r\nFormat: AVI\r\nVideo: Xvid 852x480 29.97fps 1443kbps [Video 0]\r\nAudio: MPEG Audio Layer 3 44100Hz stereo 192kbps [Audio 1]","torrent":{"xt":"urn:btih:1a05fb8b6b89a5a0897076fd5891e881d089f497","amp;dn":"Gambling+%28NEW+2015+MetArt+Films%29+%5BSplit+Scenes%5D+WEB-DL","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a05fb8b6b89a5a0897076fd5891e881d089f497","infoHashBuffer":{"type":"Buffer","data":[26,5,251,139,107,137,165,160,137,112,118,253,88,145,232,129,208,137,244,151]},"announce":[],"urlList":[]}}