{"title":"The Anthony Cumia Show 2015-05-05 Kevin Corrigan MP4 MP3","uid":11888964,"size":310423407,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1e336335e2dab5420b4f20c89782ccfe9dd143fd&amp;dn=The+Anthony+Cumia+Show+2015-05-05+Kevin+Corrigan+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1430930594,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest: Kevin Corrigan\n\nEpisode 157 - While a semi-hungover Anthony waits for Kevin Corrigan, he talks about the death of David Goldberg in Mexico, Cinco de Mayo, the compound's new supercharged margarita maker, we watch some roommate sabotage, surveillance video of Guy Fieri's Lambo getting stolen, get acquainted with TACS new sponsor, see a real pisser of a video at a town hall meeting, and hear about a mom who will apparently fuck anything. Ant relocates poolside to chat with Kevin Corrigan about the recent Goodfellas event, the panel that fielded questions that evening, news coverage of the mob, The Godfather, and Kevin tells us about his new movie &quot;Results&quot;. The guys then sing the praises of Michael Rapaport, discuss approaching celebrities, social media changing the accessibility of contacting celebs, how the mob varies by city, they wax on the old days of buying tickets and getting to concerts, changes to the NY landscape, acting in LA vs. NY, city folks vs. suburban folks, they reminisce about the old days of finding gals to hook up with, Kevin explains how he got into acting, and someone sneaks in and makes a surprise splash.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:1e336335e2dab5420b4f20c89782ccfe9dd143fd","amp;dn":"The+Anthony+Cumia+Show+2015-05-05+Kevin+Corrigan+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e336335e2dab5420b4f20c89782ccfe9dd143fd","infoHashBuffer":{"type":"Buffer","data":[30,51,99,53,226,218,181,66,11,79,32,200,151,130,204,254,157,209,67,253]},"announce":[],"urlList":[]}}