{"title":"Manic Street Preachers - This Is My Truth Tell Me Yours - (1998)","uid":4545340,"size":471133647,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1f655d311554c91ac195e55c79d863eaf4e43ad5&amp;dn=Manic+Street+Preachers+-+This+Is+My+Truth+Tell+Me+Yours+-+%281998%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"seanprince","files":22,"time":1228105233,"description":"Manic Street Preachers - This Is My Truth Tell Me Yours - (1998)[FLAC-EAC-CUE]\n\nTrack list\n\nManic Street Preachers - This Is My Truth Tell Me Yours\n\n01. The Everlasting 06:09\n02. If You Tolerate This Your Children Will Be Next 04:50\n03. You Stole the Sun From My Heart 04:20\n04. Ready For Drowning 04:32\n05. Tsunami 03:51\n06. My Little Empire 04:09\n07. I'm Not Working 05:51\n08. You're Tender and You're Tired 04:37\n09. Born a Girl 04:12\n10. Be Natural 05:12\n11. Black Dog On My Shoulder 04:48\n12. Nobody Loved You 04:44\n13. S.Y.M.M. 05:57\n\nBiography by Stephen Thomas Erlewine\n\nDressed in glam clothing, wearing heavy eyeliner, and shouting political rhetoric, the Manic Street Preachers emerged from their hometown of Blackwood, Wales, in 1991 as self-styled &quot;Generation Terrorists.&quot; Fashioning themselves after the Clash and the Sex Pistols, the Manics were on a mission, intending to restore revolution to rock &amp; roll at a time when Britain was dominated by trancey shoegazers and faceless, trippy acid house. Their self-consciously dangerous image, leftist leanings, crunching hard rock, and outsider status made them favorites of the British music press and helped them build a rabidly dedicated following.\n\nFor much of the band's early career, it was impossible to separate the rhetoric from the music and even from the members themselves -- the group's image was forever associated with lyricist/guitarist Richey James carving the words &quot;4 Real&quot; into his arm during an early interview. As the British pop music climate shifted toward Britpop in the wake of Suede, the Manics didn't achieve fame, but they had notoriety. Legions of followers emerged, including many bands that formed the core of the short-lived &quot;new wave of new wave&quot; movement.\n\nBut as the group climbed toward stardom, the story didn't get simpler -- it got weirder. James' behavior became increasingly bizarre, culminating on the group's harrowing 1994 album The Holy Bible. Early in 1995, James disappeared, leaving no trace of his whereabouts. The remaining trio carried on with 1996's Everything Must Go, the album that established them as superstars in England, yet that came at the expense of the arrogant, renegade gender-bending and revolutionary rhetoric that earned them their initial fan base.\n\nIt was a bizarre, unpredictable journey for a band that once proclaimed that all bands should break up after releasing one album. James Dean Bradfield (vocals, guitar), Nicky Wire (born Nick Jones; bass), Sean Moore (drums), and Flicker (rhythm guitar) formed Betty Blue in 1986. Within two years' time, Flicker had left the band and the group had changed its name to the Manic Street Preachers. In the summer of 1988, a fellow student of Wire's at Swansea University, Richey James (born Richey Edwards), who had been the group's driver, joined the band as rhythm guitarist. They began recording demos, eventually releasing the single &quot;Suicide Alley&quot; in August. &quot;Suicide Alley&quot; boasted a cover replicating that of the Clash's first album, which indicated the sound of the group at the time -- equal parts punk and hard rock. A year after the single's release, the NME gave it an enthusiastic review, citing James' press release -- &quot;We are as far away from anything in the '80s as possible.&quot;\n\nIndeed, the Manics were one of the key bands of the early '90s, and their career didn't get rolling until 1991. The New Art Riot EP appeared in the summer of 1990, followed by a pair of defining singles -- &quot;Motown Junk&quot; and &quot;You Love Us&quot; -- in early 1991 on Heavenly Records. The singles and the Manics' incendiary live shows, where they wrote slogans on their shirts, created a strong buzz in the music press, which only escalated in May. James gave an interview with Steve Lamaq for the NME in which Lamaq questioned the group's authenticity; after an argument, James responded by carving the words &quot;4 Real&quot; on his arm. The incident became a sensation, attracting numerous magazine articles, as well as a major-label contract with Sony. Many observers interpreted the action as a simple stunt, but over the next few years it became clear that the self-mutilation was the first indication of James' mental instability.\n\n&quot;Stay Beautiful&quot; was the Manics' first release for Sony, and it climbed into the British Top 40 late in the summer of 1991, followed early in 1992 by a re-recorded &quot;You Love Us,&quot; which peaked in the Top 20. By the time they released their much-hyped debut album, Generation Terrorists, in February 1992 -- a record the band claimed would outsell Guns N' Roses' Appetite for Destruction -- they had already cultivated a large and devoted following, many of whom emulated their glammy appearance and read the same novels and philosophers the group name-dropped. The Manics had been claiming that they would disband following the release of their debut, yet it became clear by the fall, when a non-LP cover of &quot;Suicide Is Painless (Theme from M*A*S*H)&quot; became their first Top Ten hit, that they would continue performing. Nicky Wire and Richey James had become notorious for their banter throughout the British music press, and while it earned them countless articles, it also painted the group into a corner. Comparatively polished and mainstream compared to its predecessor, Gold Against the Soul, the group's second album, appeared in the summer of 1993 to mixed reviews.\n\nShortly after the release of Gold Against the Soul, the Manics' support began to slide as the group began to splinter amidst internal tensions, many of them stemming from James. Nicky Wire ran into trouble over on-stage remarks about R.E.M.'s Michael Stipe dying of AIDS, but Richey James was in genuine trouble. Suffering from deepening alcoholism and anorexia, James entered prolonged bouts of depression, highlighted by incidents of self-mutilation -- most notoriously at a concert in Thailand, when he appeared with his chest slashed open by knives a fan gave him. Early in 1994, he entered a private clinic, and the band had to perform a number of concerts as a trio. James' mental illness surfaced on the group's third album, The Holy Bible. Reportedly recorded in a red-light district in Wales, The Holy Bible was a bleak, disillusioned record that earned considerable critical acclaim upon its late-summer release in 1994.\n\nAlthough the Manics' critical reputation was restored and James was playing with the band, even giving numerous interviews with the press, all was not well. Prior to the American release of The Holy Bible and the band's ensuing tour, James checked out of his London hotel on February 1, 1995, drove to his Cardiff apartment, and disappeared, leaving behind his passport and credit cards. Within the week he was reported missing and his abandoned car was found on the Severen Bridge outside of Bristol, a spot notorious for suicides. By the summer, the police had presumed he was dead. Broken, but not beaten, the remaining Manics decided to carry on as a trio, working the remaining lyrics James left behind into songs.\n\nThe Manic Street Preachers returned in December 1995 opening for the Stone Roses. In May 1996, they released Everything Must Go, which was preceded by the number two single &quot;A Design for Life.&quot; Their most direct and mature record to date, Everything Must Go was greeted with enthusiastic reviews, and the Manics became major stars in England. Throughout 1996, the band toured constantly, and most U.K. music publications named Everything Must Go Album of the Year. Despite their growing success, several older fans expressed distress at the group's increasingly conservative image, yet that didn't prevent the album from going multi-platinum.\n\nEverything Must Go didn't just go multi-platinum -- it established the Manics as superstars throughout the world. Everywhere except America, that is. The album received a belated release in the U.S., appearing in August of 1996, and the group attempted an American tour, opening for Oasis. It should have led to increased exposure, but a blowup between the Gallaghers led to Oasis cancelling the entire tour, leaving the Manics at square one. They returned to the U.K. and toured, receiving a number of awards at the end of the year. They didn't deliver their much-anticipated follow-up, This Is My Truth Tell Me Yours, until August of 1998. The album was another blockbuster success in the U.K., Europe, and Asia, but it didn't receive a release in America, since the Manics were in the process of leaving Epic in the U.S.\n\nFor a while, there was simply no interest in the Manics by American labels, but another multi-platinum album and numerous awards in Britain revived interest. The band signed with Virgin, which released This Is My Truth Tell Me Yours in June 1999 -- nearly a year after its initial release. Know Your Enemy followed in 2001, although it was not well-received, and the band moved to Sony for British distribution of 2004's Lifeblood. Both vocalist/guitarist James Dean Bradfield and bassist Nicky Wire followed this release with solo albums, and then reconvened in 2007 to record the edgier, punk-influenced Send Away the Tigers with producer Dave Eringa.\n\nReview by Stephen Thomas Erlewine\n\nIf Everything Must Go found Manic Street Preachers coping with Richey James' sudden, unexplained disappearance, its follow-up, This Is My Truth Tell Me Yours, finds them putting the tragedy behind them and flourishing as a trio. Wisely, the group builds on the grand sound of Everything Must Go, creating a strangely effective fusion of string-drenched, sweeping arena rock and impassioned, brutally honest punk. Since the band never writes about anything less than major issues, whether it be political or personal, it's appropriate that their music sounds as majestic and overpowering as their pretensions. Given that the first single was titled &quot;If You Tolerate This Then Your Children Will Be Next,&quot; calling the Manics pretentious is fair game, but they make their pretensions work through a blend of intelligence, passion, and sheer musicality. This Is My Truth sports more musical variety than its predecessors, which means it can meander a bit, particularly toward the end. Nevertheless, these misgivings disappear with repeated listens, as each song logically flows into the next. If the album ultimately isn't as raw or shattering as The Holy Bible or emotionally wrenching as Everything Must Go, it's because the ghost of Richey has been put behind them. That doesn't mean that This Is My Truth is light, easygoing listening -- the portentous, murky closer &quot;SYMM&quot; guarantees that -- but it's not as torturous as its immediate predecessors. But what it shares with them is a searing passion and intelligence that is unmatched among their peers on either side of the ocean -- and, in doing so, it emphasizes the Manics' uniqueness as one of the few bands of the '90s that can deliver albums as bracing intellectually as they are sonically.","torrent":{"xt":"urn:btih:1f655d311554c91ac195e55c79d863eaf4e43ad5","amp;dn":"Manic+Street+Preachers+-+This+Is+My+Truth+Tell+Me+Yours+-+%281998%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f655d311554c91ac195e55c79d863eaf4e43ad5","infoHashBuffer":{"type":"Buffer","data":[31,101,93,49,21,84,201,26,193,149,229,92,121,216,99,234,244,228,58,213]},"announce":[],"urlList":[]}}