{"title":"The Baltic Tragedy - Third Reich  - Doku wmv","uid":3310148,"size":1222418710,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1f8f3793e086215bfb8329c5a6e5963dbd79287f&amp;dn=The+Baltic+Tragedy+-+Third+Reich++-+Doku+wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lord_Haw_Haw","files":1,"time":1112380682,"description":"The Baltic Tragedy (1985 .wmv format)\n\n\nEnglish language or German/Estonian/Portugese with ENGLISH SUBTITLES\nEnglishe sprache oder Deutsche Ton mit englisher untertitel\n \nDetails http://ihffilm.com/23.html\n\nHitler's war on Russia is graphically portrayed in 11 original German wartime newsreels. The northern sector of the Germans' eastern front, where ferocious battles were fought in Latvia, Lithuania, Estonia and Finland, is featured. Four additional international documentaries--including one produced by the Soviets in 1944--present a well-rounded picture of the tragic plight of the Baltic peoples during World War II. Here is the story of the captive nations--whose lands became a killing ground for one of history's most brutal wars.\n\nSpecial care has been taken by International Historic Films to assemble this monumental documentary, which tells the story of what is left for a people after its land has been ravaged by war. Situated between the powerful antagonists Germany and the Soviet Union, the Baltic nations of Latvia, Lithuania, and Estonia bore witness to some of the most ferocious land battles of the Second World War.\n\nEvery film and film sequence included in this unique compilation is the result of years of painstaking research by International Historic Films. The American, German, Latvian, and Soviet films which compose the program have all been selected both for their historical contributions to the theme of The Baltic Tragedy and for the exceptionally high visual quality of the original negatives from which most of these sequences were reproduced. The segments are chronologically arranged, and introduced with brief explanatory titles.\n\nI. My Latvia\nA documentary featurette of the illegal Soviet military occupation of the three then-autonomous Baltic states in 1940. This unusual film, which illuminates communist methods of internal subversion and conquest, includes rare scenes of Stalin and other Soviet leaders attending closed Kremlin meetings, and examines the criminal background of the Latvian nationals who invited the Soviets into that country and subsequently assumed high communist government posts. A grim, gripping film, produced by the Latvian filmmaker Albert Jekste.\n\nII. German Newsreel of June 22nd, 1941*\nThe first scenes ever shown to the world of Operation Barbarossa, the German invasion of Soviet Russia which began on June 22nd, 1941. Practically all of the footage in this excerpt was shot on the first day of the campaign, and shows German infantrymen seizing river crossings and dueling with Soviet machinegun nests and snipers in a Lithuanian border town.\n\nIII. German Newsreel of June-July 1941\nThe following week, the German wartime newsreel opened with flashback scenes of the 1939 Russo-Finnish war. The newsreel also features a long combat sequence of the battle for Lithuania and the capture of her capital city, Kaunas, as well as the advance on other strategic towns by the Germans.\n\nIV. German Newsreel of July 1941\nThe barbarism of Soviet rule is the subject of this controversial German newsreel, which includes gruesome scenes of Baltic civilians who were tortured and murdered in large numbers by the retreating Red Army. Jewish members of the Soviet secret police who were captured and filmed by the Germans are shown as the authors of these crimes in a classic example of anti-Jewish propaganda from the Third Reich. The military sequences are highlighted by the crushing defeat which was inflicted on the Soviet forces by the Germans near Minsk.\n\nV. German Newsreel of July-August 1941\nThe six-week-long battle for Estonia, which the German 18th Army invaded on July 7th, is the subject of this newsreel, which includes the Germans' triumphant entry into Tallinn as well as the violent land and air battles which ensued when the German forces attempted to prevent the trapped Red Army units from escaping the coastal region by sea.\n\nVI. German Newsreel of October 1941\nThis newsreel offers a close look at the faces of the men who operate a communist torture chamber, in this instance a group of Soviet prison guards who surrendered to the German troops on the island of Saaremaa. The German newsreel commentator reads quotations from a speech by President Roosevelt praising the Soviet system of justice, as scenes of the mutilated bodies of the victims of the Russian guards are shown in the prison yard.\n\nVII. German Newsreel in Portuguese of November 1941\nThis rare newsreel segment is an example of a German wartime newsreel made for foreign distribution. Narrated in Portuguese, the film shows air battles along the northern sector of the Eastern Front, as well as the German attacks against Narva and Novgorod.\n\nVIII. German Newsreel in Estonian Language\nFrom an Estonian-language newsreel made by the Germans, this segment shows a mass meeting in Riga of Baltic civilians volunteering to work for the German war effort.\n\nIX. German Newsreel of February 1944\nEstonian members of the Waffen SS are shown in action both offensively and defensively in the bloody see-saw fighting for the Narva sector, which became one of the longest and most famous battles of the German-Soviet war.\n\nX. Soviet Newsreel of July 1944\nThis rare segment from an original Soviet wartime newsreel shows the preliminary artillery bombardment and Soviet attack on Vilnius, Lithuania, as well as the Red Army's first contact with the city's civilian population.\n\nXI. German Newsreel of August 1944\nA graphic picture of the German army in retreat is presented in this newsreel, which shows the Wehrmacht's evacuation of the city of Kaunas, the action of various rear-guard units, the unloading of a supply train, and a subsequent violent counter-attack against Soviet forces advancing into Latvia.\n\nXII. German Newsreel of October 1944\nFilmed on the Baltic Sea, this German newsreel dramatizes the plight of thousands of Estonian civilians as they are evacuated to Germany on a German naval convoy. A sequence showing a parade of Latvian members of the German Air Force is also included.\n\nXIII. German Newsreel of January 1945\nIn one of the last German wartime newsreels, a glimpse of the ferocious defensive battle for the Courland peninsula in Latvia is shown. Germany's Army Group Courland, which repulsed six Soviet offensives and held out to the end of the war, was the German army's only undefeated army group of the Second World War.\n\nXIV. The subject of this English-narrated newsreel excerpt, filmed in post-war Sweden, is the forcible repatriation (Operation Keelhaul) to the Soviet Union - and to certain death - of 167 Baltic men who had escaped by sea to Sweden in May 1945 after wartime military service with Germany's Army Group Courland. A grim example of what was beginning to take place in Eastern Europe while Westerners were settling into a long period of peace and prosperity.\n\nXV. The Homeless\nThis 1949 American film, narrated by Henry Fonda, examines life in a West German camp for displaced Baltic citizens, who because of the communist regime now gripping their own nations, could not return home. Carefully avoiding criticism of the Soviet Union, the film is an apologetic token, rather than a tribute to the suffering of these thousands.\nUltimately released from their confinement, many of the homeless seen in this feature eventually found a new home in the United States. Therefore this film, together with the entire Baltic Tragedy program, presents yet another chapter of the roots of the peoples who fled from sorrow and enslavement, from wretchedness and war, toward uncertainty and hope, who today are part of the nation that is America.\n\nGermany/USA/USSR, 1940-1946, B&amp;amp;W, Total running Time: 148 minutes\n\n\nhttp://www.stormfront.org/forum/index.php?referrerid=59813\n\n","torrent":{"xt":"urn:btih:1f8f3793e086215bfb8329c5a6e5963dbd79287f","amp;dn":"The+Baltic+Tragedy+-+Third+Reich++-+Doku+wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f8f3793e086215bfb8329c5a6e5963dbd79287f","infoHashBuffer":{"type":"Buffer","data":[31,143,55,147,224,134,33,91,251,131,41,197,166,229,150,61,189,121,40,127]},"announce":[],"urlList":[]}}