{"title":"Rajkahini (2015) HEVC-x265.AAC.Esubs-1CD-DDR","uid":13512003,"size":737176071,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1fbe112d5bc1a53df3be547464cdd85ee1b67978&amp;dn=Rajkahini+%282015%29+HEVC-x265.AAC.Esubs-1CD-DDR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":4,"time":1455292554,"description":"DDR Presents\r\n\r\n\r\nRajkahini (2015)\r\n(A film by Srijit Mukherji)\r\n\r\nBengali - DVD.rip - 720x304p (2.35:1)- 698 MB - x265.AAC - 2 Hrs:39 Min\r\n\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n \nhttp://extraimago.com/image/Wl6 \nhttp://extraimago.com/image/Wlx \nhttp://extraimago.com/image/Wlt \nhttp://extraimago.com/image/Wlo \nhttp://extraimago.com/image/Wlk \nhttp://extraimago.com/image/WlH \nhttp://extraimago.com/image/WlF \nhttp://extraimago.com/image/WlD \nhttp://extraimago.com/image/Wl5 \nhttp://extraimago.com/image/Wlg \nhttp://extraimago.com/image/WlX \nhttp://extraimago.com/image/WlP\r\n\r\nTech Specifications:\r\n\r\n\r\nSpecs:\r\nFormat : MKV/Matroska\r\nFile size : 698 MiB\r\nDuration : 2h 39mn 49sec\r\nOverall bit rate : 611 Kbpss\r\n\r\nVideo:\r\nFormat : HEVC\r\nFormat/Info : High Efficiency Video Coding\r\nFormat profile : Main   @Main\r\nBit rate : 421 Kbps\r\nWidth : 720 pixels\r\nHeight : 304 pixels\r\nDisplay aspect ratio : 2.35:1\r\nFrame rate : 23.976 fps\r\n\r\nAudio:\r\nFormat : AAC\r\nFormat/Info : Advanced Audio Codec\r\nChannel(s) : 6 channels\r\nBit rate : 192 Kbps\r\nChannel positions : Front: L C R, Side: L R, LFE\r\nSampling rate : 48.0 KHz\r\nLanguage : Bengali\r\n\r\n\r\n\r\nSynopsis:\r\nIn 1947 August, the British passed a bill regarding the partition of Bengal. Delving into the grim history of the Partition, Mukherjee's movie Rajkahini is weaved around a border between the two nations that runs through a brothel housing 11 women.\r\nThis film revolves around the era of 1947 and explores the consequences of partition of India. Delving into the grim history of the partition, Mukherjee's movie Rajkahini is weaved around a border between the two nations that runs through a brothel housing eleven women.\r\n\r\n\r\nComments:\r\nHere the director has shown and more or less even proved that the prostitutes (among females) and the dacoits/thieves/ terrorists/ uncouth &amp; unruly (among males) are higher or greater humans...since they do not judge people by their cast, creed or religion! They offer their services irrespective of caste and religion! For them everyone is alike....unlike for our kinds of hypocrite commoners who, as the prostitute mentions, do not even let a prostitute touch their shadow in the morning but greedily 'effs' them at night!\r\n\r\nFilm showed how closely the top Government officials, cops and the terrorists are linked together and how they perform their respective duties ....by actually discussing and planning the modus operandi ! Film showed that just couple of (less than 40% maybe) of people actually knew what they were doing while fighting for independence – rest were just waiting for some kind of opportunity of ruckus and unrest so that they could loot well-off merchants and plunder with the modesty of women – any women between the age group of 8 to 80! Similar thing has been shown in many films with Freedom as the theme – eg. 1947 Earth, where Aamir and his friends had their eyes on Nandita Das who was an aayah in a Parsi household ...and how they dragged her on the street to rape and kill her! They were the same ones who used to exchange courteous pleasantries with the same aayah when things were at peace!\r\n\r\nIn a country where people were uneducated, hungry and underfed – who knew nothing about freedom fighting etc....what else was expected from them!? They did only what was most natural for them to do – rape females, loot people and murder them if they screamed!\r\n\r\nUploader's Notes:\r\nThis HEVC rip is an example of how this codec can be used to compress a vdeo. The quality of this rip would match any 2-CD X264 rip and the 10-bit encoding allows us to reduce banding and artifacts. Apart from this, we have slightly bring out natuaral colours and make the picture look more like what was visible on the movie theatre. A little bit of shadow gaining also helps in bringing greater clarity to the picture.\r\n\r\nEnjoy!\r\n\r\nPlease note that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt4948632/","torrent":{"xt":"urn:btih:1fbe112d5bc1a53df3be547464cdd85ee1b67978","amp;dn":"Rajkahini+%282015%29+HEVC-x265.AAC.Esubs-1CD-DDR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fbe112d5bc1a53df3be547464cdd85ee1b67978","infoHashBuffer":{"type":"Buffer","data":[31,190,17,45,91,193,165,61,243,190,84,116,100,205,216,94,225,182,121,120]},"announce":[],"urlList":[]}}