{"title":"Phase Transitions in Polymers - The Role of Metastable States","uid":14646076,"size":5092123,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:207c677f60e7fbdf5562b5c87d7ddbaf6fce10e3&amp;dn=Phase+Transitions+in+Polymers+-+The+Role+of+Metastable+States&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1463588442,"description":"Phase Transitions in Polymers - The Role of Metastable States - Stephen Z. D. Cheng (Elsevier, 2008).pdf\r\n\r\nA classical metastable state possesses a local free energy minimum at infinite sizes, but not a global one. This concept is phase size independent. We have studied a number of experimental results and proposed a new concept that there exists a wide range of metastable states in polymers on different length scales where their metastability is critically determined by the phase size and dimensionality. Metastable states are also observed in phase transformations that are kinetically impeded on the pathway to thermodynamic equilibrium. This was illustrated in structural and morphological investigations of crystallization and mesophase transitions, liquid-liquid phase separation, vitrification and gel formation, as well as combinations of these transformation processes. The phase behaviours in polymers are thus dominated by interlinks of metastable states on different length scales. This concept successfully explains many experimental observations and provides a new way to connect different aspects of polymer physics.\r\n\r\n* Written by a leading scholar and industry expert\r\n* Presents new and cutting edge material encouraging innovation and future research\r\n* Connects hot topics and leading research in one concise volume","torrent":{"xt":"urn:btih:207c677f60e7fbdf5562b5c87d7ddbaf6fce10e3","amp;dn":"Phase+Transitions+in+Polymers+-+The+Role+of+Metastable+States","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"207c677f60e7fbdf5562b5c87d7ddbaf6fce10e3","infoHashBuffer":{"type":"Buffer","data":[32,124,103,127,96,231,251,223,85,98,181,200,125,125,219,175,111,206,16,227]},"announce":[],"urlList":[]}}