{"title":"DOCman 1.5.2 Stable FULL - Joomla! Extension","uid":5475139,"size":715920,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:20f146321d6fbd1f66a8b50290b9427cddced68c&amp;dn=DOCman+1.5.2+Stable+FULL+-+Joomla%21+Extension&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"krieg88","files":-1,"time":1270100690,"description":"DOCman 1.5.2 Stable FULL\n------------------------\n\nDOCman is a document and dowload management solution for Joomla! v1.5. DOCman makes offering downloadable documents on your Joomla site a breeze.\n\nManage documents across multiple categories and subcategories, give users permission to upload, download or edit documents. Store documents either locally or remotely and prevent direct linking using our build-in anti-leech system.\n\nAll from within an intuitive and simple to use administration interface.\n\n\nJOOMLA 1.5 NATIVE!\n\n\n\nThese are the main features of DOCman\n-------------------------------------\n\n* Infinite categories and subcategories. The documents can be organized across custom categories and subcategories;\n\n* Files can be hosted locally or on a remote server\n\n* Access control: Documents can be assigned to specific user or to custom groups of users\n\n* Download counter and log. You can display a download counter per document and all the downloads can be logged (by user, IP, browser, date and hour);\n\n* Own search system. Documents can be searched by name and/or description. The search system integrates with Joomla! using an optional mambot;\n\n* Anti-leech system. The built-in anti-leech system avoids direct linking to documents;\n\n* Path protection. Real paths to documents are never displayed to users;\n\n* Themes: The layout can be changed using custom themes;\n\n* ... and much more!\n\n\n\nDOCman 1.5.2 released on 1/20/2010\n----------------------------------\n\nToday we released the latest update of DOCman 1.5 to our customers. These are some of the most important changes:\n\n* PHP 5.3 compatibility. Depending on your server configuration, running DOCman on PHP 5.3 produced a couple of innocent yet annoying error messages.\n    \n* Special characters in filenames. DOCman is now much better equiped to handle filenames with all kinds of strange characters in them.\n    \n* Deleted users. When you delete a user, the documents that user owned now no longer generate errors.\n\n* Clear Thumbnails. This new item in the 'Clear data' panel allows you to remove the thumbnails for all documents. This useful in combination with the upcoming Thumbnail generation add-on.\n    \n* ... and a whole bunch of other fixes and improvements. \n\nAs usual, users who bought v1.5.x get free updates. To get you own copy, head over to the Joomlatools Store.\n\n\n\nSystem Requirements\n-------------------\n\n1. Joomla 1.5.x (recommended 1.5.15 or later). \n2. PHP 5.2.x or higher\n3. Database: MySQL 4.1 or higher","torrent":{"xt":"urn:btih:20f146321d6fbd1f66a8b50290b9427cddced68c","amp;dn":"DOCman+1.5.2+Stable+FULL+-+Joomla%21+Extension","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20f146321d6fbd1f66a8b50290b9427cddced68c","infoHashBuffer":{"type":"Buffer","data":[32,241,70,50,29,111,189,31,102,168,181,2,144,185,66,124,221,206,214,140]},"announce":[],"urlList":[]}}