{"title":"The Who - The Who By Numbers [320k MP3]","uid":7042365,"size":120196780,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:217107972348671216af6df82b45bf5b1ee460f2&amp;dn=The+Who+-+The+Who+By+Numbers+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"smbdownload","files":-1,"time":1329598326,"description":"The Who by Numbers is the seventh album by English rock band The Who, released on 3 October 1975 in the United Kingdom through Polydor Records, and on 25 October 1975 in the United States by MCA Records.\n\nTrack Listing [320k MP3]\n\nAll songs written by Pete Townshend, except where noted\n\n\n01. \t&quot;Slip Kid&quot;   \t4:29\n02. \t&quot;However Much I Booze&quot;   \t5:03\n03. \t&quot;Squeeze Box&quot;   \t2:41\n04. \t&quot;Dreaming from the Waist&quot;   \t4:08\n05. \t&quot;Imagine a Man&quot;   \t4:00\n06. \t&quot;Success Story&quot; (John Entwistle) \t3:20\n07. \t&quot;They Are All in Love&quot;   \t3:00\n08. \t&quot;Blue Red and Grey&quot;   \t2:47\n09. \t&quot;How Many Friends&quot;   \t4:06\n10. \t&quot;In a Hand or a Face&quot;   \t3:25\n\n1996 reissue bonus tracks\n\n11. \t&quot;Squeeze Box&quot; (Live) \t4:13\n12. \t&quot;Behind Blue Eyes&quot; (Live) \t3:41\n13. \t&quot;Dreaming from the Waist&quot; (Live) \t4:52\n\n-------------------------------------------------------------------------------\n\nWithout the massive structure and ambition of the band's better known works Tommy, Quadrophenia and Who's Next, Pete Townshend's songwriting stands on its own in the sparse and dark The Who by Numbers. Gone are the synthesisers and the massive layers of overdubs. In their places are descriptions of Townshend's alcoholism, lust, and self-loathing, as well as the dark side of creeping &quot;middle age&quot;[clarification needed] and the fear of irrelevance. On &quot;They Are All in Love&quot;, Townshend laments: &quot;Hey goodbye all you punks, stay young and stay high/Hand me my chequebook and I'll crawl off to die&quot;. These themes extend from the hopeless refrain of &quot;However Much I Booze&quot; (sung by Townshend, as Daltrey thought it was too personal to sing), &quot;There ain't no way out&quot; to the disillusioned question, &quot;How many friends have I really got?&quot; Who fans have often jokingly dubbed The Who By Numbers, &quot;Pete Townshend's suicide note&quot;.\n\nA few tracks stand in contrast, including the playfulness of the top ten hit &quot;Squeeze Box&quot; and &quot;Blue, Red and Grey's&quot; claim that &quot;I like every minute of the day&quot;. But John Entwistle's contribution, &quot;Success Story&quot;, returns to display nearly as despairing and cynical a view of stardom as the rest of the record. &quot;In a Hand or a Face&quot; revisits both lyrical and musical themes of Who songs dating back to the previous decade and offers an unexpectedly fiery ending to the album.\n\nIn an interview from 30 Years of Maximum R&amp;B, Townshend declared &quot;Dreaming from the Waist&quot; and &quot;Sister Disco&quot; (from Who Are You) as his least favourite songs to play on stage. In humorous contrast, Entwistle declared in the same series of interviews that &quot;Dreaming from the Waist&quot; was one of his favourite songs to perform live.\n\nThe cover was drawn by Entwistle as he was drawing a cartoon history of The Who.\n\nThe Who by Numbers peaked at the number 7 position on the UK album chart and number 8 on the Billboard 200 album chart in the US.","torrent":{"xt":"urn:btih:217107972348671216af6df82b45bf5b1ee460f2","amp;dn":"The+Who+-+The+Who+By+Numbers+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"217107972348671216af6df82b45bf5b1ee460f2","infoHashBuffer":{"type":"Buffer","data":[33,113,7,151,35,72,103,18,22,175,109,248,43,69,191,91,30,228,96,242]},"announce":[],"urlList":[]}}