{"title":"The Airplane - How Ideas Gave Us Wings (Malestrom)","uid":4724543,"size":5714994,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:228dd0aa059013d641650967c5704e7b386aa102&amp;dn=The+Airplane+-+How+Ideas+Gave+Us+Wings+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1234686337,"description":" &lt;a href=&quot;http://www.image-upload.net/images/7d0ap3vkenia4gbx0s0f.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/7d0ap3vkenia4gbx0s0f.jpeg&lt;/a&gt;\n\nJay Spenser, &quot;The Airplane: How Ideas Gave Us Wings&quot;\nCollins | 2008-11-01 | ISBN: 0061259195 | 352 pages | PDF\n\nThe inside story of how people invented and refined the airplane.\n\nWho were aviation's dreamers and from where did they draw their inspiration? What lessons did inventors learn from birds, insects, marine mammals, and fish that helped us fly? How did the bicycle lead to the airplane, and hot water heaters to metal fuselages?And who figured out how to fly without seeing the ground, setting the stage for scheduled airline services in all weather conditions?\n\nIn this entertaining history of the jetliner, Jay Spenser follows the flow of simple yet powerful ideas to trace aviation's challenges. He introduces us to pioneers across continents and centuries, sheds new insights on their contributions, and evokes those key moments in history when, piece by piece, such innovators as Otto Lilienthal, Igor Sikorsky, Louis Bleriot, Hugo Junkers, and Jack Northrop collectively solved the puzzle of flight.\n\nAlong the way, Spenser demystifies the modern jetliner. From wings to flight controls to fuselages to landing gear, he examines the parts of the airplane to show how they came into being and have evolved over time. The Airplane culminates in a discussion of Boeing's 787 Dreamliner and explores the possibilities for aviation's future.\n","torrent":{"xt":"urn:btih:228dd0aa059013d641650967c5704e7b386aa102","amp;dn":"The+Airplane+-+How+Ideas+Gave+Us+Wings+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"228dd0aa059013d641650967c5704e7b386aa102","infoHashBuffer":{"type":"Buffer","data":[34,141,208,170,5,144,19,214,65,101,9,103,197,112,78,123,56,106,161,2]},"announce":[],"urlList":[]}}