{"title":"The pretender Seizoen 1 DVD 9 en 10 van 10 Retail--TBS","uid":8798529,"size":5641195536,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:236bc7c5366c648aabe3d3d2268abf4d986bff3d&amp;dn=The+pretender+Seizoen+1+DVD+9+en+10+van+10+Retail--TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Saggin","files":-1,"time":1376095089,"description":"[b]The pretender Seizoen 1 DVD 9 en 10 van 10 Retail [/b]\n\n[img]http://ecx.images-amazon.com/images/I/51DB1RM4D5L.jpg[/img]\n\nJarod (Michael T. Weiss) is een geniale man die als kind van zijn \nouders werd ontnomen door een organisatie die zichzelf The Centre \nnoemt. Zij waren eropuit zijn intelligentie te maximaliseren zodat \nhij allerlei simulaties kon oplossen. Dit zodat ze hem daarna zouden \nkunnen gebruiken voor hun eigen kwaadaardige plannen. Wanneer Jarod \nerachter komt waar de simulaties voor dienen, ontsnapt hij uit het \nhoofdkwartier van The Centre en probeert hij een leven op te bouwen \nin een buitenwereld die hij nooit gekend heeft. \n\nHij is telkens verrast door de dingen die reguliere mensen doen en geniet \n\nvan het \nleren over het bestaan van zaken als chocolademelk en wegwerpluiers.\nTerwijl Jarod probeert een normaal bestaan buiten The Centre te \nleiden, gebruikt hij zijn geleerde Pretender-vaardigheden om mensen \nte helpen als ze in de problemen zitten. Hij is door zijn intellect \nin staat de identiteit aan te nemen van ieder soort persoon die op \ndat moment vereist is om een opdracht te laten slagen. Zijn b.rein \nstelt hem bovendien in de gelegenheid om te overleven in allerlei \nsituaties. In de dagelijkse omgang kijken zijn medemensen hem \nniettemin vreemd aan omdat hij door zijn wereldvreemdheid een \ntamelijk kinderlijk overkomende persoonlijkheid heeft.\n\nThe Centre accepteert in de tussentijd niet dat hun Pretender \nervandoor is en is tot alles bereid om hem terug te halen en opnieuw \nop te sluiten in hun complex. Een team bestaande uit Broots (Jon \nGries), Sydney (Patrick Bauchau) en Miss Parker (Andrea Parker) is \nbelast met deze taak. Hoewel zij verschillende keren in de buurt \nkwamen, lukte het ze nooit Jarod definitief te vangen.\nJarod zelf houdt enigszins contact met zijn voormalige leraar uit The \nCentre, Sydney. Die heeft hem opgevoed en voor hem gezorgd in zijn de \ntijd in gevangenschap. Sydney helpt hem met allerlei zaken, zonder \ndat hij zich daar zelf helemaal van bewust is. Hij instrueert Jarod \nhoe hij het beste om kan gaan met verschillende situaties en \ngevoelens. \n\nNr. \tTitel \n1 \tPilot \t\n2 \tEvery Picture Tells a Story \t\n3 \tFlyer \t\n4 \tCurious Jarod \t\n5 \tThe Paper Clock \t\n6 \tTo Serve and Protect \t\n7 \tA Virus Among Us \t\n8 \tNot Even a Mouse \t\n9 \tMirage \n10 \tThe Better Part of Valor \t\n11 \tPotato Head Blues \t\n12 \tPrison Story \t\n13 \tBazooka Jarod \t\n14 \tRanger Jarod \t\n15 \tJaroldo! \t\n16 \tUnder the Reds \t\n17 \tKeys \t\n18 \tUnhappy Landings \t\n19 \tJarod's Honor \t\n20 \tBaby Love \t\n21 \tDragon House: Part 1 \t\n22 \tDragon House: Part 2 \n\n*******************************************\n\nStoryline\n\nJarod is a pretender, a very intelligent person with the ability to \nslide into somebody else's personality. For that purpose, he has been \ntaken from his family as a child in order to work for a secret agency \ncalled The Centre. But recently, he escaped. Jarod's new mission in \nlife is to help people in need with his gift, and to find out what \nreally happened to his allegedly dead parents. Only, Miss Parker and \nher team are out to get him... \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0115320&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0115320&lt;/a&gt;\n\n\nInformatie :\nTitel      : The pretender Seizoen 1\nBron       : retail\nFormaat    : DVD5 \nGeluid     : DD5.1\nMenu       : Ja\nExtra's    : Nee\nBeeld      : 4:3\nFramerate  : 25,000 fps\nStandaard  : PAL\nTaal       : Engels \nSubs       : NEDERLANDS \nCover      : ja \nLabel      : Nee\n\n\n\n[img]http://img708.imageshack.us/img708/589/blacksam3.jpg[/img]\n\n","torrent":{"xt":"urn:btih:236bc7c5366c648aabe3d3d2268abf4d986bff3d","amp;dn":"The+pretender+Seizoen+1+DVD+9+en+10+van+10+Retail--TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"236bc7c5366c648aabe3d3d2268abf4d986bff3d","infoHashBuffer":{"type":"Buffer","data":[35,107,199,197,54,108,100,138,171,227,211,210,38,138,191,77,152,107,255,61]},"announce":[],"urlList":[]}}