{"title":"Coast to Coast AM 2012.02.16 NDEs &amp; Afterlife, Area 51 &amp;","uid":7074878,"size":55385068,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:23f3a24b14c44011bad8ca73994dae9354a73861&amp;dn=Coast+to+Coast+AM+2012.02.16+NDEs+%26amp%3B+Afterlife%2C+Area+51+%26amp%3B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ViViDSOL","files":5,"time":1330800658,"description":"Coast to Coast AM 2012.02.16 NDEs &amp; Afterlife, Area 51 &amp; Economy\n\nHost:\tGeorge Noory\nGuests:\tChuck Harder, David Bennett\n\nIn the first half of the show, author David Bennett talked about transformative experiences and the afterlife. During his own near-death experience that occurred when he drowned while deep sea diving, he sensed a transforming light, his vision became spherical, and he felt himself to be a being of light. He underwent an intense life review where he saw not only his perspective but &quot;everyone else's perspective-- I felt their fear, their pain, their love, their joy,&quot; he said, noting that he also had a vision of his future. The light, composed of millions of interactive fragments, spoke to him and told him that it was not his time, and that he must return to his body because he had a purpose to fulfill.\n\nUpon his return, he found his life had dramatically changed, with increased intuitions and the ability to see auras, though at the time he struggled to share this with the people he knew. We all have guidance within us, and the potential to touch our higher consciousness and be awakened by it, he commented, adding that meditation is one avenue to experience this. There are moments in our life where we can find some stillness, and &quot;when we do that, spirit is quietly waiting for us,&quot; he said.\n\n-----------------------------\nIn the latter half, former syndicated talk show host and owner of the People's Radio Network:\n &lt;a href=&quot;\nhttp://www.wtprn.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.wtprn.com/&lt;/a&gt; \n\n the legendary Chuck Harder discussed how he was one of the first to break the Area 51 story in 1987, how he predicted the decline of the U.S. manufacturing base over 20 years ago, and what he advocates to fix the economy. He interviewed Bob Lazar on his radio show in 1987, and he &quot;told a very well laid out story of how he was hired by naval intelligence,&quot; to work on alien craft at a unit in Area 51 that was made for smaller sized people. He was impressed that Lazar's story remained absolutely consistent in its details in interviews in the years that followed. After he interviewed Lazar, Harder was sent various alien and UFO photos. One of them \n\n(which subsequently became known as the Amoco Alien:\n &lt;a href=&quot;\nhttp://forgetomori.com/2009/aliens/the-amoco-alien/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forgetomori.com/2009/aliens/the-amoco-alien/&lt;/a&gt; ) \n\nimpressed him with its photographic details, and difficulty to fake during the time frame of the late 1980s.\n\nOne of Harder's ideas to bring manufacturing back to the US involves initiating a credit card called the &quot;Americard,&quot; which could only be used to purchase American-made goods, and would give tax benefits to the user based on the amortization of the products. Additionally, he suggested that America change the color of its money, which would immediately make the drug money filling warehouses, worthless. He also talked about the dangers of an EMP attack, and mentioned that he'd co-developed two patents on how to harden the power grids, which he is giving away on his website \n\n(PDF file:\n &lt;a href=&quot;\nhttp://www.chuckharder.com/SAVEGRID.pdf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.chuckharder.com/SAVEGRID.pdf&lt;/a&gt; ).\n\nNews segment guests: Katherine Albrecht, Catherine Austin Fitts\n\nWebsite(s):\n &lt;a href=&quot;\nhttp://chuckharder.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://chuckharder.com&lt;/a&gt; &lt;a href=&quot;\nhttp://wtprn.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wtprn.com&lt;/a&gt; &lt;a href=&quot;\nhttp://voyageofpurpose.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://voyageofpurpose.com&lt;/a&gt;\n\nBook(s):\nVoyage of Purpose &lt;a href=&quot;\nhttp://amzn.to/wXUIlY&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/wXUIlY&lt;/a&gt;\n\nWill we ever learn? &lt;a href=&quot;\nhttp://amzn.to/zVkaXr&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/zVkaXr&lt;/a&gt;","torrent":{"xt":"urn:btih:23f3a24b14c44011bad8ca73994dae9354a73861","amp;dn":"Coast+to+Coast+AM+2012.02.16+NDEs+%26amp%3B+Afterlife%2C+Area+51+%26amp%3B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23f3a24b14c44011bad8ca73994dae9354a73861","infoHashBuffer":{"type":"Buffer","data":[35,243,162,75,20,196,64,17,186,216,202,115,153,77,174,147,84,167,56,97]},"announce":[],"urlList":[]}}