{"title":"Awesome Party: 2002&amp;ndash;2003 complete works","uid":7515453,"size":2605841341,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:25b7262d67228c1fc7d6f9a0fdc09a9dac282e01&amp;dn=Awesome+Party%3A+2002%26ndash%3B2003+complete+works&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cooliomonsieur","files":222,"time":1344456442,"description":"The music on this album, drawn from Awesome Party's own library of private tapes, was recorded informally and intended only for live radio transmission.  However, since British interest in the group has been unusually great, it has been decided to make some of this unofficial material available to the public in this country.  These tapes have been left exactly as they were recorded - frequently live - and no post-production work has been imposed on them.  \n\nIn Fall 2002, R. Arnaoot, R. Davis, and W. Hoffman cloistered themselves in a converted radio station between Washington, DC and Tennessee, with all the necessary electronic and acoustic equipment, to produce their sounds and their music.  They were called Awesome Party.  At present they are the most avantgarde group in the United States, if not the world.  &quot;Sounds from the Pocket&quot;, the first albm to result from this single-minded retreat, was at first hearing quite disconcerting.  Then one listens again and finds that this sound-collage releases something, takes on meaning, and begins to make an impression.  One starts to be intrigued by this totally opaque record, by the shifting dreams and incantations of &quot;KISS&quot;; one is surprised by the richness in the expressive chaos of &quot;Hammer Drill&quot;, which covers side two and was recorded under live conditions.  Awesome Party are already unquestionably more advanced than any of their fello-countrymen.  They've mastered the nuances of electro-acoustic sound and employ this knowledge with audacity.  In fact, one's only reservations concern the question of such experiment remaining widely communicable - for isn't tere a danger of insularity?  To this, Awesome Party reply: &quot;Are you ready?  This piece is beautiful; but any piece we pick is going to beautiful, so you should just accept that at this point.&quot;","torrent":{"xt":"urn:btih:25b7262d67228c1fc7d6f9a0fdc09a9dac282e01","amp;dn":"Awesome+Party%3A+2002%26ndash%3B2003+complete+works","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25b7262d67228c1fc7d6f9a0fdc09a9dac282e01","infoHashBuffer":{"type":"Buffer","data":[37,183,38,45,103,34,140,31,199,214,249,160,253,192,154,157,172,40,46,1]},"announce":[],"urlList":[]}}