{"title":"QARI CD - Digital Furqan Vol 1","uid":3496768,"size":676872348,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26a1ade434e8a830f9975be8a147f0d00775bcd7&amp;dn=QARI+CD+-+Digital+Furqan+Vol+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"aghaif","files":1,"time":1150819237,"description":"QARI CD - Digital Furqan Volume 1\n\n\nThis Cd is contains 30 juzs of Al Qur\\&amp;#039;an incorporated with translation in English and Malay.\n\nFeatures:\n\nUsing high resolution graphics (1024 x 768 pixels) to give more details for the mushaf. High resolution audio (sampled at 22kHz stereo) compressed using MP3 technology to produce a high quilty sound even fitted in a single CD. Equipped with precision pointer\\&quot; to give the exact position where the recitation goes on. Equipped with advance features such as \\&quot;Bookmark\\&quot;\\&quot;Play list\\&quot; \\&quot;Full screen mode\\&quot; and more that helps to navigate, learn and memorize the verses. Comes with high speed search engine, multi language translation and more...\n\nMinimum System requirements\n\nIBM PC or compatible with pentium 133MHz or above \nA CD-ROM drive \n32 MB RAM \nWindows compatible sound system \nTrue color SVGA \nMicrosoft windows 95/98/2000/XP or above \n\nQUICK GUIDE: \n\nAutorun Menu \nFor friendly usage this QARI CD was equipped with autorun function. Just insert the CD into the CD ROM drive and it will automatically launch an autorun menu. To run this QARI CD using built-in Qari Player Software, just click on Run Qari CD\\&quot; button.\n\nIf you have to install the sound driver, please click on Install Audio Driver Problem Sometimes when you run QARI CD for a very first time on a computer and start the recitation then you hear nothing and the pointer not moved anywhere. This is caused by audio playback faulty. The problem existed only on Windows 95 and 98 because the MP3 format for WAV file was not supported. This can be solved by installing an optional audio driver to those operating system. If this happened to you, then you have to install the sound driver. The insatallation can be done from autorun menu by pressing \\&quot;Install Sound Driver\\&quot; button. Follow the instructions until the installation completed. Now everything should be OK.This installation should be done only once for a computer. Further installation is unneccessary.\n","torrent":{"xt":"urn:btih:26a1ade434e8a830f9975be8a147f0d00775bcd7","amp;dn":"QARI+CD+-+Digital+Furqan+Vol+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26a1ade434e8a830f9975be8a147f0d00775bcd7","infoHashBuffer":{"type":"Buffer","data":[38,161,173,228,52,232,168,48,249,151,91,232,161,71,240,208,7,117,188,215]},"announce":[],"urlList":[]}}