{"title":"LEONARD.COHEN.SONGS.FROM.THE.ROAD.DVDR.ISO","uid":6062403,"size":4681496576,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:26cbaa9553bde5bbe90a272b51ca3afe64c95e6b&amp;dn=LEONARD.COHEN.SONGS.FROM.THE.ROAD.DVDR.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lindoff41","files":1,"time":1293186999,"description":"eonard Cohen is a Canadian poet, folk singer songwriter and writer. He is \nbest known for hits such as Suzanne, Hallelujah and So Long, Marianne.Cohen was born into a Jewish middle class family in Montreal. As a teenager he learned to play guitar and formed a country / folk group called the Buckskin Boys. He studied literature at McGill University in order to become a poet and debuted in 1956 with Let Us Compare Mythologies. Already in 1961 he was a familiar name Canadian poetry circles. In 1967 Cohen moved to the United States, where he was an established reputation as a singer-songwriter. Cohen in 2008 included in the Rock and Roll Hall of Fame.Songs From The Road is a collection of the most memorable moments of Leonard Cohen's first tour since 15 years! The album contains 12 special live tracks recorded at various locations around the world.\nExtra:\nThis DVD version contains the 12 live tracks along with exclusive bonus material. This material consists of a 20-minute recording with backstage interviews with all band members. The interviews were conducted by Lorca Cohen, the daughter of Leonard.\n\nTracklist:\n01. Lover, Lover, Lover (Ramat Gan Stadium, Tel Aviv, Israel, September 24, \n\n2009)\n02. Bird On The Wire (Clyde Auditorium, Glasgow, Scotland, November 6, 2008)\n03. Chelsea Hotel (Royal Albert Hall, London, England, November 17, 2008)\n04. Heart With No Companion (Oberhausen Arena, Oberhausen, Germany, November \n\n2, 2008)\n05. That Don't Make It Junk (O2 Arena, London, England, November 13, 2008)\n06. Waiting For The Miracle (Hp Pavilion, San Jose, California, November 13, \n\n2009)\n07. Avalanche (Gothenburg Scandinavium, Gothenburg, Sweden, October 12, \n\n2008)\n08. Suzanne (Mena Arena, Manchester, England, November 30, 2008)\n09. The Partisan (Hartwall Arena, Helsinki, Finland, October 10, 2008)\n10. Famous Blue Raincoat (O2 Arena, London, England, November 13, 2008)\n11. Hallelujah (Coachella Music Festival, Indio, California, April 17, 2009)\n12. Closing Time (John Labatt Centre, London, Ontario, May 24, 2009)","torrent":{"xt":"urn:btih:26cbaa9553bde5bbe90a272b51ca3afe64c95e6b","amp;dn":"LEONARD.COHEN.SONGS.FROM.THE.ROAD.DVDR.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26cbaa9553bde5bbe90a272b51ca3afe64c95e6b","infoHashBuffer":{"type":"Buffer","data":[38,203,170,149,83,189,229,187,233,10,39,43,81,202,58,254,100,201,94,107]},"announce":[],"urlList":[]}}