{"title":"Coast to Coast AM December 19 2012","uid":7942211,"size":54292862,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2726f363e6808f5c6e1277928e873c5dd1263a65&amp;dn=Coast+to+Coast+AM+December+19+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1356019116,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t12-19-12\nHost: \tGeorge Noory\nGuests: \tThomas Hackney, James Van Praagh, Open Lines\n\nAppearing during the second hour, publisher and extraterrestrial researcher Thomas Hackney (book link) discussed his research on SETI, and the uncanny string of coincidences surrounding comet and meteor strikes. In several instances, ETs have deliberately sent meteorites to impart coded communications, he contended, specifically citing the 1992 Peekskill meteorite which struck a parked car, and was seen as a green fireball in the sky before it crashed. He suggested that the 21 comet fragments from Comet Shoemaker-Levy 9 (which impacted Jupiter in 1994) was an ET reference to the 21st century.\n\nHackney shared his conclusion that ETs don't need UFOs or craft-- this notion is based on an outmoded human concept of transport. He also touched on the prominent role science-fiction has played in science and space exploration. For more on his work, check out his video documentary called 933: Part 1, 2, 3.\nOther Side Update\n\nFirst hour guest, psychic medium James Van Praagh shared updates about his contact with the Other Side, and spirits. He characterized the afterlife or the Other Side as an expression of life that operates on a higher frequency or vibration. &quot;I do believe that we in the three-dimensional world are really just a small percentage of who we are,&quot; he said, explaining that as soul beings we exist on many levels; and the Other Side is actually our home, with the physical world serving as a school. Van Praagh also said he conducted a meditation about the tragic school shooting in Newton, and was informed by spirit that the slain children were very evolved souls.\nOpen Lines\n\nWith the end of the Mayan calendar rapidly approaching, George presented Open Lines in the latter half of the show, with a number of callers discussing doomsday scenarios and visions.\n\nNews segment guests: Alex Jones, Craig Smith\nWebsite(s):\n\n    VanPraagh.com\n\nBook(s):\n\n    The ETi Grail\n    Growing Up in Heaven\n\n","torrent":{"xt":"urn:btih:2726f363e6808f5c6e1277928e873c5dd1263a65","amp;dn":"Coast+to+Coast+AM+December+19+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2726f363e6808f5c6e1277928e873c5dd1263a65","infoHashBuffer":{"type":"Buffer","data":[39,38,243,99,230,128,143,92,110,18,119,146,142,135,60,93,209,38,58,101]},"announce":[],"urlList":[]}}