{"title":"DEA Microgram Bulletin Monthly PDF Database","uid":10013507,"size":122781122,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:275bef36f90355cbd428d1857d9976dfd0b08d05&amp;dn=DEA+Microgram+Bulletin+Monthly+PDF+Database&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"lelijk","files":1,"time":1398125964,"description":"An awesome catalog of many years of US Drug Enforcement Administration's monthly bulletins and warnings to many law enforcement officials throughout the US and abroad, most of the instances reported in each bulletin are the result of Customs and Immigration, State, City or Local Police, and in a few situations Border Patrol and what would now be known as Homeland Security (TSA) seizures, merely collected and entered into the Federal Governments criminal databases shared nationwide with LEOs. Some are hilarious, some are ingenious, some are scary, and some still work to this day. But the best techniques have never been caught and are not listed but they are out there still. Trunk full of psychedelic mushrooms with fans and ice packs is a personal favorite, as well as the Kansas Missile Silo LSD Factory (which doesn't mention the snitch-ery that occurs in the field report).Read em all and try and learn something, you can't ship heroin in hollowed out kidney beans or cocaine woven into baskets sent to JFK International Airport, you will get caught. But you will also know through reading this what does not work. Enjoy they shut the bulletin down a few years back, i assume because the only people who it was helping were the people they were trying to get and destroy. Figured a collection of all the works was in order.  No risk of bad files or viral issues, for this pack is nothing but pdfs directly downloaded from the original sites a few years back. Scan if you are worried.\n\nRise and Overcome\n&quot;420*710&quot;","torrent":{"xt":"urn:btih:275bef36f90355cbd428d1857d9976dfd0b08d05","amp;dn":"DEA+Microgram+Bulletin+Monthly+PDF+Database","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"275bef36f90355cbd428d1857d9976dfd0b08d05","infoHashBuffer":{"type":"Buffer","data":[39,91,239,54,249,3,85,203,212,40,209,133,125,153,118,223,208,176,141,5]},"announce":[],"urlList":[]}}