{"title":"Psi-Ops The Mindgate Conspiracy","uid":10674499,"size":2346794642,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:27f5b7431a857f06f656f83b0caf83796b30cd06&amp;dn=Psi-Ops+The+Mindgate+Conspiracy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ObiVan25","files":21,"time":1406922969,"description":"When the story begins, Nick Scryer has no memory of who he is, his mind having been wiped in order to infiltrate a terrorist organization known as The Movement. After being imprisoned, the player is released by Sara and given a drug to regain his memory and lost abilities. It begins with the game's most prominent power, telekinesis, and moves from there.\n\nNick also faces off against a plethora of former PSI-Operatives, all of whom have defected with the general that formerly led the PSI-Ops project. Each is specialized in a certain field of psychic ability (the first boss, for example, is an expert in mind control) and far more powerful in that field than Nick. Nick defeats them one by one; usually through creative combinations of his weaker but more varied psychic abilities.\n\nAs Nick moves his way through the organization, he learns of mysterious, psi-based objects that have been the focus of wars over the last century (a cutscene suggests these artifacts are in fact the causes of wars such as World War II). At the same time, he begins noticing strange behavior in Sara, who seems to rotate between friend and foe for no apparent reason. It is eventually discovered that Sara in fact has a twin, who is killed by Sara near the end of the game.\n\nAs the game comes to an end, the many artifacts are combined into a single device, which when combined with a special machine give the user nearly limitless psychic power. Nick regains his full memory while attempting to stop this. The general uses this device on himself, and is summarily defeated by Nick. Though his defeat is the same regardless of how the player goes about doing it, the point of the battle is to absorb some of the immense psychic power before the general, giving Nick a special weapon to use and a much better chance of defeating the general than if he had missed the opportunity to do so.\n\nAfter the general is defeated, the device is broken back into its component artifacts, and two helicopter gunships promptly appear to recover them, not concerned with the lives of Nick or Sara. In the game's final cutscene, Nick crashes one of the helicopters with telekinesis\n\nMinimum System Requirements:\t\nCPU:\tPentium III 1.0 GHz\nRAM:128 MB\nVGA:\t32 MB DirectX 8.0 compliant\nDX:\tDirectX 8.0\nOS:Windows 98SE/ME/2000/XP\nHDD:2GB\n\n\nThis is a repack\n\nHow to install:\n-run installer\n-choose the install directory \n-unceck the direct x and visualcc intall(you can install manualy from redist folder in case that the game whont start)\n-play the game\nIf you like it,seed it\nHappy gaming","torrent":{"xt":"urn:btih:27f5b7431a857f06f656f83b0caf83796b30cd06","amp;dn":"Psi-Ops+The+Mindgate+Conspiracy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27f5b7431a857f06f656f83b0caf83796b30cd06","infoHashBuffer":{"type":"Buffer","data":[39,245,183,67,26,133,127,6,246,86,248,59,12,175,131,121,107,48,205,6]},"announce":[],"urlList":[]}}