{"title":"AG Drive v 1.3.4 IPhone IOS.ipa","uid":11720260,"size":307693351,"categoryP":"games","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:284c3a11841e7fc5688f6d1b728827308e5bd3cf&amp;dn=AG+Drive+v+1.3.4+IPhone+IOS.ipa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"zxfghfg","files":1,"time":1424786614,"description":"THE FUTURE IS NOW\nThe boldest futuristic racer ever made is here!\n\nAn epic vision of the future, AG Drive takes you on the ride of your life as you drive blazing fast anti-gravity race craft and race against opponents on spectacular tracks that dive over and under an Earth city of the future.\n\nTECHNOLOGY\nThe world of AG Drive is real and full of life - witness huge futuristic highway systems come to life, with air traffic filling the skies as spaceships land and take off, and spotlights sweep the skies. The stunning, unparalleled visuals of the world of AG Drive were possible to be realized only because of the ZORG 3D engine.\n\nSOUNDTRACK\nThe game's mind-blowing original soundtrack is something never done before - an unprecedented collaboration between some of the biggest, most talented musicians spearheaded by none other than Ari Pulkkinen (&quot;Aritunes&quot; - soundtracks for Angry Birds, Resogun, Trine 1 &amp; 2, Outland, etc.).\n\nFEATURES\n- Main Events and Quick Events: Play AG Drive as you wish - Quick or Big!\n- Enjoy different modes of play such as Single Race, Time Trial, Elimination, Cup, Speed Record, Duel, etc.\n- Multiple tracks with different settings: sunny, sunset, night, etc.\n- Ships with different skills - can you master them all!\n\nEND NOTE\nBorn out of love for games like Wipeout and F-Zero, AG Drive has been a long time in the making, and is now ready to show you the future. AG Drive is a showcase to the world for what can be achieved when you combine true vision and passion with cutting-edge technological prowess.\n\n&quot;The best way to predict the future is to create it.&quot;\n- Peter F. Drucker\n\n--------------------\n\nLink to the App Preview Video on YouTube:\n\n--------------------\n\nPlease note that due to the very graphical nature of this game its performance on iPhone 4 may be severely reduced. We do not currently recommend you purchase AG Drive if you are using iPhone 4 only. We are working on performance improving optimization","torrent":{"xt":"urn:btih:284c3a11841e7fc5688f6d1b728827308e5bd3cf","amp;dn":"AG+Drive+v+1.3.4+IPhone+IOS.ipa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"284c3a11841e7fc5688f6d1b728827308e5bd3cf","infoHashBuffer":{"type":"Buffer","data":[40,76,58,17,132,30,127,197,104,143,109,27,114,136,39,48,142,91,211,207]},"announce":[],"urlList":[]}}