{"title":"Thurman - Lux [1995]","uid":9481792,"size":354963060,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:28b6d1b8e5310671ddb0d57db1f550dee637027d&amp;dn=Thurman+-+Lux+%5B1995%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1389811065,"description":"Thurman were an English rock band heralding from Oxfordshire comprising brothers Nicholas Kenny, (Lead Vocals + Guitar) Simon Kenny (Bass + Additional vocals) plus Paul Disley (Drums). Heavily associated with the Britpop movement, rumors circulated at the time that they had originally been called '2 Die 4' -- a heavy metal band that saw heavy rotation on MTV and American rock radio with their one hit wonder &quot;You Got What It Takes&quot; in the early 1990s with Andy Shaw on vocals. After Shaw's departure, they changed their name and music style as to be snapped up by a record label in the wake of the success of Blur and the mid-'90s UK music resurgence. Thurman's chirpy '60s-influenced retro sound was similar to one produced by a number of artists in 1995 at the height of Britpop mania.\nTheir sole album 'Lux' was derided by some critics who found it lacking in depth and derided its near-plagiarism of a number of songs, most noticeably 'Children of the Revolution' by T-Rex on the track 'Loaded.' Despite some positive reviews at the time, Thurman's time in the spotlight was limited, along with numerous other minor league bands associated with Britpop, such as Salad and Powder.\nFollowing Thurman's demise, the Kenny brothers went on to form a Neil Young/Byrds/Dylan-influenced band called The Four Storeys along with drummer Dan Goddard (ex-Nubiles). Following a single release of a track entitled 'Castaway' in 1999 the band released an album entitled 'Betting On Now' in 2002, receiving critical acclaim from Steve Lamacq and the NME. Nicholas and Simon Kenny went on to form a new group called 'The Long Insiders', still with Dan Goddard on drums, and with vocalist Sarah Dodd.","torrent":{"xt":"urn:btih:28b6d1b8e5310671ddb0d57db1f550dee637027d","amp;dn":"Thurman+-+Lux+%5B1995%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28b6d1b8e5310671ddb0d57db1f550dee637027d","infoHashBuffer":{"type":"Buffer","data":[40,182,209,184,229,49,6,113,221,176,213,125,177,245,80,222,230,55,2,125]},"announce":[],"urlList":[]}}