{"title":"EnigmaT Set Rips { Cuts } - January 4th, 2014","uid":9435204,"size":717149600,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:28e58815a2a10deeb8e2b40c9bc6f042b765a752&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+January+4th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":85,"time":1388889529,"description":"4 eYe - Oh My (Cut From Knowles Set)-enTc.mp3\nA.L.A.M.I - The Other Side (Original Mix) (Cut From Sty Set)-enTc.mp3\nAd Brown With Shawn Mitiska - Pulse (Den Rize Pres Rizen Remix) (Set Rip)-enTc.mp3\nAirsoul - Rio (Cut From Knowles Set)-enTc.mp3\nAirsoul - Year (Cut From Knowles Set)-enTc.mp3\nAlex Blest - Fragments Of Bliss (Silica Remix) (Cut From Lazarus Set)-enTc.mp3\nAllen &amp; Envy &amp; Julie Harrington - Always (Adam Deane Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nAllen &amp; Envy - Forever Lost (Stereo Wildlife Remix) (Cut From KvA Set)-enTc.mp3\nAllen Watts - Fallen (Cut From Lazarus Set)-enTc.mp3\nAndy Bianchini - Marbella (Cut From Knowles Set)-enTc.mp3\nArisen Flame - Orion (ASOT 646 Rip)-enTc.mp3\nAzotti - The Miracle (AWERS Remix) (Cut From KvA Set)-enTc.mp3\nBeat Factory - Big City Sirens (Andre Sobota Remix) (Cut From Oakenfold Set)-enTc.mp3\nBeatsole - Do Not Give Up! (Intro Mix) (Cut From Sty Set)-enTc.mp3\nBT &amp; Jes - Every Other Way (LyonHart Remix) (Cut From Bobina Set)-enTc.mp3\nDaniel Wanrooy feat. Jordan Kaahn - Nothing To Lose (Paul Vinitsky Remix) (Cut From Masoud Set)-enTc.mp3\nDarren Summers - Play Dirty (Original Mix) (Cut From GO Set)-enTc.mp3\nDean Zone vs The Sixth Sense - A Star Within (Cut From Lynam Set)-enTc.mp3\nDefcon Allstars - Lost In Haamiah (Cut From Lazarus Set)-enTc.mp3\nDigital Basement - Ultraviolet (Uplifting Mix) (Cut From Trance Empire Set)-enTc.mp3\nDimensions &amp; Ulitimate - Corazon (Original Mix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nDirt Devils - The Drill (MaRLo Bootleg) (ASOT 646 Rip)-enTc.mp3\nDJ T.H. feat. Alisha Nauth - Make You Better (Ledo Dub Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nE.T Project - The Other Side (Matt Chowski Remix) (Cut From Chou Set)-enTc.mp3\nEDU - Action Hero (Cut From KvA Set)-enTc.mp3\nEmme - Neon (Cut From Knowles Set)-enTc.mp3\nEximinds - Phoenix (ASOT 646 Rip)-enTc.mp3\nFederation - Be There (Original Mix) (-Short- Cut From Oakenfold Set)-enTc.mp3\nFred Baker And Firebird - Bipolar (Cut From GO Set)-enTc.mp3\nFunction C pres. Keelin Temple - Sabotage (Cut From Lazarus Set)-enTc.mp3\nGabriel &amp; Dresden - Rise Up (Cut From G&amp;D Set)-enTc.mp3\nGarrido &amp; Hanski - Till We Fall (Falcon Mix) (Cut From Palagano Set)-enTc.mp3\nGarrido &amp; Hanski feat Erin - Till We Fall (A.M.R Remix) (Cut From Knowles Set)-enTc.mp3\nHysteria - Drown (Marat Schact Dub Mix) (Cut From Oakenfold Set)-enTc.mp3\nID &amp; N&amp;R Project - Flying Bird (Mr Carefull Remix) (Cut From Lazarus Set)-enTc.mp3\nInner Peace - Ataraxia (Manual Rocca Remix) (Cut From Palagano Set)-enTc.mp3\nJesper Olesen &amp; Rich Triphonic - Reflective Love (James Williams Remix) (Cut From Elyse Set)-enTc.mp3\nJesse Suun - Velvety (Cut From KvA Set)-enTc.mp3\nJimmy Chou - Madison (Original Mix) (Cut From Chou Set)-enTc.mp3\nJonas Hornblad - Wasted Moments (Cut From Palagano Set)-enTc.mp3\nKatrin Souza And Flipplive - Moon Lane (Witness 45 Remix) (Cut From GO Set)-enTc.mp3\nKevin Crowley - The Descent (Cut From Lazarus Set)-enTc.mp3\nKyau &amp; Albert - At Any Time (Togglehead Remix) (Cut From KvA Set)-enTc.mp3\nKyau &amp; Albert with Stoneface &amp; Terminal - We Own The Night (Azotti Remix) (Cut From Oakenfold Set)-enTc.mp3\nKyau &amp; Albert with Stoneface &amp; Terminal - We Own The Night (Mino Safy Remix) (Cut From KvA Set)-enTc.mp3\nLuke Bond Feat. Roxanne Emery - On Fire (ASOT 646 Rip)-enTc.mp3\nLuke Bond Feat. Roxanne Emery - On Fire (Club Mix) (Set Rip)-enTc.mp3\nManufactured Superstars feat. Danni Rouge - Like Satellites (Dj Exodus, Stephano &amp; Torio Remix) (Cut From Shah Set)-enTc.mp3\nMarc Simz - Move On (Cut From Gielen Set)-enTc.mp3\nMarco V - Back In The Jungle (Cut From Gielen Set)-enTc.mp3\nMatt Bowdidge - My Reflection (Johan Ekman Remix) (Cut From Robbie Van Set)-enTc.mp3\nMatt Fax - Barr (Andre Sobota Remix) (Cut From Tydi Set)-enTc.mp3\nMatt Holliday - Horizon (Original Mix) (Cut From GO Set)-enTc.mp3\nMatt Holliday - iTurn2U (Cut From KvA Set)-enTc.mp3\nMax Graham vs Maarten De Jong - Lekker (ASOT 646 Rip)-enTc.mp3\nMictrotrauma - Cortex (Cut From G&amp;D Set)-enTc.mp3\nMictrotrauma - Reflections (Cut From G&amp;D Set)-enTc.mp3\nMika Olson - Redeem (Cut From Slang Set)-enTc.mp3\nMisja Helsloot feat. Shannon Hurley - Voice In The Crowd (Original Mix) (Cut From Lazarus Set)-enTc.mp3\nMixail - A New Love (Cut From KvA Set)-enTc.mp3\nMonoverse - Aer (Dave Horne Remix) (Cut From Knowles Set)-enTc.mp3\nMyk Bee - Point Of Pleasure (Cut From Palagano Set)-enTc.mp3\nNoizy Boy - Your Call (Cut From Lynam Set)-enTc.mp3\nPaul Rigel - Hannover (Cut From Palagano Set)-enTc.mp3\nPaul van Dyk - For An Angel (Touchstone &amp; Cliffy Burrows presents Oxygen Remix) (Cut From ReeVe Set)-enTc.mp3\nPush - Strange World (Styller Remix) (Cut From Styller Set)-enTc.mp3\nRush West feat. Meron Ryan - Sweet Escape (Cut From KvA Set)-enTc.mp3\nSimon O'Shine - Anya (Amos Remix) (Cut From Lazarus Set)-enTc.mp3\nSnow Patrol - Open Your Eyes (Steve Brian &amp; Oudai Abdulhadi Bootleg) (Cut From KvA Set)-enTc.mp3\nSnow Patrol - Open Your Eyes (Steve Brian &amp; Oudai Abdulihali Bootleg) (Cut From Tydi Set)-enTc.mp3\nStuart Miller - Remember Who You Are (Cut From Trance Empire Set)-enTc.mp3\nSunset - Mumbai (Cut From Palagano Set)-enTc.mp3\nSvenson - Sunlight Theory (Richard Durand Rework) (ASOT 646 Rip)-enTc.mp3\nSwitchfoot - Who We Are (Dave Winnel Remix) (Cut From KvA Set)-enTc.mp3\nTangle - Sirius (Cut From Knowles Set)-enTc.mp3\nTaras Bazeev - Protect The Planet (Cut From Evva Set)-enTc.mp3\nTasso - Sunscar (Paul Denton Remix) (Cut From Lazarus Set)-enTc.mp3\nTim Lighterz - Taliana (John Sunlight Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nTim Lighterz - Taliana (John Sunlight Remix) (Cut From Trance Empire Set)-enTc.mp3\nTom8 - Amplify (Cut From Palagano Set)-enTc.mp3\nUltraviolence - The Way (Nish Dubstek Remix) (Cut From TyPhone Set)-enTc.mp3\nVlad Vandyshev - Orion (Cut From Knowles Set)-enTc.mp3\nWankelmut &amp; Emme Louise - My Head is Jungle (Extended Mix) (Cut From Oakenfold Set)-enTc.mp3\nYoung Parisians feat. Ben Lost - Jump The Next Train (Kyau &amp; 10 Albert 2014 Remake) (Cut From KvA Set)-enTc.mp3\nZahir - Remember Me (Hoyaa Remix) (Cut From GO Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:28e58815a2a10deeb8e2b40c9bc6f042b765a752","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+January+4th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28e58815a2a10deeb8e2b40c9bc6f042b765a752","infoHashBuffer":{"type":"Buffer","data":[40,229,136,21,162,161,13,238,184,226,180,12,155,198,240,66,183,101,167,82]},"announce":[],"urlList":[]}}