{"title":"Trap Them - Filth Rations (EP) 320k  MP3  ak2010","uid":10646340,"size":25487942,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:29669b7c7463bc8fa41ce6075952e19a451c3cd1&amp;dn=Trap+Them+-+Filth+Rations+%28EP%29+320k++MP3++ak2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":5,"time":1406508364,"description":"Trap Them - Filth Rations (EP) 320k  MP3  ak2011 What we got...Trap Them began as a side-project for Ryan McKenney (former vocalist of Backstabbers Incorporated) and Brian Izzi (guitarist of December Wolves) in 2001 while Izzi was beginning his stint as second guitarist for Backstabbers Inc. The two met while working together at Newbury Comics in Salem, NH and immediately became close friends. The band grew into a full-time consideration years later after both men left BSI to focus on other things. McKenney and Izzi later became roommates and began focusing on new material for the band.\n\nIn 2006, the band reached an agreement with the Trash Art! record label to release a vinyl-only EP and a full-length album to be recorded with Kurt Ballou at the God City recording studio and released later that year. The resulting album and single, including a spoken word piece by McKenney, were released in January and April 2007. In late 2007, Trap Them signed with Converge's Jacob Bannon's music label, Deathwish Inc.. They toured Europe in early 2008 with The Ocean and Rotten Sound.\n\nTrap Them worked with crust punk band Extreme Noise Terror for a split EP and toured the U.S. with Napalm Death. A new full-length album, Seizures in Barren Praise, was released in November 2008. In May 2009, the band played on the years bill for the annual Maryland Deathfest music festival in Baltimore, Maryland. The band on went of US tours with Victims and Black Breath in May and June 2009, and Skeletonwitch and Saviours in mid-July.\n\nIn 2010 the band released the EP Filth Rations, initially only as a strictly limited cassette release restricted to just fifty copies available at their appearance at the Scion Rock Festival. The EP was later released on Southern Lord Records on 12&quot; vinyl featuring an etching on the B-side by artist Justin Bartlett, who also drew the main cover.\n\nIn late 2010, it was announced that in March 2011 the band would release their third full-length Darker Handcraft through Prosthetic Records - their first for the label since signing for them in mid-2009. In April 2011 the band will also embark on a European tour to promote the album as main support for the Finnish grindcore band Rotten Sound.\n\nOn April 7, 2014, the band announced that they had completed work on their newest album, titled &quot;Blissfucker&quot;, which is set to be released on June 10, 2014. It is the first album to feature their new bassist, Galen Baudhuin (Infera Bruo), and drummer Brad Fickeisen (No Salvation, ex-The Red Chord).","torrent":{"xt":"urn:btih:29669b7c7463bc8fa41ce6075952e19a451c3cd1","amp;dn":"Trap+Them+-+Filth+Rations+%28EP%29+320k++MP3++ak2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29669b7c7463bc8fa41ce6075952e19a451c3cd1","infoHashBuffer":{"type":"Buffer","data":[41,102,155,124,116,99,188,143,164,28,230,7,89,82,225,154,69,28,60,209]},"announce":[],"urlList":[]}}