{"title":"Democracy Now - 02 feb 2012","uid":7006272,"size":456534422,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:297089dc6219086d440e84ffdd65009051268561&amp;dn=Democracy+Now+-+02+feb+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1328281380,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 02, 2012\n\n- Panetta: U.S. to End Afghan Combat Operations in 2013\n- Romney: &quot;I'm Not Concerned About the Very Poor&quot;\n- Trump to Endorse Gingrich Ahead of Nevada Vote\n- Thousands Protest as Indiana Enacts Anti-Union &quot;Right to Work&quot; Law\n- Washington State Senate OKs Same-Sex Marriage\n- Dozens Killed in Syria Clashes; Russia Stalls U.N. Measure\n- Julian Assange in Final Day of Extradition Hearing\n- U.S. Lifts Military Aid Ban to Uzbekistan\n- ACLU Sues Admin for Drone Strike Records\n- NRC: Nuclear Reactors in Central and Eastern U.S. Face Earthquake Threats\n\n\nSpecial reports\n\n- &quot;Gasland&quot; Director Josh Fox Arrested at Congressional Hearing on Natural Gas Fracking\n\nThe Academy Award-nominated filmmaker Josh Fox was handcuffed and arrested Wednesday as he attempted to film a congressional hearing on the controversial natural gas drilling technique known as fracking, which the Environmental Protection Agency recently reported caused water contamination in Pavillion, Wyoming. Fox directed the award-winning film, &quot;Gasland,&quot; which documents the impact of fracking on communities across the United States, and is now working on a sequel. Fox says he was arrested after Republicans refused to allow him to film because he did not have the proper credentials. &quot;We wanted to report on what happened [at the hearing]. I was not interested in disrupting that hearing. It was not a protest action,&quot; says Fox. &quot;I was simply trying to do my job as a journalist and go in there and show to the American people what was transpiring in that hearing, so that down the line, as we know there will be a lot of challenges mounted to that [Pavillion, Wyoming] EPA report-and frankly, to the people in Pavillion, who have been sticking up for themselves and demanding an investigation into the groundwater contamination-and to make sure that people could view that in a larger forum than usually happens.&quot;\n\n\n- Obama's Support for Natural Gas Drilling &quot;A Painful Moment&quot; for Communities Exposed to Fracking\n\nLast week, President Obama called the United States &quot;the Saudi Arabia of natural gas&quot; in a speech about boosting domestic energy production. That concerns Wyoming farmer John Fenton, who already has more than two dozen gas wells on his property. The Environmental Protection Agency ruled in December that water contamination in Pavillion, Wyoming, was a result natural gas extraction and the controversial technique known as fracking. &quot;Things changed pretty rapidly,&quot; Fenton says, after fracking took place on his land near Pavillion, and he now has to ship in water for drinking. &quot;It didn't take long to notice a significant impacts to the water, the change to smell like diesel fuel, methane was bubbling in the water. We had neighbors that actually had livestock die from drinking the water and we also saw really huge impacts to our way of life. The farm fields are full of wellheads now that we have to work around. We have people coming and going off our property 24 hours a day, and we've seen over a 50 percent devaluation in the value of our land.&quot; We also speak with filmmaker Josh Fox, who was arrested for attempting to recording a congressional hearing over the EPA report on Pavillion. Fox is producing a sequel to his award-winning film, &quot;Gasland,&quot; about the impact of fracking across the United States.\n\n\n- After Right-Wing Campaign, Leading Breast Cancer Charity Komen Drops Funding for Planned Parenthood\n\nThe nation's leading breast cancer charity is under intense scrutiny for its decision to cut-off funding for breast cancer screening programs run by Planned Parenthood. The Susan G. Komen for the Cure has confirmed it is withdrawing support for 19 of Planned Parenthood's 83 affiliates, citing a new policy barring funding for any groups under investigation by local, state or federal authorities. Planned Parenthood's finances are currently the subject of a probe led by anti-abortion Republican Rep. Cliff Stearns of Florida. &quot;If you look at all the government reports which have already been done on planned Parenthood, they're completely cleared of any of the charges that Cliff Stearns claims he's looking for. So, this is a witch hunt,&quot; says Jodi Jacobson, is the editor-in-chief of RH Reality Check, who recently wrote the article, &quot;The Cancerous Politics and Ideology of the Susan G. Komen Foundation.&quot; We also speak with Patrick Hurd, the CEO of Planned Parenthood of Southeastern Virginia and a recipient of a 2010 grant from Komen, and his wife, Betsi Hurd, who has participated in several Komen fundraising races and is currently battling breast cancer. &quot;This isn't about fund raising,&quot; says Patrick Hurd. &quot;This is about making sure that we provide access to women, that we continue to provide education to women, that we continue to serve the women in communities where Planned Parenthoods are located.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\nn\n","torrent":{"xt":"urn:btih:297089dc6219086d440e84ffdd65009051268561","amp;dn":"Democracy+Now+-+02+feb+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"297089dc6219086d440e84ffdd65009051268561","infoHashBuffer":{"type":"Buffer","data":[41,112,137,220,98,25,8,109,68,14,132,255,221,101,0,144,81,38,133,97]},"announce":[],"urlList":[]}}