{"title":"A Limited Partnership by Robert J. Wineburg (2000) [PDF]","uid":10664260,"size":1114435,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a040672ac248593e1181217feb866a9470d7896&amp;dn=A+Limited+Partnership+by+Robert+J.+Wineburg+%282000%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"VikTSlick","files":-1,"time":1406775036,"description":"Title: A Limited Partnership - The Politics of Religion, Welfare, And Social Science \nAuthor: Robert J. Wineburg\nCategory: Academic/Religion/Politics\nPublisher: Columbia University Press (November 15, 2000)\nLanguage: English\nISBN-10: 0231120850\nISBN-13: 978-0231120852\n\nPromotional info/Publisher's summary - &quot;Ranging from the Reagan years to the present -- a crucial period in both social welfare policy development and the history of religious involvement in social services -- A Limited Partnership explores an important undercurrent in the new welfare policy. Robert Wineburg argues that the present policy, with its emphasis on services increasingly being delivered by the faith community, simply cannot work the way its architects envisioned. He calls for rationality in finding solutions to the complex problems of poverty and the division of responsibilities for helping those in need at the local level.\n\nUsing almost twenty years of data from Greensboro, North Carolina, as a long-term case study, the author examines how the budget cuts of the Reagan era, the Bush era, and the Clinton era altered the relationships among religious congregations and other agencies. The book presents a vivid picture of the chaos caused by these policy changes at the level of service delivery and clearly demonstrates that the religious community cannot be the sole provider of social services but instead must remain an important but limited partner with a special role in delivering social services.\n\nWineburg's study provides a fresh perspective on a policy debate that genuinely lacks understanding of how politics, religion, and a complicated web of social services operate at the community level.&quot;\n\nReviews:\n&quot;A timely book. To be commended for giving attention to a long neglected phenomenon. The book is worth reading and will hopefully stimulate additional research and writing which is greatly needed.&quot; -Dr. Lawrence Ressler Journal of Teaching in Social Work\n\n&quot;[This] book seeks to garner support for a 'limited partnership' between social work and religion that would counter government devolution... [it is] of interest to social workers and religious leaders in general for it provides past and future visions of collaboration.&quot; -Elizabeth King Keenan Religious Studies Review\n\nThis torrent contains a fully indexed, browse-able and searchable copy of the book in PDF format. The front cover image is also included. Please seed, and enjoy.\n","torrent":{"xt":"urn:btih:2a040672ac248593e1181217feb866a9470d7896","amp;dn":"A+Limited+Partnership+by+Robert+J.+Wineburg+%282000%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a040672ac248593e1181217feb866a9470d7896","infoHashBuffer":{"type":"Buffer","data":[42,4,6,114,172,36,133,147,225,24,18,23,254,184,102,169,71,13,120,150]},"announce":[],"urlList":[]}}