{"title":"Vasen - Keyed up  2004","uid":6788417,"size":397164486,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2a6ecda8b69e5ca1d9b75f59ea3f2d05e7ca442f&amp;dn=Vasen+-+Keyed+up++2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1320182349,"description":"Credit VÃƒÂ¤sen with the urge to keep their music fresh. This time around they entered the studio without much preparation, only brief rehearsals to familiarize themselves with the tunes, all originals for this outing. The arrangements they'd worked out were rudimentary at best. Instead, they chose to rely on spontaneity and an empathy built from years of playing to create an intricate sound. Recording live with just one or two takes for each tune, the group made a gamble that paid off in full. A single listen to a piece like Glada Polsken, is evidence that they're all musicians of great technique and inspiration, able to weave lines around each other as if it had all been carefully worked out to the last note. And there's a palpable joy for them in walking this knife edge. It's evident, too, that their compositions have taken on a new maturity, a kind of deep chamber folk sound that's complex but still engaging enough to make you want to kick up your heels. As you'd expect from the band, there are plenty of danceable polskas, like Flippen, with its fast-paced, filigreed lines. But there are also more meditative tunes, such as the delicate but lively Antons FÃƒÂ¶rsta, with its gorgeous melody. And the sense of humor that's always been a hallmark of the band is quite intact and firmly shown on Appalachen/Polskejig, where Sweden meets the Appalachians and everyone goes home a winner. There might be no real change of direction for VÃƒÂ¤sen, but this new, more spontaneous spirit brings a wonderful energy to the record that serves it beautifully.\n(Chris Nickson,\n\n- - -\n\nVÃƒÂ¤sen - Keyed up 2004\n(Minneapolis North Side)\n\n 1. BjÃƒÂ¶rkbergspolskan. \n 2. Glada polskan. \n 3. Polska pÃƒÂ¥ ÃƒÂ¶vervÃƒÂ¥ningen. \n 4. Hasse A's. \n 5. En gratis. \n 6. Antons fÃƒÂ¶rsta. \n 7. Lille Vilgot. \n 8. Bromanders 100-ÃƒÂ¥rs polska. \n 9. Stinas polska. \n10. Flippen. \n11. Appalachen, Polskejig. \n12. Fallandepolskan. \n13. Nipponpolka. \n14. Calles vals. \n15. Tomten kommer\n\n\nMikael Marin - viola, violin\nOlov Johansson - 3-radig kromatisk nyckelharpa, kontrabasharpa\nRoger Tallroth - 12-strÃƒÂ¤ngad gitarr, bosoki\n","torrent":{"xt":"urn:btih:2a6ecda8b69e5ca1d9b75f59ea3f2d05e7ca442f","amp;dn":"Vasen+-+Keyed+up++2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a6ecda8b69e5ca1d9b75f59ea3f2d05e7ca442f","infoHashBuffer":{"type":"Buffer","data":[42,110,205,168,182,158,92,161,217,183,95,89,234,63,45,5,231,202,68,47]},"announce":[],"urlList":[]}}