{"title":"Fredrik Reinfeldt - Halvvägs - Svensk","uid":13863490,"size":436362059,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2ab157cda43020ff91fb9defd6238be6805b56c2&amp;dn=Fredrik+Reinfeldt+-+Halvv%26auml%3Bgs+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"totomas1","files":69,"time":1458050096,"description":"Fredrik Reinfeldt - Halvvägs\r\n\r\n&quot;Den 17 september 2006. Jag sitter ensam med två tal framför mig. Valrörelsen är över, vallokalerna har stängt och runt om i landet räknas röster. Det är jämnt. Hela mitt politiska liv passerar för mitt inre. Alla mina drömmar och alla mina planer, men också vetskapen om att allt är minuter från att förändras.\r\nHalvvägs är min berättelse om hur jag hamnade här och vad som hände därefter.&quot;\r\n\r\nHur blir man statsminister? Från elevrådet till Rosenbad, från MUF till Bryssel – Halvvägs är Fredrik Reinfeldts egen berättelse om tjugofem år i svensk och internationell politik.\r\n\r\nReinfeldt skriver om en ung samhällsintresserad man som strax efter sin 40-årsdag blev Sveriges statsminister. Han skildrar sin uppväxt i förorter till Stockholm och sin väg in i politiken.\r\nHan beskriver konflikterna i ungdomsförbundet och tiden ute i kylan, hur han tillsammans med Anders Borg ändrade sitt partis politik och lade grunden för Nya Moderaterna, och hur han därefter tog initiativ till Alliansen.\r\nFredrik Reinfeldt vann två val och var statsminister i åtta år, och under hans tid uppmärksammades Sverige internationellt för sitt höga reformtempo och för regeringens sätt att hantera den svåra finanskrisen.\r\n\r\nHan berättar här om tiden som toppolitiker både i Sverige och i världen, om människor han mött och arbetat med, om makt och svåra avgöranden, men boken ger också unik insyn i hur vardagen kan se ut för en svensk statsminister.\r\n\r\nFredrik Reinfeldt var Sveriges statsminister under två mandatperioder och skaparen av Nya Moderaterna. Han var partiordförande i elva år och har varit aktiv i svensk och internationell politik i över ett kvarts sekel. Nu, precis efter att han fyllt femtio, skriver han om sina år i politiken.\r\n\r\n\r\nAntal CD: 12 CD\r\nUppläsare: Fredrik Reinfeldt\r\nSpeltid: 15 timmar","torrent":{"xt":"urn:btih:2ab157cda43020ff91fb9defd6238be6805b56c2","amp;dn":"Fredrik+Reinfeldt+-+Halvv%26auml%3Bgs+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ab157cda43020ff91fb9defd6238be6805b56c2","infoHashBuffer":{"type":"Buffer","data":[42,177,87,205,164,48,32,255,145,251,157,239,214,35,139,230,128,91,86,194]},"announce":[],"urlList":[]}}