{"title":"Chronus PRO - Home and Lock Widget v4.3.2 [Paid] [APK]","uid":10031677,"size":6368596,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:2afe09b23075f1c2acd26d2a2b1b1e577159f6dc&amp;dn=Chronus+PRO+-+Home+and+Lock+Widget+v4.3.2+%5BPaid%5D+%5BAPK%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AtomTPB","files":4,"time":1398350301,"description":"Description:\nChronus, an elegant Home &amp; Lock screen Clock, Weather, News feed and Calendar widget.\nFunctionally similar to its older brother the CyanogenMod cLock widget and brought to you by the same developers, this independently released, stand-alone widget takes back its original name - Chronus - and brings the same elegant look and feel, enhanced with many new features and improvements, to the broader Android community.\nAs a flexible &quot;Information&quot; widget, Chronus is highly optimized in terms of CPU and data usage with the potential of replacing several other info widgets. Multiple Chronus widgets on the same device share the same back-end services and updates are batched. This makes the system use less battery while still providing the user with rich information. You can choose to use one or all of the features, those not used are completely disabled, using no CPU, data or battery.\n\n\nFeatures:\nFeatures (Pro version)\n- Additional Widgets (Forecast, Calendar, Clock+ (Forecast))\n- Custom Tap actions for Clock, Weather and Calendar to launch apps or activities\n- Change Clock and Weather panel alignment (Centred, Left or Right)\n- Select Analog clock style (Standard or Classic)\n- Month view Calendar style\n- Calendar colors\n- Set Widget backgrounds\n- Feedly News provider\n- Facebook News provider\n- Daydream screensaver\n- Status bar Weather notifications\n- with more features to be released every 3-4 weeks...\n\nFeatures (All versions):\nThe standard version is functionally equivalent to the CyanogenMod cLock widget with added support for older versions of Android.\n- Fully functional Flex, Flex (Analog), Clock+ and Weather Widgets\n- Supports adding as a widget to the Home screen (Android 4.1+) or Lock screen (Android 4.2+)\n- Customize the Clock look and feel (visible components, font normal/bold)\n- Weather panel with Yahoo!, Accuweather, OpenWeatherMap and yr.no weather providers\n- Minimized weather widget support (for the lock screen)\n- News Feed Panel and built-in RSS sources\n- Internal Article Reader\n- Calendar panel showing a scrollable list of upcoming events\n- Tapping event opens calendar at selected event\n- Taping calendar icon opens Calendar at today's date\n- Highlight upcoming calendar events with custom colors and font bolding\n- Change the font color of all text in all panels\n- Configure widget when adding or from the Chronus app in the app drawer\n- Backup and restore widget settings\n\n\nWhat's New:\n- NEW! Added the Change log (in About)\n- Fix notification text alignment on Android 4.1.x\n- Other small fixes\n\n\nRequired Android O/S : 4.1+","torrent":{"xt":"urn:btih:2afe09b23075f1c2acd26d2a2b1b1e577159f6dc","amp;dn":"Chronus+PRO+-+Home+and+Lock+Widget+v4.3.2+%5BPaid%5D+%5BAPK%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2afe09b23075f1c2acd26d2a2b1b1e577159f6dc","infoHashBuffer":{"type":"Buffer","data":[42,254,9,178,48,117,241,194,172,210,109,42,43,27,30,87,113,89,246,220]},"announce":[],"urlList":[]}}