{"title":"Committee of 300","uid":4591173,"size":853868,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ba42e406acc92e61a9e1fd4f1c23e2b74b8fe13&amp;dn=Committee+of+300&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Protocol22","files":2,"time":1229837202,"description":"In my career as a professional intelligence officer, I had many occasions to access highly classified documents, but during service as a political science officer in the field in Angola, West Africa, I had the opportunity to view a series of top secret classified documents which were unusually explicit. What I saw filled me with anger and resentment and launched me on a course from which I have not deviated, namely to uncover what power it is that controls and manages the British and United States governments.\n\n I was thoroughly familiar with all of the well known secret societies such \nas the Royal Institute for International Affairs (RIIA), the Council on Foreign Relations (CFR), the Bilderbergers, Trilaterals, the Zionists, Freemasonry, Bolshevism-Rosicrucianism and all of the spinoffs of these secret societies. As an intelligence officer, and even before that as a young student in the course of my studies at the British Museum in London, I had cut my eye teeth on all of them, plus a good number of others with whom I imagined Americans were familiar.  \nBut when I came to the United States in 1969, I found that names like the Order of St. John of Jerusalem, Club of Rome the German Marshall Fund, the Cini Foundation, the Round Table, the Fabianists, the Venetian Black Nobility, the Mont Pelerin Society, Hellfire Clubs, and many others were at best totally unknown here, or else their true functions were at best but poorly understood, if at all.  \nIn 1969-1970 I set about remedying the situation in a series of monographs and cassette tapes. Much to my surprise I soon found plenty of people willing to quote these names as if they had known of them all of their writing careers, but who were not in the least bit knowledgeable about the subjects, yet quite unwilling to state the source of their lately acquired information. I consoled myself with the thought that imitation is the sincerest form of flattery. I pursued my investigations, pressing on in the face of severe risks, \nattacks on myself and my wife, financial losses, continual harassment, threats and \ncalumny, all part of a carefully-crafted and orchestrated program to discredit me, run by government agents and informers, embedded in the so-called Christian rightwing, the &quot;Identity Movement&quot; and rightwing &quot;patriotic&quot; groups. These agents operated, and still operate, under cover of strong and fearless outspoken opposition to Judaism their main enemy, they would have us believe.  \nThese agent-informers are led and controlled by a group of homosexuals who are well-liked and well-respected by political and religious conservatives all across the United States. Their program of calumny, lies and hatred, disinformation about my work, even lately attributing it to other writers, contin-ues unabated but it has not had the desired effect. I shall carry on with my task until I have finally ripped off the mask of the entire secret upper-level parallel government that runs Britain and the U.S. This book is a part of that ongoing effort.  \n\n                              Dr. John Coleman, November 1991 ","torrent":{"xt":"urn:btih:2ba42e406acc92e61a9e1fd4f1c23e2b74b8fe13","amp;dn":"Committee+of+300","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ba42e406acc92e61a9e1fd4f1c23e2b74b8fe13","infoHashBuffer":{"type":"Buffer","data":[43,164,46,64,106,204,146,230,26,158,31,212,241,194,62,43,116,184,254,19]},"announce":[],"urlList":[]}}