{"title":"Sanctuary - Refuge Denied (1988) [EAC-FLAC]","uid":4195397,"size":274245012,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2cd2791ec2a8aa7852bbd092a107d9e2d86a775e&amp;dn=Sanctuary+-+Refuge+Denied+%281988%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sworduigi","files":6,"time":1211192139,"description":"Extractor: EAC 0.99 prebeta 4 \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD (silver CD)\nArtwork: Front and Back (Web Found).\n\n\nGeneral Info:\n\nTracklist:\n   1. &quot;Battle Angels&quot; (Sean Blosl, Dane) ? 4:30\n   2. &quot;Termination Force&quot; (Rutledge, Dane, Jim Sheppard) ? 3:49\n   3. &quot;Die for My Sins&quot; ? 3:37\n   4. &quot;Soldiers of Steel&quot; ? 5:24\n   5. &quot;Sanctuary&quot; ? 3:54\n   6. &quot;White Rabbit&quot; (Grace Slick) (Jefferson Airplane cover) ? 3:07\n   7. &quot;Ascension to Destiny&quot; ? 4:52\n   8. &quot;The Third War&quot; ? 3:47\n   9. &quot;Veil of Disguise&quot; ? 5:43\n\n\n\n              LINE UP:\n  * Warrel Dane ? vocals\n    * Lenny Rutledge ? guitar\n    * Sean Blosl ? guitar\n    * Jim Sheppard ? bass\n    * Dave Budbill ? drums\n\n    * Dave Mustaine ? Producer  and guitar solo on &quot;White Rabbit&quot;, backing vocals\n    * Engineered by Terry Date\n    * Cover art by Ed Repka\n\n\nReview taken from metalcrypt.com:\nSanctuary: The real starting point for band members from Nevermore, including Warrel Dane. First and foremost I have to say the following, because it needs to be cleared up for some retards: This band does not sound like Nevermore. Anyone who wants to claim otherwise can just eat my ass. The two bands share members yes, but that does not equate to the same style being played. The now defunct Sanctuary were a far superior outfit than Nevermore ever were or perhaps will be.\nNow that we have that cleared up, let&amp;#039;s move on to the album in question here. &quot;Refuge Denied&quot; was the debut for Dane and the crew and it is essentially a heavy metal album with some power and speed metal influences in there. Sanctuary played thunderous heavy metal with extremely high vocals (obvious Judas Priest influence here) that are by now overdone and next to obsolete in Dane&amp;#039;s vocals. Strictly from a technical point of view and not unbridled Nevermore fanboyism, Dane proved himself an outstanding singer during his work with Sanctuary and not the other way around. Shit, just check out the range in his voice on any number of tracks from this album. The guy&amp;#039;s voice doesn&amp;#039;t even tremble in the slightest bit no matter how long or how high the vocals go.\n&quot;Refuge Denied&quot; opens with the best and most popular Sanctuary track out there ? &quot;Battle Angels&quot; and what a song it is. Best riffs this band has ever come up with, awesome solo, falsetto vocals higher than you can possibly conceive, and excellent rhythm. This is a headbanger&amp;#039;s song. The rest of the tracks too are similar; actually, a little too similar but somewhat lacking that exceptional quality of the opener. And that may be one of the biggest gripes I have with this album ? the songs are just too damn similar to each other.\nAnyway? just for curiosity&amp;#039;s sake, if you want to find out the origins of where Nevermore came along from, get this album. If you just cannot get enough of the high range vocals (ala Halford) then this album is for you. But please, if you love Nevermore&amp;#039;s style of heavy metal, there is a good chance you will not enjoy this album, if not hate it, but I&amp;#039;m sure there are exceptions. ","torrent":{"xt":"urn:btih:2cd2791ec2a8aa7852bbd092a107d9e2d86a775e","amp;dn":"Sanctuary+-+Refuge+Denied+%281988%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cd2791ec2a8aa7852bbd092a107d9e2d86a775e","infoHashBuffer":{"type":"Buffer","data":[44,210,121,30,194,168,170,120,82,187,208,146,161,7,217,226,216,106,119,94]},"announce":[],"urlList":[]}}