{"title":"Computational Fluid Dynamics - T. J. Chung","uid":12166972,"size":32074010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2dd8eebc6149455e7d4c8e286a051c18669c00a6&amp;dn=Computational+Fluid+Dynamics+-+T.+J.+Chung&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"clouderone","files":1,"time":1438063170,"description":"Computational Fluid Dynamics - T. J. Chung (Cambridge University Press, 2002).pdf\n\nISBN 0521594162\n\nComputational fluid dynamics (CFD) techniques are used to study and solve complex fluid flow and heat transfer problems. This comprehensive text ranges from elementary concepts for the beginner to state-of-the-art CFD for the practitioner. It discusses and illustrates the basic principles of finite difference (FD), finite element (FE), and finite volume (FV) methods, with step-by-step hand calculations. Chapters go on to examine structured and unstructured grids, adaptive methods, computing techniques, and parallel processing. Finally, the author describes a variety of practical applications to problems in turbulence, reacting flows and combustion, acoustics, combined mode radiative heat transfer, multiphase flows, electromagnetic fields, and relativistic astrophysical flows. Students and practitioners--particularly in mechanical, aerospace, chemical, and civil engineering--will use this authoritative text to learn about and apply numerical techniques to the solution of fluid dynamics problems","torrent":{"xt":"urn:btih:2dd8eebc6149455e7d4c8e286a051c18669c00a6","amp;dn":"Computational+Fluid+Dynamics+-+T.+J.+Chung","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dd8eebc6149455e7d4c8e286a051c18669c00a6","infoHashBuffer":{"type":"Buffer","data":[45,216,238,188,97,73,69,94,125,76,142,40,106,5,28,24,102,156,0,166]},"announce":[],"urlList":[]}}