{"title":"HISTORY OF POP AND ROCK MUSIC - part 468","uid":8144959,"size":478677934,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2f6c9546b364f80efa73375dc1891b035183a6e2&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+468&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pupovaczlatko","files":-1,"time":1360893149,"description":"\n\n\n                         PART  468          \n\n\n\n              GILLIAN WELCH &amp; ALISON KRAUSS  - I'll Fly Away  (2000)\n              SOGGY BOTTOMS BOYS - I Am A Man Of Constant Sorrow  (2000)\n              CHARM CITY DEVILS  -   Man Of Constant Sorrow  (2012)\n \n\n\n     &quot;I'll Fly Away&quot;, is a song written in 1929 by Albert E. Brumley and published in 1932 by the Hartford Music company in a collection titled &quot;Wonderful Message&quot;. Brumley's writing was influenced in part by an older secular ballad.   &quot;I'll Fly Away&quot; has been called the most recorded gospel song and it is frequently used in worship services by Baptists, Pentecostals, Nazarenes, the Churches of Christ and many Methodists. It appears in many hymnals where it is listed under the topics of eternal life, heaven and acceptance. It is a standard song at bluegrass jam sessions and is often performed at funerals.\n     One of the earliest recordings of &quot;I'll Fly Away&quot; was made by the Selah Jubilee Singers in February 1941 for Decca Records. The group was founded around 1927 by Thermon Ruth, a disc jockey at radio station WOR in Brooklyn New York.\n     There have been numerous recordings of &quot;I'll Fly Away&quot; since its inclusion in the 2000 film &quot;O Brother Where Art Thou?&quot;, although a vintage recording was used in the film itself, a contemporary recording by Alison Krauss and Gillian Welch was chosen for the &quot;O Brother, Where Art Thou?&quot; soundtrack. The spare recording, produced by T-Bone Burnett, features Welch on lead vocals with Krauss singing harmony. Their voices are accompanied by Mike Compton on mandolin and Chris Sharp on guitar. The soundtrack sold over eight million copies, reached the top position on at least four of Billboard's album charts, and was named Album of the Year and Best Soundtrack album at the 44th Grammy Awards in February 2002  \n\n    &quot;Man of Constant Sorrow&quot; (also known as &quot;I Am A Man of Constant Sorrow&quot;) is a traditional American folk song first recorded by Dick Burnett, a partially blind fiddler from Kentucky. The song was originally recorded by Burnett as &quot;Farewell Song&quot; . An early version was recorded by Emry Arthur in 1928 . Public interest in the song was renewed after the release of the 2000 film &quot;O Brother, Where Art Thou?&quot;, as it plays a central role in the film's plot. \n    &quot;Man of Constant Sorrow&quot; has five variations: two are used in the film, one in the music video, and two in the soundtrack. Two of the variations feature the verses being sung back-to-back, and the other three variations feature additional music between each verse. Though the song received little significant radio airplay, it reached #35 on the U.S. Billboard Hot Country Singles &amp; Tracks chart in 2002.\n    In 2012, the hard-rock band Charm City Devils released a video of their cover of the song, which debuted at #48 on the Billboard Rock Songs chart and peaked at #20 on Hot Mainstream Rock Tracks.","torrent":{"xt":"urn:btih:2f6c9546b364f80efa73375dc1891b035183a6e2","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+468","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f6c9546b364f80efa73375dc1891b035183a6e2","infoHashBuffer":{"type":"Buffer","data":[47,108,149,70,179,100,248,14,250,115,55,93,193,137,27,3,81,131,166,226]},"announce":[],"urlList":[]}}