{"title":"Jesus camp - Xvid.AC3 - Eng - Sub ITA - [TNT Village]","uid":5346884,"size":1565255795,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2fa9db2a4734d2443c7e9d85cc31b84dc817a264&amp;dn=Jesus+camp+-+Xvid.AC3+-+Eng+-+Sub+ITA+-+%5BTNT+Village%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DevilPrez","files":2,"time":1265667968,"description":"Jesus Camp is a 2006 American documentary film directed by Rachel Grady and Heidi Ewing about a Pentecostal/charismatic summer camp for children who spend their summers learning and practicing their &quot;prophetic gifts&quot; and being taught that they can &quot;take back America for Christ.&quot; According to the distributor, it &quot;doesn't come with any prepackaged point of view&quot; and tries to be &quot;an honest and impartial depiction of one faction of the evangelical Christian community&quot;.\n\nJesus Camp ÃƒÂ¨ un documentario del 2006 diretto da Rachel Grady e Heidi Ewing. Descrive il mondo dei cristiani evangelici piÃƒÂ¹ conservatori, gli stessi che hanno votato in massa Bush. Lo fa attraverso interviste ai personaggi che organizzano e partecipano ad un campo estivo &quot;biblico&quot;. La linea che separa questi campi estivi dall'indottrinamento ÃƒÂ¨ sottile e molti critici hanno rivolto a questi pastori accuse di molestie psicologiche. Al campo, Fischer (la Pastore) sottolinea la necessitÃƒÂ  per i bambini di essere purificati per diventare parte dell'&quot;esercito di Dio&quot; e crede fortemente che i bambini debbano essere in prima linea per far tornare l'America ai valori cristiani conservatori; pensa, inoltre, che i cristiani debbano concentrarsi nell'allenare i bambini poichÃƒÂ© &quot;il nemico&quot; allena i propri.\nQuesto film getta luce su una parte dell'america molto numerosa e poco conosciuta in Europa.\nSecondo il distributore del documentario, questo non fornisce alcun punto di vista &quot;preconfezionato&quot; e cerca di essere una onesta e imparziale descrizione di una parte della comunitÃƒÂ  Evangelica.\nIl 23 gennaio 2007, Jesus Camp ha ricevuto una nomination agli Oscar per la categoria &quot;Best Documentary Feature&quot;.\n\nEnjoy and Seed!!\t","torrent":{"xt":"urn:btih:2fa9db2a4734d2443c7e9d85cc31b84dc817a264","amp;dn":"Jesus+camp+-+Xvid.AC3+-+Eng+-+Sub+ITA+-+%5BTNT+Village%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fa9db2a4734d2443c7e9d85cc31b84dc817a264","infoHashBuffer":{"type":"Buffer","data":[47,169,219,42,71,52,210,68,60,126,157,133,204,49,184,77,200,23,162,100]},"announce":[],"urlList":[]}}