{"title":"Dave Evans - Discography (3 Albums)","uid":4582463,"size":266780391,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:31b533367652da1793ac24c49721a5386b132832&amp;dn=Dave+Evans+-+Discography+%283+Albums%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Tabljet","files":-1,"time":1229480888,"description":"Dave Evans:\n\nAlbums:\n\n1. Hell of a Night (2001) - [Tribute to the late singer Bon Scott]\n2. Sinner (2006)\n3. Judgement Day (2008)\n\n\nTracks:\n\nHell of a Night:\n\n01. - Can i Sit Next To You Girl\n02. - Rockin' In The Parlour\n03. - Rock'N'Roll Singer\n04. - Baby,Please Don't Go\n05. - Its A Long Way To The Top (If You Wanna Rock'N' Roll)\n06. - T.N.T\n07. - Ride On\n08. - Highway To Hell\n\nSinner:\n\n01 - Back On The Firing Line\n02 - Rock 'N' Roll Or Bust\n03 - Take Me Down Again\n04 - Only The Good Die Young\n05 - Sinner\n06 - Carnal Knowledge\n07 - Turn It Up\n08 - Out In The Cold\n09 - Go Down Fighting\n10 - Sold My Soul To Rock 'N' Roll\n11 - D.O.A.\n12 - The Thunder Down Under\n\nJudgement Day:\n\n01. - We Don't Dance To Your Song\n02. - Little Headbanger\n03. - Another Boy On The Street\n04. - You Talkin' To Me\n05. - Aint Gonna Do You To Me Anymore\n06. - Band Molls\n07. - Shoot On Sight\n08. - Helluva Night\n09. - Judgement Day\n10. - House Of The Rising Sun\n\nDave Evans originally arrived in Australia from Carmarthen Wales, aged five, and settled in North Queensland with his family. After forming his first band In Session in Charters Towers when he was seventeen he moved to Sydney where he formed a band (no name yet!) with Malcolm Young, Colin Burgess and Larry van Kriedt - a week later Malcolm's younger brother Angus joined. Malcolm and Angus' sister-in-law Sandra came up with the name AC/DC - to signify power and energy - and so one of the greatest rock and roll bands ever was born! AC/DC's first gig as at Chequers Nightclub in Sydney on New Years Eve 1973 and the band went on to attract a strong live ollowing in the next few months before recording their first single - Can I Sit Next To You Girl b/w Rocking In The Parlour.\n\nAt this time Angus started wearing his now famous schoolboy uniform (has he ever taken it off?!?!) and with their ingle racing up the national charts AC/DC undertook a grueling tour beginning at the Sydney Opera House and when playing to packed houses all around Australia. Life on the road is tough for any band and rictions and egos increased steadily until a punch-up between Evans and their manager made life on tour unbearable - and a split between Evans and AC/DC became inevitable. Bon Scott was a friend of Malcolm and Angus' elder brother George Young (a member of the legendary Easybeats - Friday On My Mind - and a well-known Australian record producer with Harry Vanda) and had seen the band perform in Adelaide.\n\nHe agreed to join AC/DC, by this stage one of the leading rock bands in Australia, and he and the band went on to rock and roll immortality as one of the biggest bands in the world. After parting ways with AC/DC Dave Evans moved to Newcastle just north of Sydney and joined up and coming hard rock outfit Rabbit in early 1975. Rabbit were already the number one rock band in Newcastle and the surrounding area and Dave had seen them performing at Chequers nightclub in Sydney and was pressed with their confronting stage presence. It wasn't long until they had signed with CBS records and recorded their first album &quot;Rabbit&quot; which had mediocre success. In 1976 they recorded the album &quot;Too Much Rock And Roll&quot; and with their appearances on the numerous television pop/rock shows this album launched them into national popularity. Rabbit were described as frenetic, violently hedonistic and Dave himself was described as savagely heterosexual. Rabbit after-show parties were always wild affairs and popular with friends, fans and groupies.\n\nThe &quot;Too Much ock And Roll&quot; album was then distributed in Japan, Germany, France, Luxembourg, Holland, Finland, Sweden, Norway and Denmark. Although sales were steady Rabbit did not tour these countries as two members called it quits after a grueling three month Australian tour. The band continued after adding a new drummer and released the single &quot;Let Me&quot; but it wasn't the same feeling without the two original members and the band folded in 1978. Dave vans and Thunder Down Under was formed in 1985 after his previous band, Dave Evans and Hot Cockerel, was forced o change its musical style.\n\nDave Evans and Hot Cockerel were a heavy two guitar rock act and the music was back to basics rock - which was Dave Evans's musical roots with AC/DC - but although the band played to packed houses hey could not get a record contract. At the time - mid 80's - the Australian record companies were signing bands dominated by synthesizers and with very little heavy guitar riffs and power chords. After being turned down again and again (with apologies!) despite the fact that the band was putting bums on seats, Dave decided to try a new pproach by combining the heavy guitar sounds with synth, brass and strings and adding a strong vocal harmony component.This worked and he signed with independent label Reaction Records. He recruited all new musicians and called the new band Dave Evans and Thunder Down Under. After Dave Evans and Thunder Down Under split Dave pursued an acting career with lead roles in small production Australian films - Coming of Age, Leonora and Come and Get It plus working in live theatre. In early 2000 Dave was invited to be a special guest for Melbourne AC/DC tribute band Thunderstruck for their 20th anniversary memorial gig for Bon Scott. This special occasion was recorded live and A Hell of a Night was released through Perris Records.\n\nOfficial Dave Evans web page: &lt;a href=&quot;\nhttp://www.daveevansrocks.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.daveevansrocks.com/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:31b533367652da1793ac24c49721a5386b132832","amp;dn":"Dave+Evans+-+Discography+%283+Albums%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31b533367652da1793ac24c49721a5386b132832","infoHashBuffer":{"type":"Buffer","data":[49,181,51,54,118,82,218,23,147,172,36,196,151,33,165,56,107,19,40,50]},"announce":[],"urlList":[]}}