{"title":"Diablo 2 + LOD blizzard installer and extras on private server","uid":6356546,"size":2036186397,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:32850fc87bcc5a09f60408142f26e7feef838b29&amp;dn=Diablo+2+%2B+LOD+blizzard+installer+and+extras+on+private+server&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Frezzno","files":9,"time":1304122420,"description":"Hello!\n\nIntro:\nJust bored and looking for some Diablo 2 friends for my private server and chat with foreigners in TS3. Who knows... You might get some new friends too from the other side of this globe.\n\nIn this torrents are all the files you need to play, alone or on my server both open and closed. Battle net installers to make it easy and fast plus 1.13c patch. Also a simple maphack and GLwrapper to enhance the graphics for newer GFXcards in windowed mode. Installation codes are provided.\n\nWhy my server?:\n+ No force of login within X days to keep your characters. Those will be there permanent, or until my server breakes down beyond repair.\n+ Apparently less laggy then original battle net.\n+ You are allowed (map)hacks. But some of us still enjoy this game natually, so keep your hacks for yourself and amongs those who don't mind.\n+ World event is easier to trigger.\n+ And some smaller competitions now and then with cool rewards.\n+ Own TS3 server for all the members and their friends to use. Login to the game to get the TS3 datas.\n+ As a bonus... I am a nice person.\n\nInstructions:\n1. Unpack and install D2.\n2. Unpack and install D2LoD.\n3. Apply 1.13c patch.\n4. Run the game once and make a test character in single player.\n5. Exit the game and execute D2LOD_Frez_server.reg.\n6. Run the game again but this time...\n7. Enter battle.net with Gateway: Frez room\n8. Make an account with an easy pass, I hate to restore lost passwords.\n9. Log in and welcome to my world... (My living room where my server is.)\n\nTo those of you who have D2Lod 1.13c already you can download the reg file and execute it and you'll be ready for my server.\nReg file [url=http://www.datafilehost.com/download-90ca8601.html]here[/url].\n\nThe D2GLwrapper have it's own instructions, but to those who don't know what it is: It's a software GFX driver. What it does for D2 is emulateing 3dfx which amazingly boosts the performance, with the option to run it in windows mode with full 3d and bilinaer filter scaleing. It means you can scale up more then what the game originally offer and it would still looks good or even better.\n\nThat's it. Come on in and have fun!\n\n/Frezzno\n\n&quot;Stay a while and listen&quot;, Deckard Cain.\n","torrent":{"xt":"urn:btih:32850fc87bcc5a09f60408142f26e7feef838b29","amp;dn":"Diablo+2+%2B+LOD+blizzard+installer+and+extras+on+private+server","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32850fc87bcc5a09f60408142f26e7feef838b29","infoHashBuffer":{"type":"Buffer","data":[50,133,15,200,123,204,90,9,246,4,8,20,47,38,231,254,239,131,139,41]},"announce":[],"urlList":[]}}