{"title":"Doctor Who Animated: Evil of the Daleks and more","uid":4589890,"size":721511582,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:33b0234ca39933b816802aa3f48597f32016134a&amp;dn=Doctor+Who+Animated%3A+Evil+of+the+Daleks+and+more&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"tygerbug","files":9,"time":1229788561,"description":"   A superb 19-minute collection of animated scenes from lost Doctor Who stories\nfrom the 1960s, starring William Hartnell and Patrick Troughton as the first and\nsecond Doctors.\n\n   Evil of the Daleks, The Smugglers, The Massacre, Galaxy 4, The Wheel in Space,\n Marco Polo, The Tenth Planet and more are featured.\n\n   As featured in The Guardian, SFX Magazine, and The Wired Blog.\n\n\n   For more information and to watch the animations, visit ocpmovie on Youtube.\n\n  Read our beginner's guide at:\norangecow.org/who-sprites2/1guide\n\n\n   This is in PAL DVD format.\n\n\n   A remarkable program from animator Garrett Gilchrist of Orange Cow Productions,\nthis is the WhoSprites project, a unique style of animation blending almost\nphotorealistic likenesses of the actors with the loose drawn style of traditional\npen and ink animation.\n\n  Unseen since their original broadcasts in the 1960s, there are 108 missing\nepisodes of Doctor Who, including some of the greatest stories the series ever\ncreated. Now with this unique style of animation, the WhoSprites project is\nattempting to bring these lost classics back to life for a new generation.\n\n   This is a not for profit project. Garrett was hoping to get hired by the\nofficial Doctor Who restoration team with this pilot project, but it didn't\nhappen. This was screened at a free-admission charity event put on by the\nKaleidoscope organization, on December 6th, 2008 - a different kind of Doctor\nWho Christmas special, if you will.\n\n   Garrett Gilchrist is the director of eight low budget feature films including\nShamelessly and Gods of Los Angeles. He's known as an animation scholar and\nrestorationist, who restored the lost animated classic The Thief and the Cobbler,\nand has been a guest animation speaker at Santa Monica City College and ASIFA\nSan Francisco. He lives in Southern California.\n\n   His company, Orange Cow Productions, is available for hire for all your\nanimation, film and graphic design needs.\n\n  Visit orangecow.org.","torrent":{"xt":"urn:btih:33b0234ca39933b816802aa3f48597f32016134a","amp;dn":"Doctor+Who+Animated%3A+Evil+of+the+Daleks+and+more","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33b0234ca39933b816802aa3f48597f32016134a","infoHashBuffer":{"type":"Buffer","data":[51,176,35,76,163,153,51,184,22,128,42,163,244,133,151,243,32,22,19,74]},"announce":[],"urlList":[]}}