{"title":"AllWebMenus.PRO.v5.1.766-MKDEV.TEAM","uid":4769857,"size":13117238,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:35a65e1d1b30d8fde68d5bb2fb96ed3252be392c&amp;dn=AllWebMenus.PRO.v5.1.766-MKDEV.TEAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ilefx","files":2,"time":1237002207,"description":"AllWebMenus.PRO.v5.1.766-MKDEV.TEAM\n\nextract from the rar \n\ncheck CRACK.MKDEV.TEAM folder\n\n\nSEED/ENJOY\n\n---------------------------------------------------------------------------------\n\n\nAllWebMenus Pro description   \n \n \nCreate a complex dhtml menu for your website, without having to write a single line of code\nAllWebMenus is a useful dhtml menu/javascript menu builder for web site navigation which requires absolutely no DHTML or Javascript experience.\n\nAllWebMenus creates any cross-browser, popup or drop-down menu that works alike in all browsers supporting DHTML (all Netscape Navigator and Internet Explorer versions of 4.0 and later, Opera and Mozilla included)\n\nDHTML/JavaScript menus are designed with a treelike approach. Users can tailor their menu by using the Properties Pane or by choosing a predefined appearance from the Style Gallery. \n\nThe menu can be either vertical or horizontal (pop-up or drop-down menu), it can be movable, stay visible while scrolling, contain static or animated images, borders, colors, and much more. \n\nOnce everything is set, you can use the insert-menu-into-Web-page command to add your menu in the Web page in a fast and easy manner without any code.\n\nHere are some key features of &quot;AllWebMenus Pro&quot;:\n\nÃ‚Â· Optimized menu building with separate javascripts for different browsers\nÃ‚Â· Full documentation on all features and properties! The HELP file is about 460KB offering you complete help on your design efforts. A complete manual can also be downloaded\nÃ‚Â· Ability to use menus over flash objects, form elements, applets and iframes\nÃ‚Â· Create any kind of menu fast by using pre-designed menu styles from the Style Gallery\nÃ‚Â· Create, link and update a menu into your web pages in no time and without any code required\nÃ‚Â· Import FrontPage Navigation Structures\nÃ‚Â· Use multiple menus in the same page\nÃ‚Â· Free Sitemap generator based on the functional menu structure\nÃ‚Â· Use flexible positioning for your menus\nÃ‚Â· Use menus with Shared Borders, Templates and Libraries\nÃ‚Â· Create menus for framed web sites (cross-frame menus)\nÃ‚Â· Create popup and hidden menus\nÃ‚Â· Design both horizontal and vertical menus\nÃ‚Â· Use static or animated images for both the background and content\nÃ‚Â· Specify optional Javascript Commands to create fully extensible and programmable menus\nÃ‚Â· Several unfolding effects\n\n\nRequirements:\n\nÃ‚Â· Internet Explorer installed\n\n\nLimitations: Ã‚Â·/NO Limitations\n\n\n\nWhat's New in This Release: [ read full changelog ]\n\nÃ‚Â· You can now create menus with sliding submenus, otherwise known as &quot;slide menus&quot;, &quot;expandable menus&quot; or &quot;accordion menus&quot;.\n\nÃ‚Â· 11 &quot;Sliding Menu&quot; Themes included in the distribution (free with licensed Add-in).\n\nÃ‚Â· 4 new Sliding Menu Theme Packs available in Theme Gallery.\n\nÃ‚Â· 6 new Sliding Menu Templates available in Menu Templates Gallery.\n\nÃ‚Â· You can now easier re-assign all existing style assignments in your project using the &quot;Select&quot; option in the &quot;Assign Style to multiple groups/items&quot; form.\n\nÃ‚Â· 2 new Themes added to the distribution (free) that utilise the &quot;Style+&quot; different appearance on 3rd level and beyond.\n\nÃ‚Â· Fixed a Mozilla-related issue with the property. If it was set as &quot;Image Only&quot; (i.e. no item text exists), the image was misaligned to the left.\n\nÃ‚Â· Fixed an issue with the 'awmSelectedItem' feature when the menu was of the &quot;Menubar&quot; type and the user resized the browser window.\n\nÃ‚Â· Fixed a Mozilla-related issue where a menu of the &quot;Menubar&quot; type could trigger a vertical scr...\n\n \n \n","torrent":{"xt":"urn:btih:35a65e1d1b30d8fde68d5bb2fb96ed3252be392c","amp;dn":"AllWebMenus.PRO.v5.1.766-MKDEV.TEAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35a65e1d1b30d8fde68d5bb2fb96ed3252be392c","infoHashBuffer":{"type":"Buffer","data":[53,166,94,29,27,48,216,253,230,141,91,178,251,150,237,50,82,190,57,44]},"announce":[],"urlList":[]}}