{"title":"The Herring in the Library - L. C. Tyler.epub","uid":9346880,"size":3550899,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:35c546561dc35fb1feb9157dc734066b7d9561a3&amp;dn=The+Herring+in+the+Library+-+L.+C.+Tyler.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387053678,"description":"When literary agent Elsie Thirkettle is invited to accompany tall but obscure crime-writer Ethelred Tressider to dinner at Muntham Court, she is looking forward to sneering at his posh friends. What she is not expecting is that, half way through the evening, her host will be found strangled in his locked study. Since there is no way that a murderer could have escaped, the police conclude that Sir Robert Muntham has killed himself. A distraught Lady Muntham, however, asks Ethelred to conduct his own investigation. Ethelred (ably hindered by Elsie) sets out to resolve a classic 'locked room' mystery; but is any one of the assorted guests and witnesses actually telling the truth? And can Ethelred's account be trusted? In the process, we meet one of Ethelred's own creations, the fourteenth-century detective Master Thomas, who is helped in his investigations of a mediaeval crime at Muntham Court by a small and rather pushy Abbess with a taste for honey cakes ...Is it possible that Master Thomas can shed some light on the twenty-first century case, and on Ethelred's own motives for investigating Sir Robert's death?","torrent":{"xt":"urn:btih:35c546561dc35fb1feb9157dc734066b7d9561a3","amp;dn":"The+Herring+in+the+Library+-+L.+C.+Tyler.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35c546561dc35fb1feb9157dc734066b7d9561a3","infoHashBuffer":{"type":"Buffer","data":[53,197,70,86,29,195,95,177,254,185,21,125,199,52,6,107,125,149,97,163]},"announce":[],"urlList":[]}}