{"title":"The Face On Your Plate - Jeffrey Masson   (Unabridged)","uid":6076483,"size":255615253,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:368571353b10a01873f9639f3bcfa81885a78fe1&amp;dn=The+Face+On+Your+Plate+-+Jeffrey+Masson+++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1293888755,"description":"The Face On Your Plate - The Truth About Food    (Unabridged)\n\n5 CDs\n\n\nIn this revelatory work, Jeffrey Moussaieff Masson shows how food affects our moral selves, our health and the environment. He raises questions to make us conscious of the decisions behind every bite we take: like the effect eating animals has on our land, waters, even global warming; what the results of farming practices - de-beaking chickens and separating calves from their mothers - are on animals and humans; and, how the health of animals affects the health of our planet and our bodies. \n\nAs a psychoanalyst, Masson looks at how denial keeps us from recognising the animal at the end of our fork - think pig, not bacon - and investigates each culture's distinctions among animals considered food and those that are forbidden. &quot;The Face on Your Plate&quot; brings together Masson's intellectual, psychological and emotional expertise over the last twenty years into the pivotal book of the food revolution.\n\n\n\nAbout the Author:\n\nJEFFREY MOUSSAIEFF MASSON is the author of the best-selling When Elephants Weep and Dogs Never Lie About Love, as well as The Pig Who Sang to the Moon and The Assault on Truth. An American, he lives in New Zealand. \n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:368571353b10a01873f9639f3bcfa81885a78fe1","amp;dn":"The+Face+On+Your+Plate+-+Jeffrey+Masson+++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"368571353b10a01873f9639f3bcfa81885a78fe1","infoHashBuffer":{"type":"Buffer","data":[54,133,113,53,59,16,160,24,115,249,99,159,59,207,168,24,133,167,143,225]},"announce":[],"urlList":[]}}