{"title":"Blues Media Player 25.11.2014","uid":11570751,"size":15364363,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:37458e0daad47415ae66402f472d11663fdb1fe8&amp;dn=Blues+Media+Player+25.11.2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1417018746,"description":"Blues Media Player is a software application which can be used to play audio and video content from your hard drive, portable storage units and listen to radio streams from the Internet. \n\nThe UI is intuitive and encompasses a tree view of the hard drive, a playlist panel, a preview of the video and a few playback controls, such as play, pause, next, previous and stop. Both beginners and power users can find their way around it with great ease and without encountering difficulties. \n\nThis media player supports a wide range of formats, including AC3, AIFF, MP3, OGG, WAV, AAC, M4A, APE, FLAC, FLV, WMA, TTA, SPX, WV, BLA, PLS and M3U. \n\nTracks, playlists, albums and folders can be shuffled and repeated, while it is possible to add silence and increase or decrease the speed. After playback, you can set the program to close itself, as well as shut down, lock or log off the computer. \n\nIt is possible to increase the size of the window and the video frame, show or hide different tool bars, change the layout view and the playlist style from report to list. Songs or movies can be sorted according to title, artists, album, track, duration, genre and a few others, playlists can be created and saved to the hard drive in PLS, BLS or M3U formats. \n\nThis utility features several tools that might be of use to you, such as an advanced search function, countdown timer, equalizer and image editor. You can view detailed information about a selected item, add bookmarks, take snapshots, view details about movies on IMDB and convert audio and video files from one format to another. \n\nTaking all of this into consideration, it becomes clear that Blues Media Player is a complex and highly efficient media player, with many options to take advantage of, a good response time and user-friendly environment","torrent":{"xt":"urn:btih:37458e0daad47415ae66402f472d11663fdb1fe8","amp;dn":"Blues+Media+Player+25.11.2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37458e0daad47415ae66402f472d11663fdb1fe8","infoHashBuffer":{"type":"Buffer","data":[55,69,142,13,170,212,116,21,174,102,64,47,71,45,17,102,63,219,31,232]},"announce":[],"urlList":[]}}