{"title":"Jack Staff (Paul Grist)","uid":5877821,"size":738470223,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:378c84181fc775bb221d1eb1c6fae720b0723add&amp;dn=Jack+Staff+%28Paul+Grist%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1286672276,"description":"Jack Staff is a British superhero created by comic book writer/artist Paul Grist. Billed as &quot;Britain's Greatest Hero&quot;, it is known for being in the style of an anthology title and for its multi-linear plotlines.\n\nThe series was first published by Paul Grist's Dancing Elephant Press, and is now published by Image Comics. Comics International began exclusive publication of a monthly four-page strip featuring the supporting character Ben Kulmer (the Claw)which has since been reprinted in The Weird World of Jack Staff King-Size Special.\n\nGrist created Jack Staff basing on a story which he had written to make use of Marvel's Union Jack  character, only to be rejected. He reworked the story to make it more of an original, self-contained comic.  What has also made the character very popular is Grist's use of many popular characters from British comics, some taken wholesale, others inspired by them.\n\nJack Staff, Britain's Greatest Hero, has been active since at least World War II. While he has revealed he has been around since the Victorian Age, its unknown if he was active as a superhero or similar adventurer. In his civilian identity, he works as a builder by the name of John Smith, but it is unknown if that is his real name.  It has been noted that Jack's record of success is a bit iffy; he often gets battered by supervillains and ends up in embarrassing or dangerous situations, such as being set-up to be arrested.\n\n\nReleased on &lt;a href=&quot; http://ComicPirates.info&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://ComicPirates.info&lt;/a&gt;\t","torrent":{"xt":"urn:btih:378c84181fc775bb221d1eb1c6fae720b0723add","amp;dn":"Jack+Staff+%28Paul+Grist%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"378c84181fc775bb221d1eb1c6fae720b0723add","infoHashBuffer":{"type":"Buffer","data":[55,140,132,24,31,199,117,187,34,29,30,177,198,250,231,32,176,114,58,221]},"announce":[],"urlList":[]}}