{"title":"freeRip PRO 3.6.6 + Patch [eRG]","uid":7093312,"size":3954165,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3902202d6e0805cb7798833bf308314bcac7fd0b&amp;dn=freeRip+PRO+3.6.6+%2B+Patch+%5BeRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"scuba-doo","files":-1,"time":1331454240,"description":"Homepage: www.freerip.com\n\n\n- Extracts audio tracks from CD to MP3, WAV, WMA, FLAC and OGG Vorbis\t\t\n- Extracts more than one track into a single audio file\t\t\n- Extracts specific frames from audio CD\t\t\n- Converts existing audio files and lets you change their properties\t\t\n- Adjusts audio track volume while converting\t\t\n- Gets CD-Text metadata from audio CDs to use as file tags\t\t\n- Integrated support for online CD databases including the exclusive FreeRIP CD DB\t\t\n- Builds local CD database for super-fast CD data retrieval\t\t\n- Built-in FreeRIP CD DB submissions\t\t\n- Support for ID3 v1 and v2 MP3 tagging\t\t\n- Support for MP3, Wav, WMA, Ogg Vorbis and FLAC file conversion\t\t\n- Integrated playlist generator (M3U, PLS, B4S, HTML, CSV)\t\t\n- Integrated search button for finding tracks' images, videos and lyrics\t\t\n- Integrated MP3 tag editor\t\t\n- Integrated Audio Player for tracks preview\t\t\n- Support for many languages including Spanish, Portugese, German, French, Italian\t\t\n- Compatible with all versions of Windows, including Windows 7\t\t\n- Very easy to use\t\t\n- Up to 30% faster than Basic in File Conversion with Higher Priority option enabled\t\t\n- Multi-Core CPU optimization (concurrent conversions and concurrent ripping options)\t\t\n- Multiple concurrent instances allowed\t\t\n- Unlimited bulk file conversions\t\t\n- Exclusive support forum\n\n\n\nFreeRIP is an advanced CD to MP3 Converter that comes packed with features. At its core, FreeRIP reads audio from your CDs and allows you to save them to your computer in a variety of digital formats including WMA, MP3, Ogg, Wav, or FLAC audio files (this process is known as CD ripping or CD to MP3 conversion). Converting your CD audio collection to digital audio files is a breeze with FreeRIP: download and install FreeRIP, put your audio CD into your computer's CD drive, run FreeRIP and click on the Rip button.\nFreeRIP is also an audio and MP3 converter. It can convert MP3 and other audio files from one format to another. For example FreeRIP can convert audio files from WMA to MP3, or OGG to MP3, FLAC to MP3 or WAV to FLAC and so on.\nOnce you have your digital audio tracks saved in your preferred format, it's easy to load them to your favorite audio player (e.g. a portable MP3 player such as an Apple iPodâ„¢, Creative Zen Playerâ„¢ or Sony Walkmanâ„¢). You can also move tracks to an advanced mobile phone, or burn them to a MP3 CD's to listen in your MP3 car stereo, home stereo or Discmanâ„¢.\n \nFreeRIP supports the high quality, lossless compression named FLAC, which is widely used and supported by audiophiles. If you want to be sure to save all the richest details in your audio tracks, save them in the FLAC format.\n \nFreeRIP is also an advanced MP3 tag editor (supporting ID3 v1 and v2) and includes shortcuts to find track info\n(like lyrics or complete title) on the web, with just one click. This makes cataloging your entire collection simple and easy.\n \nFreeRIP comes in two versions, FreeRIP Basic which is totally free, and FreeRIP Pro which offers more features and options \n\n\n\nScanned with: F-Secure IS 2012\n\n\n\nENJOY\n       scuba-doo\n\n\nshare the wealth and seed, comments are more then welcome","torrent":{"xt":"urn:btih:3902202d6e0805cb7798833bf308314bcac7fd0b","amp;dn":"freeRip+PRO+3.6.6+%2B+Patch+%5BeRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3902202d6e0805cb7798833bf308314bcac7fd0b","infoHashBuffer":{"type":"Buffer","data":[57,2,32,45,110,8,5,203,119,152,131,59,243,8,49,75,202,199,253,11]},"announce":[],"urlList":[]}}