{"title":"speak to text.","uid":4317501,"size":8125565,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:39324c24cd0cf567854d0791c8d2dd6066ec7a4f&amp;dn=speak+to+text.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"romelanda","files":12,"time":1217174084,"description":"[img]http://img03.picoodle.com/img/img03/9/10/13/f_h33tpresentm_0fa1736.gif[/img]\n\n[img]http://img34.picoodle.com/img/img34/4/3/1/f_coverm_a2433d6.jpg[/img]\n\n[b]SpeakToText Speech Recognition v2.35.25[/b]\n\n[b]Note:[/b] doesn&amp;#039;t comes with the SAPI 5.1 Speech Recognition Engine\n\nYou can get the SR engine here:\nCoolInfo (Adware)\n[url]http://www.coolsoftllc.com/main.asp?productsummary=61#61[/url]\n\n[b]Description:[/b]\n\nWith SpeakToText Speech Recognition, you can dictate text directly into other applications, recognize audio files \nyou create, have documents read to you by your computer, create your own custom speech commands, and chat hands-free \nwith most chat programs including MSN Messenger, AIM Instant Messenger, Yahoo Messenger, ICQ, PalTalk and Skype. \n\nSpeakToText Speech Recognition gives you much of the functionality of high-priced voice recognition software \nat a fraction of the cost. \n\n\n\nWith SpeakToText you can:\n\n* A wide range of speech commands for menu items, buttons and dialogs let you run SpeakToText almost entirely by speech.\n* Dictate and copy text to Microsoft Word with a single speech command.\n* Copy your dictation to almost any application by way of the clipboard.\n* Dictate text directly into most applications with Advanced Mode. \n  You can switch between program windows with a simple mouse click.\n* Use the new Advanced Mode to write and send emails in Outlook, Outlook Express, Netscape, FireFox, \n  Mozilla and many other email programs.\n* Speak and send chat messages hand&amp;#039;s free with the &quot;Send Message&quot; speech command. \n  Works with MSN Messenger, AIM, Yahoo Messenger, ICQ, PalTalk, Skype and many more.\n* The new auto-send message feature lets you send a transcript of what you say in a voice chat session. \n  If the other person has trouble hearing you, they can fill in the blanks from your speech.\n* Have your computer read documents, emails, and webpages with the Text-to-Speech feature. \n  New read commands give you a variety of read options.\n* Reduce your dependence on the mouse and keyboard, and avoid spelling and typographical errors. \n  The Microsoft SAPI Speech Recognition Engine does not make spelling mistakes.\n* Convert .wav files you create on your PC or personal recorder into text with the click of a mouse. \n  Enhanced .wav file recognition let&amp;#039;s you see progress as your .wav file is recognized.\n* Create your own speech commands to start programs, browse webpages, play music and much more. \n  Give your computer personality by creating commands to make it talk back to you. User commands now include \n  tool tips to help you remember commands.\n* Display a list of available speech commands just by saying &quot;What Can I Say?&quot; \n  The commands list in the What Can I Say? dialog now tool tips to help you remember commands.\n\n\n[b]System Requirements:[/b]\n\nWindows XP Home/Professional or Windows 2000\n500MHz or greater processor\n256 megs RAM\n100 megs free disk space\nA noise canceling headset microphone.\n\n[b]Installation:[/b]\n\nInstall SpeakToText_2_0_TrialInstall.exe\ncopy crackspeaktotext.exe to program folder\n\t\n[img]http://img26.picoodle.com/img/img26/9/7/31/f_deesew9m_84b59f0.gif[/img] \n ","torrent":{"xt":"urn:btih:39324c24cd0cf567854d0791c8d2dd6066ec7a4f","amp;dn":"speak+to+text.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39324c24cd0cf567854d0791c8d2dd6066ec7a4f","infoHashBuffer":{"type":"Buffer","data":[57,50,76,36,205,12,245,103,133,77,7,145,200,210,221,96,102,236,122,79]},"announce":[],"urlList":[]}}