{"title":"Encyclopedia of Civil War Shipwrecks {BBS}","uid":7341893,"size":8515300,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:398f5ffce604afa3118c3e0b983ee30d56e86627&amp;dn=Encyclopedia+of+Civil+War+Shipwrecks+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1339265463,"description":"On the evening of February 2, 1864, Confederate Commander John Taylor Wood led 250 sailors in two launches and twelve boats to capture the USS Underwriter, a side-wheel steam gunboat anchored on the Neuse River near New Bern, North Carolina. During the ensuing fifteen-minute battle, nine Union crewmen lost their lives, twenty were wounded, and twenty-six fell into enemy hands. Six Confederates were captured and several wounded as they stripped the vessel, set it ablaze, and blew it up while under fire from Union-held Fort Anderson. The thrilling story of USS Underwriter is one of many involving the numerous shipwrecks that occupy the waters of Civil War history. Many years in the making, W. Craig Gaines's Encyclopedia of Civil War Shipwrecks is the definitive account of more than 2,000 of these American Civil War-period sunken ships. From Alabama's USS Althea, a Union steam tug lost while removing a Confederate torpedo in the Blakely River, to Wisconsin's Berlin City, a Union side-wheel steamer stranded in Oshkosh, Gaines provides detailed information about each vessel, including its final location, type, dimensions, tonnage, crew size, armament, origin, registry (Union, Confederate, United States, or other country), casualties, circumstances of loss, salvage operations, and the sources of his findings. Organized alphabetically by geographical location (state, country, or body of water), the book also includes a number of maps providing the approximate locations of many of the wrecks--ranging from the Americas to Europe, the Arctic Ocean, and the Indian Ocean. Also noted are more than forty shipwrecks whose locations are in question.\n\nSince the 1960s, the underwater access afforded by SCUBA gear has allowed divers, historians, treasure hunters, and archaeologists to discover and explore many of the American Civil War-related shipwrecks. In a remarkable feat of historical detective work, Gaines scoured countless sources--from government and official records to sports diver and treasure-hunting magazines--and cross-indexes his compilation by each vessel's various names and nicknames throughout its career.\n\nAn essential reference work for Civil War scholars and buffs, archaeologists, divers, and aficionados of naval history, Encyclopedia of Civil War Shipwrecks revives and preserves for posterity the little-known stories of these intriguing historical artifacts.\n\n\n\nHardcover: 231 pages\nPublisher: Louisiana State University Press (May 1, 2008)\nLanguage: English\nISBN-10: 0807132748\nISBN-13: 978-0807132746","torrent":{"xt":"urn:btih:398f5ffce604afa3118c3e0b983ee30d56e86627","amp;dn":"Encyclopedia+of+Civil+War+Shipwrecks+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"398f5ffce604afa3118c3e0b983ee30d56e86627","infoHashBuffer":{"type":"Buffer","data":[57,143,95,252,230,4,175,163,17,140,62,11,152,62,227,13,86,232,102,39]},"announce":[],"urlList":[]}}