{"title":"Switchblade Honey (Warren Ellis)","uid":4547646,"size":27847652,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:39d3b86e1d31a0ee1f9cef76d9851a3a823a4f42&amp;dn=Switchblade+Honey+%28Warren+Ellis%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mmdsx","files":-1,"time":1228188720,"description":"Switchblade Honey\nAIT/Planet Lar, 2003.\n\n\nSwitchblade Honey is Star Trek for those with more of a cynical streak than most of Gene Roddenberry&amp;#039;s fans. Ellis admits in his introduction right upfront that this whole thing started as a gag, sort of a riff on Star Trek, but while there&amp;#039;s definitely a less-than-serious air about the whole thing, Switchblade Honey isn&amp;#039;t a humor piece. It&amp;#039;s science-fiction high adventure with more than a little bad attitude, and, courtesy of Brandon McKinney, some pretty sleek looking starships. It is a little light, and some of the ideas don&amp;#039;t really come through as well as they could, but this is a genre rarely tackled well at all, and there are plenty of fun moments in this story.\n\nTo Ellis, the Federation is a bunch of stuffy old men who don&amp;#039;t smoke, drink or do anything else fun and for whom humanity is an intellectual exercise rather than a part of their being. This small crew is about the best representation of why humanity deserves to survive, even though they&amp;#039;re a bunch of cursing, hard-drinking, chain-smoking and occasionally drug-addicted criminals. That they&amp;#039;re also a lot more fun to hang around with than the prim and proper 16th century English navy in starships isn&amp;#039;t a big surprise.\n\nThanks to the scanner and original uploaders.","torrent":{"xt":"urn:btih:39d3b86e1d31a0ee1f9cef76d9851a3a823a4f42","amp;dn":"Switchblade+Honey+%28Warren+Ellis%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39d3b86e1d31a0ee1f9cef76d9851a3a823a4f42","infoHashBuffer":{"type":"Buffer","data":[57,211,184,110,29,49,160,238,31,156,239,118,217,133,26,58,130,58,79,66]},"announce":[],"urlList":[]}}