{"title":"Homeward on the Oregon Trail series by Melody Carlson (01-03) ","uid":9689151,"size":2223534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:39ff4dec483ca1033eff2390539c88525ac32178&amp;dn=Homeward+on+the+Oregon+Trail+series+by+Melody+Carlson+%2801-03%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"PirateBook","files":3,"time":1393832635,"description":"\nMelody has published over ninety books for adults, children, and teens, with sales totalling more than two million and many titles appearing on the ECPA Best-sellers List. \n\nSeveral of her books have been finalists for, and winners of, various writing awards, including the Gold Medallion and the RITA Award.\n\nGenre: Historical | Inspirational Romance\n\n\nAbout This Series: The Homeward on the Oregon Trail series brings to life the challenges a young widow faces as she journeys west, settles her family in the Pacific Northwest, and helps create a new community among strong-willed and diverse pioneers.\n\n#1. Westward Hearts:\nKentucky, 1854--Elizabeth Martin has mourned her husband's death for three years, but now she feels ready to fulfill the dream they had shared--to take their two children west. The dream becomes reality when her middle-aged parents and bachelor brother surprise her with the news that they want to go as well. After converting three of their best wagons to prairie schooners and thoroughly outfitting them, the little party travels from Kentucky to Kansas City, where they join a substantial wagon train. Elizabeth soon finds herself being drawn to the group's handsome guide, Eli Kincade. The long journey and deepening relationships challenge the travelers to their core, and Eli's mysterious past leaves Elizabeth with more questions than answers. She knows there's no turning back, but she wonders, What have I gotten myself into?\n\n#2. A Dream for Tomorrow:\nElizabeth Martin and her two children have made it through the easy part of their journey, but now their wagon train faces high mountain passes, dangerous river crossings, and decreasing supplies. Desperate circumstances bring out the best and worst of the travelers, including Will Bramford, the wealthy widower who is pursuing Elizabeth, and Eli Kincade, the independent and solitary guide who has stolen Elizabeth's heart. As the group reaches the Oregon Country, the emigrants part ways to find their new homes. Elizabeth and Will and their families have made arrangements to board a ship that will take them south along the coast. Will Eli change his plans and accompany Elizabeth to her new and permanent home? Or will his mysterious past continue to keep them from love?\n\n#3. A Home at Trail's End:\nElizabeth Martin and her two children have finally reached the Oregon Country. But Eli Kincade, the wagon train scout who captured her heart, has chosen to continue life on the trail. As other pioneer families begin building new homes, Elizabeth has never felt more alone. However, when Eli unexpectedly returns, confesses his love, and proposes, Elizabeth accepts with her family's blessing. A community begins to take shape, but not without growing pains. As an alternative to the local minister's fiery sermons, Elizabeth's father begins to preach at home, raising the ire of some. Racial biases arise against Brady, Elizabeth's African-American hired hand. Eli's warm sentiments toward Indians also raises concerns. Can Elizabeth and her family overcome these differences and begin a legacy of reconciliation and love?","torrent":{"xt":"urn:btih:39ff4dec483ca1033eff2390539c88525ac32178","amp;dn":"Homeward+on+the+Oregon+Trail+series+by+Melody+Carlson+%2801-03%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39ff4dec483ca1033eff2390539c88525ac32178","infoHashBuffer":{"type":"Buffer","data":[57,255,77,236,72,60,161,3,62,255,35,144,83,156,136,82,90,195,33,120]},"announce":[],"urlList":[]}}