{"title":"Two Siberians - Out of Nowhere [FLAC] +covers","uid":4449084,"size":351522385,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3a5babd6b4d59aa83d8a3b69ad0fb319609a71dc&amp;dn=Two+Siberians+-+Out+of+Nowhere+%5BFLAC%5D+%2Bcovers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Willy_B","files":-1,"time":1224182664,"description":"&quot;Irkutsk, Siberia, is 150 miles north of Mongolia and home to the most exciting instrumental duo to hit the music scene in quite some time the Two Siberians.\nYes, it's instrumental music (electric violin and electric guitar), but do not be fooled. Think infectious melodies with burning virtuosic displays. Think impassioned whispers and fiery bursts with a propulsive ethnic pulse. Think world pop instrumental. Or just consider the opinion of Maty Fernandez of MTV: &quot;These two guys do what it takes Dave Matthews five guys to do.&quot;\nThe musicianship of Artyom Yakushenko (electric violin) and Yuri Matveyev (electric guitar) is exceptional and their sound is unique.&quot;\n\nTwo Siberians are: Yuri Matveyev (electric guitar); Artyom Yakushenko (electric violin) &amp; additional personnel include: Richard Bona (vocals, bass instrument); Nina Hennessey (vocals); Don Byron (clarinet); Michael Brecker (tenor saxophone); George Whitty (synthesizer); Matt Garrison (bass guitar); Mino Cinelu, Steve Berrios (percussion).\nOut Of Nowhere is billed as their &quot;debut&quot; release. But their Web site lists nine albums recorded since 1995, including a 2003 date for Out Of Nowhere , so I can only assume the debut reference means the first available outside whatever musical region they occupy.\n\nAll pictures in booklet is 300 pixels/inch. All tracks are separate &amp; with tags. Ripped with EAC.\nIf you want to burn this CD, you can download cole2K nero audio plugin (google helps you), or use alcohol, EAC  etc. \nI can't seed all the time, but I'll seed every night, till someone downloads. Just wait. I'll be hapy if you seed few days after download.\nIf you think you want somethig else, just tell me here.\n\nP.S. Sorry for my bad english. I'm russian.\n\n","torrent":{"xt":"urn:btih:3a5babd6b4d59aa83d8a3b69ad0fb319609a71dc","amp;dn":"Two+Siberians+-+Out+of+Nowhere+%5BFLAC%5D+%2Bcovers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a5babd6b4d59aa83d8a3b69ad0fb319609a71dc","infoHashBuffer":{"type":"Buffer","data":[58,91,171,214,180,213,154,168,61,138,59,105,173,15,179,25,96,154,113,220]},"announce":[],"urlList":[]}}