{"title":"Marika King - Projekt Längtan - Svensk","uid":14297407,"size":444482142,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3a676fe9109052e091f1dee568eb589e29851ef4&amp;dn=Marika+King+-+Projekt+L%26auml%3Bngtan+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"totomas1","files":128,"time":1460465473,"description":"Marika King – Projekt Längtan\r\n\r\nDet har bara gått tre månader sedan Lisa blev sjukskriven för utbrändhet, men hon är redan tillbaka på den prestigefyllda konsultbyrån mitt i Stockholm. Det första uppdraget går lysande och hennes karriärmöjligheter vet nu inga gränser.\r\nMen samtidigt som allt går Lisas väg är det något som skaver i henne en längtan efter något annat och en önskan om ett mer meningsfullt arbete. Sin vana trogen försöker hon lösa problemet genom att göra avancerade kalkyler över sina livsval, och hon sätter sitt hopp till Excel-arket. Fast riktigt så enkelt är det ju inte att välja väg i livet.\r\n\r\nLisas sökande leder henne till sist till ett volontärjobb i Ghana. Hon kastar sig över arbetsuppgifterna och njuter av sitt nya liv ända tills hon inser hur svårt det är att hjälpa till i biståndsvärlden. Förstärkning dyker upp från ett högst oväntat håll och även på kärleksfronten verkar Afrika bli en spännande kontinent.\r\nEnligt alla kalkyler borde allt vara bra nu, så varför känns det då fortfarande som om något fattas? Vad är det Lisa egentligen längtar efter?\r\n\r\nProjekt längtan är den fristående uppföljaren till Marika Kings debutroman Supernova, om prestationsprinsessan Lisa. Det är en smart och rolig roman om jakten på det perfekta jobbet, sökandet efter mening, och om vår skeva bild av Afrika och vad det innebär att göra gott.\r\n\r\nMarika King har tidigare varit managementkonsult på McKinsey &amp; Company men har också erfarenhet av biståndsvärlden.\r\n\r\n\r\nMp3-CD\r\nUppläsare: Viktoria Flodström\r\nSpeltid: Ca 10 timmar","torrent":{"xt":"urn:btih:3a676fe9109052e091f1dee568eb589e29851ef4","amp;dn":"Marika+King+-+Projekt+L%26auml%3Bngtan+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a676fe9109052e091f1dee568eb589e29851ef4","infoHashBuffer":{"type":"Buffer","data":[58,103,111,233,16,144,82,224,145,241,222,229,104,235,88,158,41,133,30,244]},"announce":[],"urlList":[]}}