{"title":"Marc Dorcel: LUXURE: Wives to share XXX (NEW) DVDRip x264-VBT","uid":13879108,"size":881219571,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:3ac2da8de1675ba0c38be206c860a60eaa88a679&amp;dn=+Marc+Dorcel%3A+LUXURE%3A+Wives+to+share+XXX+%28NEW%29+DVDRip+x264-VBT+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LucasCar","files":3,"time":1458140079,"description":"\nCategory: Straight, Anal, BDSM, BlowJob, Threesome\r\n\r\nCast: Anna Polina, Amarna Miller, Jessie Volt, Cara St. Germain, Alexandra Stein, Alix Feeling, Rico Simmons, J.P.X., Max Casanova, Ricky Mancini (II), Josh (II)\r\n\r\n.:Description:.\r\nWhen infidelity becomes a game, nothing is out of bounds\r\nIn a world of luxury and seduction, these six beautiful married women are ready and willing to do anything to satisfy the debauched and voyeuristic fantasies of their husbands. Offering themselves to strangers under the perverted gaze of their husbands, they are about to discover new heights of pleasure. Without doubt, forbidden fruit tastes even better when shared...\r\nEarlier in the day, this amazing redhead sucked off a stranger until he came in her mouth, and her husband didn't miss a second of this tantalising performance. On returning to the house, she is delighted to discover that he has never been so aroused, and he intends to make her come like never before...\r\nThis evening, the beautiful Cara has one simple goal in mind: to satisfy the desires of three strangers who her husband has invited into their luxurious home. The submissive young woman is determined to accomplish her mission of pleasuring each of these men to the max, and above all her perverted husband.\r\nSat naked right in the middle of the room, Alix has no choice but to watch in silence as her husband vigorously fucks Jessie in the ass. While this online escort is in the throes of a powerful anal orgasm thanks to her husband's dick, Alix dreams of being able to join in. But her husband won't allow it, so she'll just have to watch the show through to the end...\r\nTake a look at screenshots! Enjoy! \nhttp://naughtyimage.com/img-56e9658504059.html\r\n \nhttp://naughtyimage.com/img-56e9658a4f42a.html","torrent":{"xt":"urn:btih:3ac2da8de1675ba0c38be206c860a60eaa88a679","amp;dn":"+Marc+Dorcel%3A+LUXURE%3A+Wives+to+share+XXX+%28NEW%29+DVDRip+x264-VBT+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ac2da8de1675ba0c38be206c860a60eaa88a679","infoHashBuffer":{"type":"Buffer","data":[58,194,218,141,225,103,91,160,195,139,226,6,200,96,166,14,170,136,166,121]},"announce":[],"urlList":[]}}