{"title":"Chicago - Stay The Night (2nafish)","uid":5744706,"size":157763588,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3c82a06525301b0d617eb84b7316512a91c8e94d&amp;dn=Chicago+-+Stay+The+Night+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1281167340,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Stay the Night&quot; is a song written by Peter Cetera and David Foster for the group Chicago and recorded for their album Chicago 17 (1984), with Cetera singing lead vocals. The first single released from that album, it reached #16 on the U.S. Billboard Hot 100 chart.\n\nThis song is also remembered for its video. It shows Peter Cetera chasing a hard-to-get beautiful lady and features car-chases, notably featuring a red convertible Oldsmobile 442, stunts (Cetera supposedly performed most of his stunts himself), and a surprise ending. It was directed by Gilbert Bettman Jr. and soon gained cult-status among music-video lovers.\n\nChicago 17 is the 17th album by American rock band Chicago and was released in 1984. As the follow-up to 1982's comeback Chicago 16, Chicago 17  capitalized on its predecessor's popularity by delivering their most popular album - currently seven times platinum in the US alone and a Grammy winner - and one which would spin off four Top 20 US hit singles, including the spare-sounding synth-rocker &quot;Stay the Night&quot; (#16), ballads &quot;Hard Habit to Break&quot; (#3) and &quot;You're the Inspiration&quot; (#3), and the bouncy dance-inflected &quot;Along Comes a Woman&quot; (#14). The album was the first to really embrace the MTV video age, and the four videos enjoyed widespread airplay, including the &quot;Indiana Jones&quot;-influenced &quot;Along Comes a Woman.&quot;\n\nChicago 17 would once again spell a turning point for the group, as this would be the last studio album with bassist, vocalist, and founding member Peter Cetera.\n\nProduced again by David Foster, the album expanded on the adult contemporary leanings of its predecessor, swelling Chicago's audience as a result. Chicago 17 was a slow burner, finally reaching #4 in the US in early 1985, even seeing significant - and rare - success in the UK, on the strength of its many hits.\n\nChicago had long promoted itself as a &quot;faceless&quot; band, to let the famous Coca-Cola styled logo (and the music) do the talking. However, with the advent of the music video age, the camera would ultimately focus on the band member who sang most (if not all) of the songs, despite the presence of two other lead singers.\n\nThis album was the last Chicago album with vocalist/bass player Peter Cetera. Cetera quit the band in July 1985 due to a combination of factors, including his desire to have a solo career alongside his band career, and a reduction in touring.\n\nOn the heels of their biggest album ever, Chicago found themselves in the unenviable position of finding another bass playing tenor. Cetera's replacement for Chicago 18 would be Jason Scheff, who is still with Chicago, and whose tenure in the band eclipses that of Cetera. Ironically, Scheff was discovered after submitting material for Cetera's first post-Chicago solo release, Solitude Solitaire.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:3c82a06525301b0d617eb84b7316512a91c8e94d","amp;dn":"Chicago+-+Stay+The+Night+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c82a06525301b0d617eb84b7316512a91c8e94d","infoHashBuffer":{"type":"Buffer","data":[60,130,160,101,37,48,27,13,97,126,184,75,115,22,81,42,145,200,233,77]},"announce":[],"urlList":[]}}