{"title":"Far Space by Jason Kent","uid":11092289,"size":498331,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3de47266b32eb4d2dff09d5322602a769cfe908e&amp;dn=Far+Space+by+Jason+Kent&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"PirateBook","files":1,"time":1411542255,"description":"\nGod, Country, Corps. Space Corps tenets only work if you survived long enough to follow them.\n\nIan Langdon was supposed to be the pilot of an orbital patrol craft protecting Allied forces. His chances for a nice, quiet rotation disappeared when the Soosuri decided to attack without warning. Is it too much to ask a simple pilot to save humanity in its darkest hour?\n\nJennifer Wright wanted to explore new worlds and then get back home to Ian, the young Space Corps pilot who had saved her life during the first battle of Near Space. The Soosuri had other plans. \n\nStranded on a water world in the Far Space beyond the wormholes, can she find the strength to survive when her crew turns against her? Taking refuge among the Soosuri, Jennifer uncovers a startling truth which will rock both races.\n\nCol Yates knew the Soosuri were coming back and Ian and Jennifer had uncovered a startling revelation out in Far Space all of mankind desperately needed to hear. Would his forces be able to hold this terrible enemy back long enough for Ian and Jennifer to share their discovery?\n\nDestiny's hand was dealt; the time had come for Ian to fulfill his duty.\n\nGenre: Military Science Fiction","torrent":{"xt":"urn:btih:3de47266b32eb4d2dff09d5322602a769cfe908e","amp;dn":"Far+Space+by+Jason+Kent","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3de47266b32eb4d2dff09d5322602a769cfe908e","infoHashBuffer":{"type":"Buffer","data":[61,228,114,102,179,46,180,210,223,240,157,83,34,96,42,118,156,254,144,142]},"announce":[],"urlList":[]}}