{"title":"Microsoft Office 2010 Digital Classroom BY WALIDWITHU","uid":6614336,"size":83608065,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e9a1705d37837500edfbcda155d716567c7d5e7&amp;dn=Microsoft+Office+2010+Digital+Classroom+BY+WALIDWITHU&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"walidwithu","files":1,"time":1313728111,"description":"Microsoft Office 2010 Digital Classroom\n\nThis terrific Office 2010 book training package-from the same professional training experts who also create many training materials for Adobe Systems-is like having your own personal instructor guiding you through each lesson, but you work at your own pace! The full-color book includes 27 lessons that teach you the new features and quirks of Microsoft Office 2010.\n\nEach lesson includes step-by-step instructions and lesson files, and provides valuable video tutorials that complement what you\\'re learning and clearly demonstrate how to do tasks. This jam-packed training package takes you well beyond the basics in a series of easy-to-absorb, five-minute lessons.\n\nShows you how to use Microsoft Office 2010, the new version of the Microsoft Office suite that is available in standard 32-bit and now also a 64-bit version\nWalks you through 27 lessons, each consisting of easy-to-follow, step-by-step instructions and lesson files in full color that make each task less intimidating\nIncludes all the lesson files from the book and video tutorials that clearly show you how to do tasks and reinforces what you\\'re learning in the book\nCovers exciting new Office 2010 features such as Office Web apps that can be accessed from anywhere and a streamlined new Ribbon\nProvides the perfect, one-stop, robust learning package-with book and supplementary video training on all the applications in Office 2010\nAdditional resources available on companion Web site: www.digitalclassroombooks.com\nLearn the ins-and-outs of Office 2010 with this all-in-one, value-packed combo!\n__________________________________\n\nLessons files included..","torrent":{"xt":"urn:btih:3e9a1705d37837500edfbcda155d716567c7d5e7","amp;dn":"Microsoft+Office+2010+Digital+Classroom+BY+WALIDWITHU","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e9a1705d37837500edfbcda155d716567c7d5e7","infoHashBuffer":{"type":"Buffer","data":[62,154,23,5,211,120,55,80,14,223,188,218,21,93,113,101,103,199,213,231]},"announce":[],"urlList":[]}}