{"title":"Train Simulator 2013 - ICE 3","uid":7821376,"size":69460094,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3ebf75a15f77fc7f5af9af0d8aed5aea988d1057&amp;dn=Train+Simulator+2013+-+ICE+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IiTraxiI","files":-1,"time":1352832005,"description":"About the Game\nNote: This Add-On requires Cologne - Dusseldorf Add-On to be fully functional.\n\nThe ICE 3 is a fantastic new-generation high speed train introduced in 2000, and now you can take on the challenge of driving this serious high-performance train yourself!\n\nBuilt by Siemens as part of their Velaro family of trains, the ICE 3 is the third generation of ICE trains first introduced in 1991. The 400-ton ICE 3 has a top speed of 320km/h (199mph) thanks to its aluminium construction and 8,000kW power output, significantly shortening journey times and improving the passenger experience. The Class 406 ICE 3M variant, as modelled for Train Simulator, was developed to run on the different railway electrification systems used across Europe and is used by Deutsche Bahn and Nederlandse Spoorwegen.\n\nThe ICE 3 for Train Simulator is a highly-accurate recreation of the Class 406 ICE 3M high speed train in DB livery, complete with a fantastic passenger view which enables lucky passengers to see into the drivers cab and through the windscreen during their journey. Realistic operating features include PZB90 cab signaling system, AFB speed control and SIFA driver vigilance system. ICE 3 also includes scenarios for the Cologne-Dusseldorf route.\n\nIncludes:\nHighly-realistic recreation of the ICE 3M high speed train in DB white and red livery, including Driving First Class, Driving Second Class, Trailer First Class, Trailer Second Class and Trailer Restaurant cars. Operational features include PZB90 cab signaling system, AFB speed control and SIFA driver vigilance system.\n\nScenarios for the Cologne-Dusseldorf route:\n\nBreaking the ICE (introduction to the ICE control systems)\nICE Express\nStopping ICE\nDouble ICE\nMelting the ICE\nEvening ICE\nOn Thin ICE\nWorld Cup ICE","torrent":{"xt":"urn:btih:3ebf75a15f77fc7f5af9af0d8aed5aea988d1057","amp;dn":"Train+Simulator+2013+-+ICE+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ebf75a15f77fc7f5af9af0d8aed5aea988d1057","infoHashBuffer":{"type":"Buffer","data":[62,191,117,161,95,119,252,127,90,249,175,13,138,237,90,234,152,141,16,87]},"announce":[],"urlList":[]}}