{"title":"ZevenOS Linux Neptune 3.0 &amp;ldquo;Brotkasten&quot;","uid":8305980,"size":1899933696,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:3ef308bf388b1a5647d69fa2d39a8260f1132b4d&amp;dn=ZevenOS+Linux+Neptune+3.0+%26ldquo%3BBrotkasten%26quot%3B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JRepin","files":-1,"time":1364378847,"description":"ZevenOS Linux Neptune edition is a Debian-based desktop GNU/Linux distribution for 64-bit computer systems with a customised KDE Plasma as the default desktop\n\nThis release features the Linux kernel 3.8.4 and is exclusively meant to run on 64bit CPUs. We switched the Debian base from testing to wheezy to provide a more stable and better experience. The KDE Plasma Desktop ships with version 4.10.1. Chromium was updated to version 25, Icedove to version 10.0.12ESR, Gimp 2.8.2, Kdenlive 0.9.4, Amarok 2.7, VLC 2.0.5. We ship with the latest and greates multimedia codecs preinstalled aswell as the flashplayer. For wireless diagnosis we ship Wireshark, Aircrack-ng and kismon.\n\nThe Neptune Installer now comes with a summary page allowing you to see a summary of the installation options aswell as allowing you to change the language and localization of your system right from within the installer (the new language-selector tool can be called after installation aswell). We also added a new advanced installation mode the Nested Installation.\nThanks to our competition in creating Kdenlive title templates we were able to put lots of cool and new title templates into this release.\nThe ZevenOS-Hardwaremanager was updated to be more polished and to allow even the installation of experimental proprietary graphicsdrivers (from the debian experimental repository).\n\nThe artwork of Neptune 3.0 was modified aswell and for the first time also uses a custom sound theme aswell as a customized mouse cursor theme. We optimized the font rendering and turned font hinting on by default. \n\nThe new default launchermenu to open up applications has been switched to lancelot which allows you to use all the great krunner plugins in the integrated search aswell as offering a better overview of installed applications and a clickless navigation.\n\nRelease notes: &lt;a href=&quot;\nhttp://www.zevenos.com/allgemein/neptune-3-0-brotkasten-release-is-ready.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.zevenos.com/allgemein/neptune-3-0-brotkasten-release-is-ready.html&lt;/a&gt;","torrent":{"xt":"urn:btih:3ef308bf388b1a5647d69fa2d39a8260f1132b4d","amp;dn":"ZevenOS+Linux+Neptune+3.0+%26ldquo%3BBrotkasten%26quot%3B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ef308bf388b1a5647d69fa2d39a8260f1132b4d","infoHashBuffer":{"type":"Buffer","data":[62,243,8,191,56,139,26,86,71,214,159,162,211,154,130,96,241,19,43,77]},"announce":[],"urlList":[]}}