{"title":"Gardner's Art through the Ages: Backpack Edition, Book D","uid":8833345,"size":69697617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40856abedf5e0dcafd8d1f423741384f0e88d152&amp;dn=Gardner%27s+Art+through+the+Ages%3A+Backpack+Edition%2C+Book+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DrZimmins","files":3,"time":1377046954,"description":"GARDNER'S ART THROUGH THE AGES, 14e, BACKPACK EDITION, VOLUME D: RENAISSANCE AND BAROQUE ART, is part of a six-book set that provides you with a comprehensive, beautifully illustrated tour of the world's \ngreat artistic traditions, plus all of the online study tools you need to excel in your art history course! Easy to read and understand, the fourteenth edition of the most widely-read art history book in \nthe English language continues to evolve, incorporating new artists and art forms and providing a rich cultural backdrop for each of the covered periods and geographical locations. \nThe integrated online learning environment, CourseMate, provides a state-of-the-art experience for exploring and studying \nthe world's great works of art and architecture. It includes an interactive eBook, \nimages included within the text, video and audio clips, image flashcards, a printable Slide Guide suitable for note-taking,\n a new Guide to Studying, quizzes, and much more. A unique Scale feature will help you better visualize the actual size \nof the artworks shown in the book. &quot;The Big Picture&quot; overviews at the end of every chapter, and a special global timeline\n will help you review for exams.","torrent":{"xt":"urn:btih:40856abedf5e0dcafd8d1f423741384f0e88d152","amp;dn":"Gardner%27s+Art+through+the+Ages%3A+Backpack+Edition%2C+Book+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40856abedf5e0dcafd8d1f423741384f0e88d152","infoHashBuffer":{"type":"Buffer","data":[64,133,106,190,223,94,13,202,253,141,31,66,55,65,56,79,14,136,209,82]},"announce":[],"urlList":[]}}