{"title":"Cream 24 Bit Vinyl Pack","uid":8683584,"size":10982847789,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:40fff35db7a8f6988ddaa112e0bc48402b933bbf&amp;dn=Cream+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1373747311,"description":"\n  Cream 24 Bit Vinyl Pack\n\n  Genres: Pop/Rock, Blues\n  Styles: Blues-Rock, British Blues, Hard Rock, Psychedelic\n  Source: Vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,800 - 5,600 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz, 192,000 Hz\n\n  Albums\n\n  Fresh Cream (DCC 180g LP) 96,000 Hz\n  Disraeli Gears 96,000 Hz\n  Disraeli Gears (Universal Japan 200g LP) 192,000 Hz\n  Best of Cream 96,000 Hz\n  Live Cream 192,000 Hz\n  Live Cream Volume II 192,000 Hz\n  Heavy Cream 192,000 hz\n  \n  Although Cream was only together for a little more than two years, their influence was immense, both during their late-'60s peak and in the years following their breakup. Cream was the first top group to truly exploit the power-trio format, in the process laying the foundation for much blues-rock and hard rock of the 1960s and 1970s. It was with Cream, too, that guitarist Eric Clapton truly became an international superstar. Critical revisionists have tagged the band as overrated, citing the musicians' emphasis upon flash, virtuosity, and showmanship at the expense of taste and focus. This was sometimes true of their live shows in particular, but in reality the best of their studio recordings were excellent fusions of blues, pop, and psychedelia, with concise original material outnumbering the bloated blues jams and overlong solos.\n\n  Cream could be viewed as the first rock supergroup to become superstars, although none of the three members were that well-known when the band formed in mid-1966. Eric Clapton had the biggest reputation, having established himself as a guitar hero first with the Yardbirds, and then in a more blues-intensive environment with John Mayall's Bluesbreakers. (In the States, however, he was all but unknown, having left the Yardbirds before &quot;For Your Love&quot; made the American Top Ten.) Bassist/singer Jack Bruce and drummer Ginger Baker had both been in the Graham Bond Organisation, an underrated British R&amp;B combo that drew extensively upon the jazz backgrounds of the musicians. Bruce had also been, very briefly, a member of the Bluesbreakers along Clapton, and also briefly a member of Manfred Mann when he became especially eager to pay the rent.\n\n  All three of the musicians yearned to break free of the confines of the standard rock/R&amp;B/blues group, in a unit that would allow them greater instrumental and improvisational freedom, somewhat in the mold of a jazz outfit. Eric Clapton's stunning guitar solos would get much of the adulation, yet Bruce was at least as responsible for shaping the group's sound, singing most of the material in his rich voice. He also wrote their best original compositions, sometimes in collaboration with outside lyricist Pete Brown.\n\n~ Greets ~\n\nMy mates: sundox, eppo, Murlok, Wildcard, caylus, krosis, togachu, sid, chew, random, suzi, stepherd, HTorrentz, and findy.\n\nMy fellow uploaders: SmashAndGrab, DicktheSpic, KitLope, Ausy, Bubanee, eika256, horrorhound, zombiRG, HiGH\n\nThe TPB Crew and to anyone who downloads, seeds, and enjoys good music.","torrent":{"xt":"urn:btih:40fff35db7a8f6988ddaa112e0bc48402b933bbf","amp;dn":"Cream+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40fff35db7a8f6988ddaa112e0bc48402b933bbf","infoHashBuffer":{"type":"Buffer","data":[64,255,243,93,183,168,246,152,141,218,161,18,224,188,72,64,43,147,59,191]},"announce":[],"urlList":[]}}