{"title":"Scout (Eclipse)","uid":8831042,"size":602273752,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:41a5595f9653ecd85c24e2aeb3a15cef2dcec529&amp;dn=Scout+%28Eclipse%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ichthypod_Crane","files":55,"time":1376981128,"description":"Next up for the ECUP is Scout, by the excellent Timothy Truman! The wonderful world of Wiki says:\n\nScout is a comic book series starting in 1985 by American writer, artist and musician Timothy Truman. It was published by Eclipse Comics.\n\nThe story stars a Native American Apache named Emanuel Santana. The setting of the series was a chaotic United States.\n\nTwenty-four issues of the first series were published.\n\nAfter the series ended, a short comic featuring Santana's marriage ceremony was published inside Timothy Truman's first album release entitled Marauder by his band The Dixie Pistols.\n\nTwo mini-series were published that 'bridged the gap' between the two Scout series: New America and Swords of Texas, each 4 issues long. While Truman oversaw them, others wrote and drew them. A one-shot 'Scout Handbook' was also published. A new series entitled Scout: War Shaman continued Santana's adventures after having two children and being widowed. The series ended with issue #16, after Scout is killed. \n\nThis torrent includes all the Scout listed above (except the one from the album), AS WELL AS a six-issue mini that Truman did with his son, Benjamin, called 'Hawken'. Please note that Hawken has nothing to do with Scout, but it's Tim Truman and it's a bit of alright, so in did I chuck it.\n\nGet it, seed it! Many thanks to the creators and scanners!","torrent":{"xt":"urn:btih:41a5595f9653ecd85c24e2aeb3a15cef2dcec529","amp;dn":"Scout+%28Eclipse%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41a5595f9653ecd85c24e2aeb3a15cef2dcec529","infoHashBuffer":{"type":"Buffer","data":[65,165,89,95,150,83,236,216,92,36,226,174,179,161,92,239,45,206,197,41]},"announce":[],"urlList":[]}}