{"title":"The Noble Approach Maurice Noble and the Zen of Animation Design","uid":11052347,"size":23469530,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41fe3e6f8721a62e80592943275e5eb0d3e9ff82&amp;dn=The+Noble+Approach+Maurice+Noble+and+the+Zen+of+Animation+Design&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1411050382,"description":"This extraordinary volume examines the life and animation philosophy of Maurice Noble, the noted American animation background artist and layout designer whose contributions to the industry span more than 60 years and include such cartoon classics as Duck Dodgers in the 24 Â½th Century, What's Opera, Doc?, and The Road Runner Show. Revered throughout the animation world, his work serves as a foundation and reference point for the current generation of animators, story artists, and designers. Written by Noble's longtime friend and colleague Tod Polson and based on the draft manuscript Noble worked on in the years before his death, this illuminating book passes on his approach to animation design from concept to final frame, illustrated with sketches and stunning original artwork spanning the full breadth of his career.\n\n\nPublisher: Chronicle Books (October 1, 2013)\nLanguage: English\nISBN-10: 1452102945\nISBN-13: 978-1452102948\n\nEditorial Reviews\nReview\n&quot; an exquisitely designed art book...The Noble Approach: Maurice Noble and the Zen of Animation Design is a truly essential book that belongs in every animator's and animation fan's library.&quot;\n- AnimationWorld\n\nHoliday Gift Guide Pick- Ain't It Cool News\n\nHoliday Gift Guide Pick\n-Entertainment Weekly\n\n&quot;one of the best animation books of the year...a fantastic look at the master artist's inspiring work process, providing a rich collection of artwork, notes, lovely anecdotes and valuable lessons about creating timeless toons.&quot;\n- Animation Magazine\n\n&quot;The Noble Approach: Maurice Noble and the Zen of Animation Design ranks among the most unique and delightful animation books in recent memory. It goes without saying that the book's well-balanced mix of technical tips and anecdotal advice makes it a must-buy title for professional artists and students, but it should also appeal to fans of classic of animation who will surely gain a renewed appreciation for the Chuck Jones canon.&quot;\n- Cartoon Brew\n\n&quot;'I've used the term &quot;must-have&quot; before - but I compel every one of you reading this site and this review to order this book immediately. You will not regret it.&quot;\n-Cartoon Research\nAbout the Author\nTod Polson first studied design at Otis/Parsons, and animation at CalArts before apprenticing under pioneering animation designer Maurice Noble. Since then, he has worked extensively as a filmmaker, designer, and teacher. He lives in Wyoming. \n\n","torrent":{"xt":"urn:btih:41fe3e6f8721a62e80592943275e5eb0d3e9ff82","amp;dn":"The+Noble+Approach+Maurice+Noble+and+the+Zen+of+Animation+Design","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41fe3e6f8721a62e80592943275e5eb0d3e9ff82","infoHashBuffer":{"type":"Buffer","data":[65,254,62,111,135,33,166,46,128,89,41,67,39,94,94,176,211,233,255,130]},"announce":[],"urlList":[]}}