{"title":"Coast to Coast AM April 07 2013","uid":8355140,"size":56957817,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:42c510ce437553ccb44e85b6684c5a335611b68f&amp;dn=Coast+to+Coast+AM+April+07+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1365470610,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t04-07-13\nHost: \tGeorge Noory\nGuests: \tDr. Joe Gallenberger, Jerome Corsi\n\nClinical psychologist with a deep interest in psychokinesis, Joseph Gallenberger, discussed how we can use psychic energy to effect and change our realities, and create the circumstances we need or want. He spoke about his involvement with the Monroe Institute and their Hemi-Sync technology, an auditory stimulation system which helps to synchronize the two brain hemispheres, and facilitate meditation, relaxation and other beneficial states depending on the frequency settings.\n\nOut of these focused meditative states, Gallenberger discovered he could do healing intention, as well as psychokinesis (PK), such as effecting the outcome of a dice roll. He experimented with his abilities to influence matter at casinos in Las Vegas primarily through dice games, and reported that he was quite successful. &quot;The type of energy we want to build for psychokinesis is wide-open heart, grounded to the earth, in touch with spirit, feeling one with everything, feeling really good,&quot; he noted, but most people approach casino games feeling greed and fear, and end up getting the exact opposite of what they want.\n\nBeyond the gaming aspect, the idea of being able to project energy to manifest is very useful in such areas as relationships, finances, and health, he remarked. PK and psychic ability have been scientifically proven such as by studies at Princeton, but mainstream science continues to doubt, &quot;because we don't have the smoking gun, the causal chain-- there is resistance,&quot; as well close-minded professional skeptics that have the ear of the media and the government, he commented.\nACLU Critique\n\nFirst hour guest, author Jerome Corsi spoke about his new book Bad Samaritans which deals with the ACLU's effort to separate church and state. The organization is determined to remove God from all aspects of American society, &quot;which ends up being a complete perversion of the 1st amendment,&quot; he argued. The Founding Fathers spoke of freedom of religion in the Bill of Rights, not freedom from religion, he continued.\n\nNews segment guests: Ryan Mauro, Dr. Leonard Horowitz\nWebsite(s):\n\n    synccreation.com\n    1776nation.ning.com\n\nBook(s):\n\n    Inner Vegas: Creating Miracles, Abundance, and Health\n    Bad Samaritans\n\n","torrent":{"xt":"urn:btih:42c510ce437553ccb44e85b6684c5a335611b68f","amp;dn":"Coast+to+Coast+AM+April+07+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42c510ce437553ccb44e85b6684c5a335611b68f","infoHashBuffer":{"type":"Buffer","data":[66,197,16,206,67,117,83,204,180,78,133,182,104,76,90,51,86,17,182,143]},"announce":[],"urlList":[]}}