{"title":"Langford's Advanced Photography, Eighth Edition (2011)","uid":6798142,"size":49210655,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:430952269b0aded8cabbbbb75d968a531d0b8251&amp;dn=++Langford%5C%27s+Advanced+Photography%2C+Eighth+Edition+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"freaktorrent07","files":-1,"time":1320537605,"description":" Langford's Advanced Photography, Eighth Edition: The guide for Aspiring Photographers (The Langford Series.\n\n\nLangford's Advanced Photography is the only advanced photography guide a serious student or aspiring professional will ever need. In this eighth edition, Efthimia Bilissi continues in the footsteps of Michael Langford by combining an unrivalled level of technical detail with a straightforward writing style while simultaneously bringing the text firmly in to the digital era. This book covers the entire photographic process from a technical standpoint - not only detailing the 'how' but also explaining the 'why' that is so often missing from photography texts. From the workings of cameras, lenses, digital imaging sensors and software to new hot topics such as HDR imaging, digital asset management, and even running your own photographyÃ‚Â business, everything a serious photographer could need to extend their art into professional realms is covered. The book also benefits from a full glossary, charts and inspirational full color images throughout, with summaries and projects at the end of each chapter to reinforce the theory.\n\nKey Features * Highly respected guide for serious photographers wanting to advance their skills, now in its 8th edition * Fully updated to cover new digital technologies and methodolgies, from HDR imaging to digital asset management and even running your own photography business * The ONLY comprehensive guide to photography at an advanced level for the serious amateur, student or training professional.\n\n\n \t\nAuthor(s):\tEfthimia Bilissi\nPublisher:\tFocal Press\nDate:\t        2011-03-24\nPages:\t        496\t\nFormat:   \tPDF\nISBN10: \t0240521919\nISBN13: \t9780240521916\n","torrent":{"xt":"urn:btih:430952269b0aded8cabbbbb75d968a531d0b8251","amp;dn":"++Langford%5C%27s+Advanced+Photography%2C+Eighth+Edition+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"430952269b0aded8cabbbbb75d968a531d0b8251","infoHashBuffer":{"type":"Buffer","data":[67,9,82,38,155,10,222,216,202,187,187,183,93,150,138,83,29,11,130,81]},"announce":[],"urlList":[]}}