{"title":"Baby Rosemary (Howard Perkins, Vinegar Syndrome) XXX 1976 DVDRip","uid":13088317,"size":795142212,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:442ddff47da4bc02b55e13cf2a13d4ac5087e5aa&amp;dn=Baby+Rosemary+%28Howard+Perkins%2C+Vinegar+Syndrome%29+XXX+1976+DVDRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EndYou","files":1,"time":1450991803,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/album/U3\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nYear: 1976\r\nCountry: USA\r\nGenre: Classic, Feature\r\nDuration: 1:19:44\r\nEnglish language\r\nDirector: Howard Perkins\r\nStudio: Vinegar Syndrome\r\n\r\nJon Martin, Christine De Shaffer, Brigit Olsen, Desiree Cousteau, Mandy Ashley, Sharon Kane, Juliet Anderson.\r\n\r\nThis is one of those 1970's porno films that achieves a level of nihilistic misanthropy and general malaise rarely seen outside of an Italian cannibal film (which is actually why I watched it - it sure was not for the thoroughly unattractive performers and unappealing sex scenes ). It's kind of hardcore version of the ultra-depressing sexploitation film &quot;Toys Are Not for Children&quot;. They should show it to sex offenders because it will make them want to castrate themselves with a rusty kitchen knife (or at the very least put them off sex for awhile).\r\nAs in &quot;Toys&quot; the movie is about a young woman who is obsessed with the father who abandoned her to a brutal orphanage. This leads her as an adult to seek out sexually abusive relationships with men including an associate of her father's who violently rapes her the first time they meet. Meanwhile, she neglects her nice guy boyfriend, who takes up with a skanky prostitute and turns into quite a misogynist himself. But this film is not only about misogyny, it's also about necrophilia, including, not just one, but two orgies set in a funeral home. The ending is not as much of a surprise, but is every bit the brutal punch-to-the-gut of &quot;Toys&quot; or its most famous hardcore contemporary &quot;The Devil in Miss Jones&quot;. The violence towards women is pretty disturbing frankly, but it's obviously meant to be disturbing, which actually makes it LESS disturbing than true sicko porn films like those of Sean Costello or Zebedy Colt. And the audience sympathy here is always with the woman rather than the abusive males.\r\nIf you're like me and you really hate &quot;feel-good&quot; romantic comedies, you should seek this out as it is the EXACT opposite - a &quot;feel-bad&quot; roughie hardcore porno movie. God knows, the world needs that sometimes too\r\n\r\nQuality of video: DVDRip\r\nVideo Format: MP4\r\nVideo: H.264 / AVC 4/3 25,000 fps 720x480 1200 kbps\r\nAudio: AAC Dolby Digital, 48.1Hz, 2ch, of 128 kbps","torrent":{"xt":"urn:btih:442ddff47da4bc02b55e13cf2a13d4ac5087e5aa","amp;dn":"Baby+Rosemary+%28Howard+Perkins%2C+Vinegar+Syndrome%29+XXX+1976+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"442ddff47da4bc02b55e13cf2a13d4ac5087e5aa","infoHashBuffer":{"type":"Buffer","data":[68,45,223,244,125,164,188,2,181,94,19,207,42,19,212,172,80,135,229,170]},"announce":[],"urlList":[]}}