{"title":"The Transmission of Culture in Early Modern Europe Anthony Graft","uid":9602877,"size":5797260,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:44e42f46628865c527593fd56c04108fd2d4c9f4&amp;dn=The+Transmission+of+Culture+in+Early+Modern+Europe+Anthony+Graft&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"perseu","files":-1,"time":1392152638,"description":"\n&quot;The Transmission of Culture in Early Modern Europe&quot; focuses\non the ways in which culture is moved from one generation or\ngroup to another, not by exact replication but by accretion\nor revision. The contributors to the volume each consider\nhow the passing of historical information is an organic\nprocess that allows for the transformation of previously\naccepted truth.The volume covers a broad and fascinating\nscope of subjects presented by leading scholars. Anthony\nGrafton's contribution on the fifteenth-century forger Annius\nof Viterbo emphasizes the role of imagination in the classical\nrevival; Lisa Jardine demonstrates the way in which Erasmus\nhelped turn a technical and rebarbative book by Rudolph\nAgricola into a sixteenth-century success story; Alan Charles\nKors finds the roots of Enlightenment atheism in the works of\nFrench Catholic theologians; Donald R. Kelley follows the\nlegal idea of &quot;custom&quot; from its formulation by the ancients\nto its assimilation into the modern social sciences; and\nLawrence Stone shows how changes in legal action against\nfemale adultery between 1670 and 1857 reflect basic shifts\nin English moral values.\n\nThe Transmission of Culture in Early Modern Europe\nAnthony Grafton\nISBN13: 9780812216677\nFormat: PDF\nLanguage: EN\nPages: 335","torrent":{"xt":"urn:btih:44e42f46628865c527593fd56c04108fd2d4c9f4","amp;dn":"The+Transmission+of+Culture+in+Early+Modern+Europe+Anthony+Graft","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44e42f46628865c527593fd56c04108fd2d4c9f4","infoHashBuffer":{"type":"Buffer","data":[68,228,47,70,98,136,101,197,39,89,63,213,108,4,16,143,210,212,201,244]},"announce":[],"urlList":[]}}