{"title":"Peter Murphy - Deep[FLAC - LOSSLESS]","uid":3840830,"size":367624937,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:454cea4470c213171a525f3eaf1c886fe979e975&amp;dn=Peter+Murphy+-+Deep%5BFLAC+-+LOSSLESS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"99AM","files":16,"time":1192302390,"description":"FLAC files + CUE sheet + covers\nReleased in 1990\n\n\nTrack Listing:\n1. Deep Ocean Vast Sea\n2. Shy\n3. Crystal Wrists\n4. Marlene Dietrich&amp;#039;s Favourite Poem\n5. Seven Veils\n6. The Line Between the Devil&amp;#039;s Teeth (And That Which Cannot Be Repeat)\n7. Cuts You Up\n8. A Strange Kind of Love (version One)\n9. Roll Call\n10. Roll Call (reprise)\n\nReview from AMG:\nPerhaps the stars were right, or perhaps his American company, flush from the unexpected success of Murphy&amp;#039;s former bandmates in Love and Rockets, just decided to give Murphy a well-deserved publicity push. Whatever it was, with Deep Murphy scored an honest to goodness American radio/MTV hit thanks to the tender, lively &quot;Cuts You Up,&quot; a love song with solid energy and an inspired vocal. It was a perfect calling card for the album as a whole, with Murphy in excelsis throughout and his Hundred Men providing everything from the lush, acoustic guitar wash of &quot;Marlene Dietrich&amp;#039;s Favorite Poem&quot; to the stripped-down Arabic-tinged funk/hip-hop punch of the commanding &quot;Roll Call.&quot; Through it all, Murphy simply sounds like he&amp;#039;s having the time of his life, singing both for the sheer joy of it and for the dramatic power of his commanding voice. He&amp;#039;s even comfortable enough to do an open rewrite of Bauhaus&amp;#039; &quot;In the Flat Field,&quot; renamed &quot;The Line Between the Devil&amp;#039;s Teeth&quot;; it has almost the same verse structure, definitely some of the same lyrics, but still, it&amp;#039;s something he could have only done in his solo days. Quite why nothing else on the album connected with the public as strongly as &quot;Cuts You Up&quot; is a mystery; its follow-up single, &quot;A Strange Kind of Love,&quot; was a striking love song, with acoustic guitar and plaintive Statham keyboards supporting one of Murphy&amp;#039;s strongest lyrics and performances. Regardless, Deep showed Murphy balancing mass appeal and his own distinct art with perfection.\n\n\nEnjoy!\n","torrent":{"xt":"urn:btih:454cea4470c213171a525f3eaf1c886fe979e975","amp;dn":"Peter+Murphy+-+Deep%5BFLAC+-+LOSSLESS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"454cea4470c213171a525f3eaf1c886fe979e975","infoHashBuffer":{"type":"Buffer","data":[69,76,234,68,112,194,19,23,26,82,95,62,175,28,136,111,233,121,233,117]},"announce":[],"urlList":[]}}