{"title":"Cynthia Lennon - John","uid":4556863,"size":357436566,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4637eda73cbf25af8d84c46011d639fa0d962002&amp;dn=Cynthia+Lennon+-+John&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"g-roid","files":-1,"time":1228513335,"description":"John\nby Cynthia Lennon\n\nThe Extraordinary Story of a Man, a Legend and a Marriage.\n\nWhen she was eighteen years old, a girl named Cynthia Powell met a boy named John Lennon and they fell in love. Their ten-year relationship coincided with the start of the Beatles phenomenon-from Liverpool's dockside clubs to the dizzying worldwide fame that followed. And Cynthia Lennon, John's first wife, was an integral part of the swirl of events that are now an indelible part of the history of rock and roll.\n\nCynthia has seldom talked in any detail about her marriage and the painful events that followed John's tragic assassination in 1980. Now she candidly reveals the good and the had, the loving and the cruel sides of John. She tells of the breakdown of their marriage and the beginning of his relationship with Yoko Ono in more detail than has ever been disclosed before and documents the difficulties that estrangement from John-and his subsequent death-brought for herself and their son, Julian. \n\nIn John, Cynthia Lennon has created a vivid portrait of the 1960s, the Beatles and the man she never stopped loving.\n\nCYNTHIA LENNON was born in Blackpool, England, in 1939. While attending the Liverpool College of Art she met John Lennon, whose rebellious style, caustic wit and passion for rock and roll already marked him as someone different. John and Cynthia married in 1962 and their son, Julian, was horn in 1963. The Lennons were divorced in 1969. Cynthia retained custody of Julian, who saw his father sporadically until John was killed in 1980. In the years since, Cynthia has been a restaurateur, a designer and a television personality. She now lives in Spain with her husband, Noel Charles. \n\nThis Abridgment is read by and approved by the Author.\n5 hours From 4 compact discs, in MP3 format.\n\nThis is a great story whether or not you like the Beatles.","torrent":{"xt":"urn:btih:4637eda73cbf25af8d84c46011d639fa0d962002","amp;dn":"Cynthia+Lennon+-+John","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4637eda73cbf25af8d84c46011d639fa0d962002","infoHashBuffer":{"type":"Buffer","data":[70,55,237,167,60,191,37,175,141,132,196,96,17,214,57,250,13,150,32,2]},"announce":[],"urlList":[]}}