{"title":"Risk and Safety Analysis of Nuclear Systems","uid":12691265,"size":33233490,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:46954a27c7a7298bcb3c1eae78571fd5eacfc2ce&amp;dn=Risk+and+Safety+Analysis+of+Nuclear+Systems&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1446674917,"description":"Risk and Safety Analysis of Nuclear Systems - John C. Lee , Norman J. McCormick (Wiley, 2011).pdf\r\n\r\nISBN 9780470907566\r\n\r\nThe book has been developed in conjunction with NERS 462, a course offered every year to seniors and graduate students in the University of Michigan NERS program. The first half of the book covers the principles of risk analysis, the techniques used to develop and update a reliability data base, the reliability of multi-component systems, Markov methods used to analyze the unavailability of systems with repairs, fault trees and event trees used in probabilistic risk assessments (PRAs), and failure modes of systems. All of this material is general enough that it could be used in non-nuclear applications, although there is an emphasis placed on the analysis of nuclear systems. The second half of the book covers the safety analysis of nuclear energy systems, an analysis of major accidents and incidents that occurred in commercial nuclear plants, applications of PRA techniques to the safety analysis of nuclear power plants (focusing on a major PRA study for five nuclear power plants), practical PRA examples, and emerging techniques in the structure of dynamic event trees and fault trees that can provide a more realistic representation of complex sequences of events. The book concludes with a discussion on passive safety features of advanced nuclear energy systems under development and approaches taken for risk-informed regulations for nuclear plants","torrent":{"xt":"urn:btih:46954a27c7a7298bcb3c1eae78571fd5eacfc2ce","amp;dn":"Risk+and+Safety+Analysis+of+Nuclear+Systems","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46954a27c7a7298bcb3c1eae78571fd5eacfc2ce","infoHashBuffer":{"type":"Buffer","data":[70,149,74,39,199,167,41,139,203,60,30,174,120,87,31,213,234,207,194,206]},"announce":[],"urlList":[]}}