{"title":"Inside WikiLeaks - Daniel Domscheit-Berg","uid":13460285,"size":2767767,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48154f659433664328c7e7facbaa376221544bd5&amp;dn=Inside+WikiLeaks+-+Daniel+Domscheit-Berg&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1454883698,"description":"Since its launch in 2006, WikiLeaks has rapidly grown into the most powerful and influential whistleblowing organisation ever. Its status as a repository and publisher of leaked sensitive and confidential governmental, corporate, organisational or religious documents while preserving the anonymity and untraceability of its contributors, and the statements and behaviour of its leader Julian Assange have made WikiLeaks both daily front page news and a topic of enormous controversy.\r\n\r\nIn an eye-opening account, Daniel Domscheit-Berg, who joined WikiLeaks in its early days and became its spokesman, reveals never-disclosed details about the inner workings of the organisation that has struck fear into governments and businesses worldwide and prompted the Pentagon to convene a 120-man investigative task force. He also provides a remarkably up-close portrait of Julian Assange himself.\r\n\r\nUnder the pseudonym Daniel Schmitt, Domscheit-Berg was the effective No. 2 at WikiLeaks and its most public face after Assange. In this book, he tells the backstories of leaks ranging from the Church of Scientology and the Afghanistan and Iraq War logs to Cablegate, and reveals the evolution, finances and inner tensions of the whistleblower organisation, beginning with his first meeting with Assange in December 2007. He also describes what led to his September 2010 withdrawal from WikiLeaks, including his disenchantment with its lack of transparency, its abandonment of political neutrality, and Assange's increasing concentration of power.\r\n\r\nWhat has been made public so far about WikiLeaks is only a small fraction of the truth. With his insider knowledge, Domscheit-Berg is uniquely able to tell the full story","torrent":{"xt":"urn:btih:48154f659433664328c7e7facbaa376221544bd5","amp;dn":"Inside+WikiLeaks+-+Daniel+Domscheit-Berg","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48154f659433664328c7e7facbaa376221544bd5","infoHashBuffer":{"type":"Buffer","data":[72,21,79,101,148,51,102,67,40,199,231,250,203,170,55,98,33,84,75,213]},"announce":[],"urlList":[]}}