{"title":"Violence and Serenity - Late Buddhist Sculpture from Indonesia","uid":12873534,"size":10345357,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48a779204f9519826c875ea382a3970fad6318fa&amp;dn=Violence+and+Serenity+-+Late+Buddhist+Sculpture+from+Indonesia&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1448919852,"description":"2007 | Pdf | Eng | 289 pages | ISBN 0824829247 | 10 MB\r\n\r\nThe mention of Buddhism in Indonesia calls to mind for many people the Central Javanese monument of Borobudur, one of the largest Buddhist monuments in the world and the subject of extensive scholarly scrutiny. The neglect of scholarship on Buddhist art from later periods might lead one to assume that after the tenth century Buddhism had been completely eclipsed by the predominantly Hindu Eastern Javanese dynasties. Yet, as the works discussed here illustrate, extraordinary Buddhist images were still being produced as late as the fourteenth century. Violence and Serenity offers a close examination of some of the impressive works from East Java and Sumatra and explores their political and religious roles.The number of clearly identifiable Buddhist works from the Singasari and Majapahit dynasties (1222-ca. 1520) is limited, yet existing examples are impressive. They demonstrate a remarkable level of craftsmanship and are exceptionally expressive, exhibiting a range of emotions from the ferocious to the serene. Following a brief discussion of the early history of Buddhism in Indonesia, Natasha Reichle focuses each chapter on a specific statue or group of statues and considers the larger issues evoked by the images. Through a rarely examined depiction of the last Singasari king, she explores the nature of religion in Java in the late thirteenth century and what we know about tantric practices and the syncretism of Hinduism and Buddhism. She reassesses the question of portraiture in ancient Javanese art while contemplating the famous Praj?pramit from Singasari. Notions of kingship are discussed in light of a number of statues depicting the Buddhist deity Amoghapa and his attendants and the meanings of the Amoghapa maala. The final chapter examines the origins and significance of one of Indonesia's most spectacular sculptures, a four-meter-high Buddhist bhairava (demon) discovered in West Sumatra.Combining art history, religion, and literary studies, Violence and Serenity is an extensively illustrated and thoroughly original look at the ways in which the spheres of religion and politics intersected in ancient Indonesia","torrent":{"xt":"urn:btih:48a779204f9519826c875ea382a3970fad6318fa","amp;dn":"Violence+and+Serenity+-+Late+Buddhist+Sculpture+from+Indonesia","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48a779204f9519826c875ea382a3970fad6318fa","infoHashBuffer":{"type":"Buffer","data":[72,167,121,32,79,149,25,130,108,135,94,163,130,163,151,15,173,99,24,250]},"announce":[],"urlList":[]}}