{"title":"Gang Of Four - The Peel Sessions CD 1990 (FLAC)","uid":4736571,"size":251816387,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4a7de2d535f69be1f06a28d45b32f865a7e8f7d6&amp;dn=Gang+Of+Four+-+The+Peel+Sessions+CD+1990+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bootycall88","files":11,"time":1235319570,"description":"Review from All Music Guide:\n\n\nIn later years, some bandmembers claimed that the best Gang of Four album of all was, in fact, this collection of three separate sessions from 1979 and 1981. It's little surprise why -- recorded with brisk, blunt immediacy, Peel Sessions is both a showcase for the band's sheer power and amazing transformation of funk and punk for its own virulent ends, with all three sessions featuring the full original lineup. Good production from Bob Sargeant, who produced all tracks except the last three, helps immensely, while there's no track repetition at all. A gripping version of &quot;I Found That Essence Rare&quot; begins the collection, Andy Gill's guitar slashing like a vicious weapon and Jon King's vocals getting even more wired and intense as the song continues. As for the Dave Allen/Hugo Burnham rhythm section, it sounds like it could beat down walls. From there, Peel Sessions serves up one highlight after another. Also from the first session, &quot;Return the Gift&quot; builds to a powerful climax, King's plaintive call &quot;Please send me evenings and weekends&quot; echoing into the distance, while &quot;At Home's He's a Tourist&quot; is stripped-down aggression at its finest. On the second session, &quot;Natural's Not in It&quot; is the standout, featuring some of Burnham's best drumming ever, while Gill's clipped riff gets a deservedly strong performance. King's singing sends everything over the top, while his work on &quot;Ether&quot; is equally strong, balanced between collapsing quaver, simmering outrage, and smooth passion (consider his delivery of the final &quot;white noise in a white room&quot; in the midsong break). His occasional melodica, as heard on &quot;Not Great Men,&quot; adds to the performances nicely. As for the last session, the murky, dislocated performance of &quot;History's Bunk&quot; makes for a fascinating, weird listen, while &quot;To Hell With Poverty&quot; tops things off with some brutal disco.\n\n\nVery hard to find &amp; here for you in fabulous Flac. \n\nLove to hear your comments. Enjoy!","torrent":{"xt":"urn:btih:4a7de2d535f69be1f06a28d45b32f865a7e8f7d6","amp;dn":"Gang+Of+Four+-+The+Peel+Sessions+CD+1990+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a7de2d535f69be1f06a28d45b32f865a7e8f7d6","infoHashBuffer":{"type":"Buffer","data":[74,125,226,213,53,246,155,225,240,106,40,212,91,50,248,101,167,232,247,214]},"announce":[],"urlList":[]}}