{"title":"Sharks, Terrors of the Deep 2.0","uid":9809723,"size":4211669,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4aed7aca7c61228a54814aa5f7e5e19dea4e0771&amp;dn=Sharks%2C+Terrors+of+the+Deep+2.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LEO33-AL","files":-1,"time":1395506277,"description":"Original description: Sharks, Terrors of the Deep 2.0 is the second product released by Prolific Publishing, Inc. in the new LifeGlobe product line. Building upon and improving the technology first demonstrated in Marine Aquarium, Sharks, Terrors of the Deep demonstrates the latest look and capabilities of your computer. Dynamic backgrounds, realistic movement, and amazing animation are the latest enhancements to this visually stunning line of Entertainment Software. It must be downloaded and seen to be believed. This is the perfect product for the customer who demands the best!\n\nBe one of the first to install this revolutionary new product on your computer. Sharks, Terrors of the Deep 2.0 includes 11 species of your favorite sharks in three different scenes. The &quot;Open Water&quot; tank allows free movement of the sharks around your position and you will swear you feel those massive tails brush you as they cruise by for an inspection. The &quot;Reef tank&quot; features our menacing sharks circling in an underwater reef complete with a sunken statue, reef fish, and perhaps a few other surprises.\n\nVersion 2.0 features two completely new tanks for a total eight scenes. The Manta Ray makes its debut in our latest release, and stand back as the Great White swims past.\n\n\n\n\nInstall instructions: Just install the program and use the provided serial. Done!","torrent":{"xt":"urn:btih:4aed7aca7c61228a54814aa5f7e5e19dea4e0771","amp;dn":"Sharks%2C+Terrors+of+the+Deep+2.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aed7aca7c61228a54814aa5f7e5e19dea4e0771","infoHashBuffer":{"type":"Buffer","data":[74,237,122,202,124,97,34,138,84,129,74,165,247,229,225,157,234,78,7,113]},"announce":[],"urlList":[]}}