{"title":"SwitchResX 3.8.6 [UB] + [SN]","uid":4888640,"size":4915488,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:4c04732ed20630fe8b8036f7e53b9780be3988f8&amp;dn=SwitchResX+3.8.6+%5BUB%5D+%2B+%5BSN%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1241859905,"description":"Web site; http://madrau.com/html/SRX/About.html\n\nThis software requires and installs APE / Application Enhancer by Unsanity. which is included in the installer.\n\nInstalled and tested... working fine on PPC/G4 Tiger/10.4.11.\n\nQuote:\nSwitchResX is a tool designed to manage resolutions of all your monitors. Here's a quick summary:\nAs standard features: it gives you access to most of your monitor settings within its customizable menus (in the Menu Bar or on the Finder Desktop with a Contextual Menu Plugin). SwitchResX incorporates features relative to the Monitor Resolution, Color Depth, Video Mirroring, Display Rotation, Display Overscan into one single utility.\n\nOther useful features include saving desktop layout, ie positions of the icons on the desktop and positions of the windows of all open applications, and restore them automatically when the resolution is changed or when you plug or unplug an external monitor.\n\nYou can disable or deactivate a monitor without having to physically unplug it, allowing you to use a laptop in clamshell mode with external monitor, keyboard and mouse.\n\nSpecialized features allow you to link your monitor settings with system events: Key shortcut pressed, Apple scripts, Application launched.\n\nAdvanced features lets you enable more resolutions, or even create new resolutions for your monitor, HDTV, Plasma screen or Video Projector. This advanced feature is very powerful for users requesting complete control over their display resolution.\n\nTo register use to context menu a few times to change the resolution of the monitor, and after about the third time a message will appear on the left side of the screen that the product is not registered.  go to the general tab, and click on the logo, then use the name and serial number in the SN number file.","torrent":{"xt":"urn:btih:4c04732ed20630fe8b8036f7e53b9780be3988f8","amp;dn":"SwitchResX+3.8.6+%5BUB%5D+%2B+%5BSN%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c04732ed20630fe8b8036f7e53b9780be3988f8","infoHashBuffer":{"type":"Buffer","data":[76,4,115,46,210,6,48,254,139,128,54,247,229,59,151,128,190,57,136,248]},"announce":[],"urlList":[]}}