{"title":"Fury of Firestorm [1982-1987] (Catseye2001) [h33t]","uid":4106052,"size":822362881,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4c212e8eff9afaec3a8bc581bd38b6ad1b633bdf&amp;dn=Fury+of+Firestorm+%5B1982-1987%5D+%28Catseye2001%29+%5Bh33t%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Catseye2001","files":69,"time":1206812311,"description":"More Firestorm. This is the Fury of Firestorm series, which ran for 64 issues and 4 annuals. I will upload Firestorm the Nuclear Man next, which picks up with issue #65 and runs to issue #110, plus one annual.\n\nSnipped from Wikipedia:  Writer Conway added Firestorm to the roster of Justice League of America. This led to a series of 8-page stories in the back of The Flash (with art by George PÃƒÂ©rez), and a revival of a monthly Firestorm comic in 1982.\n\nThe monthly series, written initially by Conway and drawn mainly by Pat Broderick and Rafael Kayanan, slowly developed the lives of Raymond and Stein, as the teenager struggled with high school and moved towards graduation and the scientist found a life outside the lab. A second nuclear hero, Firehawk, was added as a love interest for Firestorm in 1984. The series also tried to create a sense of fun, something that Conway felt was missing during his years writing Spider-Man; the banter between Ronald Raymond and Martin Stein contributed to this. Upon graduation from high school, Raymond entered college in Pittsburgh, where Stein had been hired as a professor.\n\nFirestorm&amp;#039;s list of enemies included such generally forgotten foes as the Hyena, Zuggernaut, Typhoon, and Black Bison. One Firestorm enemy, Plastique, would later play a major role in DC&amp;#039;s Captain Atom; she later reformed and married him. He also fought Killer Frost, who was forced by the Psycho-Pirate to fall in love with him during the Crisis on Infinite Earths.\n\nIn 1986, Conway abruptly left the series, and John Ostrander (with artist Joe Brozowski) took over the reins. Ostrander, a more politically aware writer, sought to make Firestorm more relevant to the world and a good deal grittier. His first major story arc pitted Firestorm against the world, as the hero (acting on a suggestion from a terminally ill Prof. Stein) demanded the U.S. and the Soviet Union destroy all of their nuclear weapons. After tussles with the Justice League and most of his enemies, Firestorm faced off against a Russian nuclear man named Pozhar in the Nevada desert, where both had an atomic bomb dropped on them.\n\nWhen the smoke cleared, a new Firestorm was created who was made up of Raymond and the Russian, Mikhail Arkadin (the Russian superhero Pozhar), but controlled by the disembodied amnesiac mind of Prof. Stein. The stories featuring this version of the hero were highly political, with a good deal of action taking place in Mikhail Gorbachev&amp;#039;s Moscow.","torrent":{"xt":"urn:btih:4c212e8eff9afaec3a8bc581bd38b6ad1b633bdf","amp;dn":"Fury+of+Firestorm+%5B1982-1987%5D+%28Catseye2001%29+%5Bh33t%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c212e8eff9afaec3a8bc581bd38b6ad1b633bdf","infoHashBuffer":{"type":"Buffer","data":[76,33,46,142,255,154,250,236,58,139,197,129,189,56,182,173,27,99,59,223]},"announce":[],"urlList":[]}}