{"title":"The Anthony Cumia Show 2015-06-04 Fakeity Fake Fake MP4 MP3","uid":11991616,"size":282672455,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4c4a9acc3dbea34cba7328b7cd7d988fa3885d23&amp;dn=The+Anthony+Cumia+Show+2015-06-04+Fakeity+Fake+Fake+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1433526425,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\n\nEpisode 174 &quot;Fakeity Fake Fake&quot; -  This fine week ends with a lesson on what not to wear in front of a green screen, Ant discusses the documentary &quot;Vietnam in HD&quot;, history repeating itself, combat documentaries, he announces that Tom Shillue will be the new host of Red Eye, and we learn all about female Viagra. Ant talks about a boycott surrounding the possible NBC interview with Casey Anthony, we look at a great &quot;optic&quot; of Chris &quot;Humpty Dumpty&quot; Christie, go through a few political ruining clips, see Rick Perry announcing his run for President, watch a fake (fakity fake fake) video of an upset woman being photographed, one of a robbery/shooting, and the callers give their feedback. We watch a clip from the documentary &quot;Chosin&quot;, see Amy Schumer giving a speech after receiving an award, KtC chats about lawyers, the new studio, and the one year anniversary of TACS on August 4th. We hear some Chris Christie baseball names, Ant gets the REAL lowdown on TACS app, goes through a color coated piss chart, tells us about an upcoming live broadcast at Eternal Con on June 14th, reads about a student selfie assignment, and Jason Alexander and Howard Stern make an appearance on TACS.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nNew ups at: https://kat.cr/user/mothergoose58/uploads/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:4c4a9acc3dbea34cba7328b7cd7d988fa3885d23","amp;dn":"The+Anthony+Cumia+Show+2015-06-04+Fakeity+Fake+Fake+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c4a9acc3dbea34cba7328b7cd7d988fa3885d23","infoHashBuffer":{"type":"Buffer","data":[76,74,154,204,61,190,163,76,186,115,40,183,205,125,152,143,163,136,93,35]},"announce":[],"urlList":[]}}