{"title":"Hill of Squandered Valour: The Battle for Spion Kop, 1900 by Ron","uid":10651452,"size":4441587,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4cbe40f4e3c0ed71b03a55af80faf1d2f8655070&amp;dn=Hill+of+Squandered+Valour%3A+The+Battle+for+Spion+Kop%2C+1900+by+Ron&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":-1,"time":1406619691,"description":"Hardcover, 240 pages\nPublished November 25th 2011 by Casemate Publishers and Book Distributors\nISBN 161200007X (ISBN13: 9781612000077)\nedition languageEnglish\n\n\n\n\nThe Battle of Spion Kop was fought during the campaign to relieve Ladysmith, South Africa, after the Boers of the Transvaal and Orange Free State had gotten a jump on the British Empire and besieged a British army in the town. It was the single bloodiest episode in the campaign, as well as a harbinger of the bitter and desperate fighting still to come in the Second Boer War.Spion Kop, just northeast of Ladysmith, was the largest hill in the region, being over 1,400 feet high, and it lay almost exactly at the center of the Boer line. If the British could capture this position and bring artillery to the hill they would then command the flanks of the surrounding Boer positions.On the night of 23 January 1900, a large British force under Major General Edward Woodgate was dispatched to secure the height, with Lt. Colonel Alexander Thorneycroft selected to lead the initial assault. However, the Boers refused to give up the position and a bitter two days of fighting ensued. In the initial darkness the British mistakenly entrenched at the center of the hill instead of the crest, and suffered horribly from Boer marksmen clinging to the periphery. Suffering badly themselves, the Boers were finally inclined to admit defeat when they discovered that the British had retreated, leaving behind their many dead. Yet, in light of the devastation wrought on both sides, the British were finally able to rally and relieve Ladysmith four weeks later. Ron Lock, esteemed author of many Zulu warfare histories, brings to life this bitter and previously overlooked campaign in vivid and complete detail, with supporting sources including then-journalist Winston Churchill s battle report, as well as many previously unpublished illustrations and 6 newly commissioned maps. His account will be valuable to both historians and strategists wanting to better understand this difficult and devastating conflict.REVIEWS a wonderful addition to the bookshelves not only of enthusiasts in the Anglo-Boer War but anybody with an interest in military history. Guild of Battlefield Guides Member Tony Scott Ron Lock s well-researched book brings to life this bitter and somewhat overlooked battle in vivid and complete detail This account will be valuable to both historians and armchair generals wanting a better understanding of this difficult and devastating conflict. Military Modelcraft International Ron Lock has done his homework in compiling this history nicely presented Highly recommended Miniature Wargames a boon to anyone seeking a better understanding of the Boer War s intricacies, follies, ironies and pathos Toy Soldier and Model Figure Magazine well written, easy to read, and focuses on the British perspective of the battles involved and included much about the action and leadership of the Boers. It provided good focused context for anyone with ancestors involved with this campaign. Paul Milner, FGS FORUM..&quot;.an excellent read, well researched and incisive in his handling of the various protagonists involved. He succeeds in offering a fresh perspective&quot;Al Venter, Author of Barrel of a Gun, Iran's Nuclear Option, Gunship Ace, Mercaenaries, War Dog","torrent":{"xt":"urn:btih:4cbe40f4e3c0ed71b03a55af80faf1d2f8655070","amp;dn":"Hill+of+Squandered+Valour%3A+The+Battle+for+Spion+Kop%2C+1900+by+Ron","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cbe40f4e3c0ed71b03a55af80faf1d2f8655070","infoHashBuffer":{"type":"Buffer","data":[76,190,64,244,227,192,237,113,176,58,85,175,128,250,241,210,248,101,80,112]},"announce":[],"urlList":[]}}