{"title":"Daniel Powter - Bad Day","uid":4318019,"size":129523716,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4de6ad4b59dcfa74a8795bc99a86909e924358e9&amp;dn=Daniel+Powter+-+Bad+Day&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":1,"time":1217200410,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n&quot;Bad Day&quot; is a pop song written by Canadian singer Daniel Powter. It was released as the first single from his debut album Daniel Powter (2005) and reached number one on the Canadian Singles Chart; it was also successful in the United Kingdom, where it reached number two on the UK Singles Chart after it was used in an advertising campaign for Coca-Cola. In the United States, it reached number one on the Billboard Hot 100. The song grew in popularity in the United States when it was used in the fifth season of American Idol in the farewell video packages for eliminated contestants. The song was also the number 1 song of the year on the Billboard Hot 100. It was also featured in the compilation album Voices from the FIFA World Cup during the 2006 FIFA World Cup.\n\n&quot;Bad Day&quot; has been certified 2x platinum by the RIAA in the U.S. for digital sales of over 2 million, and it became the second-best-selling digital single of all time. The song was featured as a free download on the iTunes Store from August 2?9, 2005. It was nominated for a 2007 Grammy Award for &quot;Best Male Pop Vocal Performance&quot;.\n\nBillboard named &quot;Bad Day&quot; the No. 1 Hot 100 song of 2006.\n\nOn the 16th July 2008, it was revealed by BBC News that &quot;Bad Day&quot; was the most played song in the UK during the period 2003-2008.\n\nThe music video is directed by Marc Webb and features two single people, a male (Jason Adelman) and a female (Samaire Armstrong), waking and going about their daily schedule. The video shows this happening over a three-day period, but makes no distinction between the days. The main event is the two adding graffiti to the same wall, separately, on each day, culminating in the completion of a heart. At the end of the video, life mirrors the image created on the wall, with the boy offering the soaking wet girl a red umbrella in the pouring rain, as a cab stops for them. Parts of it are shot in a split-screen. Throughout the video, Powter is shown with his beanie hat, playing his piano. The Metro Red Line subway in Los Angeles was used during the shooting of this video.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:4de6ad4b59dcfa74a8795bc99a86909e924358e9","amp;dn":"Daniel+Powter+-+Bad+Day","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4de6ad4b59dcfa74a8795bc99a86909e924358e9","infoHashBuffer":{"type":"Buffer","data":[77,230,173,75,89,220,250,116,168,121,91,201,154,134,144,158,146,67,88,233]},"announce":[],"urlList":[]}}