{"title":"Dark Swan 01 - Storm Born-viny","uid":6424130,"size":1139313,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e10f9601fe3475c860f98297085173fd7cc52c7&amp;dn=Dark+Swan+01+-+Storm+Born-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"daemonx0x","files":-1,"time":1306403078,"description":"Dark Swan 01 - Storm Born-viny\n\n\nJust typical. No love life to speak of for months, then all at once, every horny creature in the Otherworld wants to get in your pants...\n\nEugenie Markham is a powerful shaman who does a brisk trade banishing spirits and fey who cross into the mortal world. Mercenary, yes, but a girl's got to eat. Her most recent case, however, is enough to ruin her appetite. Hired to find a teenager who has been taken to the Otherworld, Eugenie comes face to face with a startling prophecy--one that uncovers dark secrets about her past and claims that Eugenie's first-born will threaten the future of the world as she knows it.\n\nNow Eugenie is a hot target for every ambitious demon and Otherworldy ne'er-do-well, and the ones who don't want to knock her up want her dead. Eugenie handles a Glock as smoothly as she wields a wand, but she needs some formidable allies for a job like this. She finds them in Dorian, a seductive fairy king with a taste for bondage, and Kiyo, a gorgeous shape-shifter who redefines animal attraction. But with enemies growing bolder and time running out, Eugenie realizes that the greatest danger is yet to come, and it lies in the dark powers that are stirring to life within her...","torrent":{"xt":"urn:btih:4e10f9601fe3475c860f98297085173fd7cc52c7","amp;dn":"Dark+Swan+01+-+Storm+Born-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e10f9601fe3475c860f98297085173fd7cc52c7","infoHashBuffer":{"type":"Buffer","data":[78,16,249,96,31,227,71,92,134,15,152,41,112,133,23,63,215,204,82,199]},"announce":[],"urlList":[]}}