{"title":"Greg Allman - Can't Keep Running  (2nafish)","uid":5636928,"size":150968324,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4fd098da5c66694c84f19b630637bff569bf8848&amp;dn=Greg+Allman+-+Can%5C%27t+Keep+Running++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1276926960,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nI'm No Angel is an album by the Gregg Allman Band, released on Epic Records in 1986. The album is particularly notable for the strength of its title song, which was later covered by others, including Cher, Gregg Allman's former wife.\n\nThree singles were released from the album, in 1987. The title track, &quot;I'm No Angel&quot; peaked at Number 49 on the Billboard Hot 100, but reached Number 1 on Billboard's Mainstream Rock Tracks. &quot;Anything Goes&quot; reached Number 3 on Mainstream Rock Tracks, while &quot;Can't Keep Running&quot; reached Number 25 on the same list.  Released in 1986, the album peaked in 1987 at Number 30 on the Billboard 200.\n\nThe Gregg Allman Band, also known as Gregg Allman &amp; Friends, is a rock/blues group that Gregg Allman established and has led since the 1970s, during periods when Allman has been recording and performing separate from the Allman Brothers Band and has chosen not to perform exclusively as a solo artist.\n\nThe Allman Brothers Band is an American rock  band once based in Macon, Georgia. The band was formed in Jacksonville, Florida, in 1969 by brothers Duane Allman (slide guitar and lead guitar) and Gregg Allman (vocals, organ, songwriting), who were supported by Dickey Betts (lead guitar, vocals, songwriting), Berry Oakley (bass guitar), Butch Trucks (drums), and Jai Johanny &quot;Jaimoe&quot; Johanson (drums). While the band has been called the principal architects of Southern rock, they also incorporate elements of blues, jazz, and country music, and their live shows have jam band-style improvisation and instrumental songs.\n\nThe band achieved its artistic and commercial breakthrough in 1971 with the release of At Fillmore East, featuring extended renditions of their songs &quot;In Memory of Elizabeth Reed&quot; and &quot;Whipping Post&quot; and often considered one of the best live albums ever made. George Kimball of Rolling Stone magazine hailed them as &quot;the best damn rock and roll band this country has produced in the past five years.&quot; A few months later, group leader Duane Allman was killed in a motorcycle accident. The group survived that and the death of bassist Oakley in another motorcycle accident a year later; with replacement members Chuck Leavell and Lamar Williams, the Allman Brothers Band achieved its peak commercial success in 1973 with the album Brothers and Sisters and the hit single &quot;Ramblin' Man&quot;. Internal turmoil overtook the band soon after; the group dissolved in 1976, reformed briefly at the end of the decade with additional personnel changes, and dissolved again in 1982.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:4fd098da5c66694c84f19b630637bff569bf8848","amp;dn":"Greg+Allman+-+Can%5C%27t+Keep+Running++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fd098da5c66694c84f19b630637bff569bf8848","infoHashBuffer":{"type":"Buffer","data":[79,208,152,218,92,102,105,76,132,241,155,99,6,55,191,245,105,191,136,72]},"announce":[],"urlList":[]}}