{"title":"McGraw-Hill - HackNotes Portable Reference series.rar","uid":3231040,"size":8861496,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50cc0fcbee44ff144ee2d929514536ff12ebaac9&amp;dn=McGraw-Hill+-+HackNotes+Portable+Reference+series.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ravage","files":1,"time":1092341518,"description":"A buncha security books in the HackNotes series from McGraw-Hill. They come in quite handy when you need a quick lookup, concise and to the point. All are in PDF format and published in 2003. The following titles are included:\n\n\nHackNotes Windows Security Portable Reference\n---------------------------------------------------------\n\nThis resource for system administrators describes in detail the tools and techniques used by criminals to break in to computer networks. It then discusses ways to strengthen Windows systems to protect them against attack. A quick reference section found in the middle of the volume contains tables with information ranging from TCP/IP data types to system commands and security-related group policy settings.\n\n\nHackNotes Linux and Unix Security Portable Reference\n----------------------------------------------------------------\n\nHackNotes Linux and Unix Security Portable Reference gives you step-by-step details of intrusion tactics, tools, and actual techniques being used by hackers and criminals today to break into computer networks. This book will teach you how to protect and harden Linux and Unix hosts against the most troublesome security issues. Learn to use the latest hacking tools, including Airsnort, Dsniff, Ettercap, Ethereal, Kismet, Netcat, and Nmap. Protect the most popular network services, including FTP, SSH, Telnet, SMTP, HTTP, HTTPS, R-services, NFS, SAMBA, POP, IMAP, MySQL, X, and VNC. Recognize both Backdoor and Rootkit tools and tactics used by sophisticated intruders. Defend against software vulnerabilities such as race conditions, improper input validation, and misconfigurations. Use the unique and easy-to-access Reference Center in the middle of the book to quickly locate useful commands, online security resources, and more! \n\n\nHackNotes Web Security Pocket Reference\n-------------------------------------------------\n\nA Web security consultant explains Web vulnerabilities, hackers' methods, and ways to defend against them. His message is that one does not have to be a Web programmer to mount an effective defense, just systematic and knowledgeable about the platform and application being used. Includes assessment checklists and information on using a sample security application.\n\n\nHackNotes Network Security Portable Reference\n--------------------------------------------------------\n\nComputer consultants Horton and Mugge describe intrusion tactics, tools, and actual techniques being used by hackers and criminals to break into computer networks. They show how to assess and strengthen computer networks, how to conduct security checks, how to enhance wireless security and Web application security, and how to protect e- commerce. A 32-page reference section lists commands and passwords.\n","torrent":{"xt":"urn:btih:50cc0fcbee44ff144ee2d929514536ff12ebaac9","amp;dn":"McGraw-Hill+-+HackNotes+Portable+Reference+series.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50cc0fcbee44ff144ee2d929514536ff12ebaac9","infoHashBuffer":{"type":"Buffer","data":[80,204,15,203,238,68,255,20,78,226,217,41,81,69,54,255,18,235,170,201]},"announce":[],"urlList":[]}}