{"title":"Bowie-Cracked Actor-Documentary 1974-Tvrip-Abrasax","uid":4723269,"size":969255702,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:50dd1b1f565b76415fe0b3e518e9a33ee98b7894&amp;dn=Bowie-Cracked+Actor-Documentary+1974-Tvrip-Abrasax&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Abrasax","files":10,"time":1234624223,"description":"Bowie-Cracked Actor-Documentary 1974-Tvrip-Abrasax\n\nCracked Actor is a 53-minute-long BBC television documentary film about David Bowie. It was filmed in 1974, at a time when Bowie was a popular and commercial success. At the time he was a cocaine addict and the documentary has become notorious for showing Bowie's fragile mental state during this period. It was made by Alan Yentob for the BBC's Omnibus documentary strand, and was first shown, on BBC2 in the UK, on January 26, 1975.\n\nThe documentary depicts Bowie on tour in Los Angeles, using a mixture of documentary sequences filmed in limousines and hotels, and concert footage. Most of the concert footage was taken from a show at the Los Angeles Universal Amphitheatre on 2 September 1974. There were also excerpts from D.A. Pennebaker's concert film Ziggy Stardust and the Spiders from Mars, which had been shot at London's Hammersmith Odeon on 3 July 1973, as well as a few other performances from the tour.\n\nThe title of the documentary was originally to be The Collector, after a comment that Bowie had made to interviewer Russell Harty the previous year, whereby he described himself as &quot;a collector of accents&quot;. Yentob and his team were given the task of documenting Bowie's famous Diamond Dogs tour, which was already underway when they started filming. Locations for the documentary mainly centred around Hollywood and Los Angeles, but there was also concert footage taken from Philadelphia. A number of performances from the tour were shown, including songs such as &quot;Space Oddity&quot;, &quot;Cracked Actor&quot;, &quot;Sweet Things/Candidate&quot;, &quot;Moonage Daydream&quot;, &quot;The Width of a Circle&quot;, &quot;Aladdin Sane&quot;, &quot;Time&quot;, &quot;Diamond Dogs&quot; and &quot;John, I'm Only Dancing (Again)&quot;.\n=========================================================================\n\nSome black and white photos from the Station to Station Tour 1976-04-26 in Kungliga Tennishallen Sweden. (I was there yeah) and a postcard that was handed to me on the Swedish premier of the movie &quot;The man who fell to earth&quot;. (I was there \ntoo)\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Abrasax/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Abrasax/&lt;/a&gt;","torrent":{"xt":"urn:btih:50dd1b1f565b76415fe0b3e518e9a33ee98b7894","amp;dn":"Bowie-Cracked+Actor-Documentary+1974-Tvrip-Abrasax","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50dd1b1f565b76415fe0b3e518e9a33ee98b7894","infoHashBuffer":{"type":"Buffer","data":[80,221,27,31,86,91,118,65,95,224,179,229,24,233,163,62,233,139,120,148]},"announce":[],"urlList":[]}}