{"title":"HISTORY OF POP AND ROCK MUSIC - part 337","uid":6897220,"size":738461457,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:50efc5048241182a476d3b6a2ba39245f3ab5c3a&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+337&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pupovaczlatko","files":-1,"time":1324242224,"description":"                      PART  337\n\n\n           BILLY IDOL  -  Dancing With Myself  (1981)\n           BILLY IDOL  -  Mony Mony - live version (1987)  \n\n\n\n                   reupload  ( better version )\n\n            BILLY IDOL  - Sweet sixteen  (1986)\n\n\n\n\n     &quot;Dancing with Myself&quot; is a song by the band Generation X. The song was first released as a single and a 12&quot; in 1980 and, a few weeks after the single release, was included on the band's last album - 1981's Kiss Me Deadly. It would become the group's most well-known song, but did not enjoy much success upon its initial release. In 1981, Billy Idol remixed and re-released &quot;Dancing with Myself&quot; as a solo single, toning down its crunchy guitar sound and giving the song an overall brighter, poppier finish. Idol plays &quot;Dancing with Myself&quot; at most of his concerts, always introducing the song as having been originally written and recorded by Generation X. \n    &quot;Mony Mony&quot; is a 1968 single by Tommy James &amp; the Shondells.&quot;Mony Mony&quot; was the only song by the group to reach the top 20 in the United Kingdom; it reached #1 in the UK, and #3 in the USA. The song &quot;Mony Mony&quot; has been covered by many artists, including Billy Idol, Alvin and the Chipmunks, Amazulu, Status Quo, The Scenics and The Beach Boys. \n     Billy Idol released his studio version in 1981. and this original studio recording is the most common version heard on rock radio stations across the globe. However, Idol released a live version as a single in 1987, while promoting his then-forthcoming compilation &quot;Vital Idol&quot;. A live cover version of the song became a hit for Billy Idol in 1987. The live single version can be found on Idol's Greatest Hits compilation.","torrent":{"xt":"urn:btih:50efc5048241182a476d3b6a2ba39245f3ab5c3a","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+337","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50efc5048241182a476d3b6a2ba39245f3ab5c3a","infoHashBuffer":{"type":"Buffer","data":[80,239,197,4,130,65,24,42,71,109,59,106,43,163,146,69,243,171,92,58]},"announce":[],"urlList":[]}}