{"title":"NEOScavenger 0.988b","uid":10305340,"size":50155211,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5175ab40c2ddbf028b4e5a1fc19c43e0051f5937&amp;dn=NEOScavenger+0.988b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AppRipper","files":-1,"time":1402118825,"description":"NEO Scavenger\n(c) Blue Bottle Games\n\nRelease date: 9/13/2013 \nProtection: DRM-Free\nLanguage: English\nVersion: 0.988b\n\n\nNEO Scavenger is a turn-based, rogue-like RPG where you must\nsurvive in the wasteland long enough to figure out who you are\nEach turn you must decide where to go, how to scavenge for\nsupplies, and how to deal with anything and anyone you encounter\nAnd with each passing minute, the pit in your stomach grows, your\ndehydration worsens, your muscles tire, and your body temperature\ndrops in the cold autumn air. Choose your starting abilities\ncarefully, because they and your wit are the only tools you have in\nthe apocalypse!\n      &lt;a href=&quot;\nhttp://bluebottlegames.com/main/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bluebottlegames.com/main/&lt;/a&gt;\n\nInstructions:\n1) Unzip\n2) Enjoy!\n\nIt's DRM-Free as far as I know, however I would block it on your firewall anyway.\n\nHope you all enjoy this game! Buy it and support the developer! He really deserves it!\n\n-AppRipper &quot;Happy Hacking!&quot;\n\n*** CHANGELOG ****\n\nAdded ability to load mods from different folders (see included readme.txt).\nAdded ability to specify mod loading order.\nAdded ability to refer to local mod data vs. base game data using ModName: prefix. (0: is base game).\nAdded ability to override base game data and images via folder 0.\nAdded t-shirt design contest items to game.\nAdded sound effects for several items.\nAdded new duffle bag item.\nAdded code to prevent stacking of identified and unidentified items.\nChanged Game Over screen to show more stats and info.\nChanged loading screen to show more loading debug info for modders (added text scrolling and loading row number).\nChanged backpack slot to be 1 grid right and 2 down in all layouts, for better shoulder slot grid fit.\nChanged mouse wheel to scroll message window instead of attack modes.\nChanged forbidden hexes to be defined by xml instead of hard-coded.\nChanged forbidden hexes to be allowed again if all encounter triggers for that hex expired.\nChanged Allegan Fairgrounds to have manual entrance trigger after first visit.\nChanged faction standings to be defined in xml factions table, not inside creatures.\nChanged Strange Forest to have manual entrance trigger after first visit.\nChanged Isotope Mine to have manual entrance trigger after first visit.\nChanged Zom Zom's to have manual entrance trigger after first visit.\nChanged Hatter location to have manual entrance trigger after first visit.\nChanged Hidden Lake location to have manual entrance trigger after first visit.\nChanged creaturesources to be defined by XML data. No longer hard-coded.\nChanged factions to be defined by XML data. No longer hard-coded.\nChanged frequency of hardware items in loot tables to be greater.\nChanged sled frequency in loot tables to be lower.\nFixed loading progress bar to reflect all mods and overrides.\nFixed a bug that caused weather icon tooltip in screens where icon is not visible.\nFixed a bug in the deer pack spawn.\nFixed a bug that allowed items to be dragged from the crafting screen to real life and vice versa.\nFixed a treasure nesting bug in family/weapon/food encounter.\nFixed a bug that caused items to be auto-placed inside nested containers before top-level containers. (E.g. pills empty out into another pill bottle).\nFixed a bug that caused cryo facility to regain scavenge locations after saving/loading.\nFixed a bug that caused map hex visibility to get messed up after saving/loading.\nFixed a bug that caused lakes to have storage space.\nFixed a bug that caused duplicate items when crafting with tools that degraded in the process.\nFixed a bug that allowed skills to be dropped into unslotted traits.\nFixed a bug that caused traits to remain ghosted if their opposing skill was inside another trait that was unslotted.\nRemoved empty-out button when in a store that doesn't buy player's items.","torrent":{"xt":"urn:btih:5175ab40c2ddbf028b4e5a1fc19c43e0051f5937","amp;dn":"NEOScavenger+0.988b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5175ab40c2ddbf028b4e5a1fc19c43e0051f5937","infoHashBuffer":{"type":"Buffer","data":[81,117,171,64,194,221,191,2,139,78,90,31,193,156,67,224,5,31,89,55]},"announce":[],"urlList":[]}}