{"title":"Coast to Coast AM April 04 2013","uid":8345153,"size":56366752,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:52244cbbe5e33ea4204bbf922c2da637e1152728&amp;dn=Coast+to+Coast+AM+April+04+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1365181494,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t04-04-13\nHost: \tGeorge Noory\nGuests: \tDolores Cannon, Mark Lerner\n\nPast-life regressionist and hypnotherapist Dolores Cannon specializes in the recovery and cataloging of &quot;Lost Knowledge&quot; and metaphysical information which she acquires by taking clients into a deep trance state, without interference from the conscious mind. We exist within multiple dimensions, and move between them without our conscious awareness, she said. Dimensions vibrate at different frequencies, and this is one of the ways that ETs travel-- they raise the frequency of their craft to exit (which to us looks like they are disappearing), or lower their vibration (become denser) to enter, she detailed.\n\nCannon believes that ETs seeded Earth and created humans, who were given free will to see how they would develop. A kind of 'prime directive' is in effect, so the aliens cannot directly intervene, and that is why they have been known as 'the Watchers' for eons, she remarked. To get around the directive, waves of people known as &quot;volunteers,&quot; some who are aliens in human form, have been incarnating to Earth in increasing numbers since 1945 and the explosion of the atomic bomb, and are here to get humankind back on track, she reported. Some of these 'volunteers' are pure souls who are not burdened with karma, yet the first wave (now in their 40s and 50s) have struggled with the violence of the world, and feelings of alienation, she said.\n\nRegarding alien abductions, Cannon explained that the ETs are simply monitoring their own 'volunteers,' and making sure their physical bodies can handle the stresses of Earth-- that's why the implants are there, to track them so they can help at any time. The hybrids they're creating are being taken to other planets that need DNA to adapt to various conditions, she continued. Interestingly, she declared that a hidden civilization exists underground on our planet, with entrances underneath various pyramids. The Hall of Records exists underneath the Sphinx, but it's protected by an energy field so only the right kind of person would be able to access it, she added.\nNorth Korea in Astrology\n\nFirst hour guest, astrologer Mark Lerner talked about world astrology and in particular the situation with North Korea and Kim Jong Un, whose chart indicates unpredictable value systems based on the position of Venus. This November will start Kim Jong Un's Saturn Return cycle (which happens every 30 years), in which he'll have to take on more responsibilities. This coincides with a Uranus/Pluto squaring which mirrors a time period in the 1930s when several dictators emerged, he noted.\n\nNews segment guests: Charles R. Smith, Capt. Kelly Sweeney\nWebsite(s):\n\n    dolorescannon.com\n    ozarkmt.com\n    marklernerastrology.com\n\nBook(s):\n\n    The Three Waves of Volunteers and the New Earth\n    The Convoluted Universe: Book Four\n    Conversations With Nostradamus Vol. I\n\n","torrent":{"xt":"urn:btih:52244cbbe5e33ea4204bbf922c2da637e1152728","amp;dn":"Coast+to+Coast+AM+April+04+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52244cbbe5e33ea4204bbf922c2da637e1152728","infoHashBuffer":{"type":"Buffer","data":[82,36,76,187,229,227,62,164,32,75,191,146,44,45,166,55,225,21,39,40]},"announce":[],"urlList":[]}}