{"title":"Stossel.2013.09.26.[Escaping the Blob].Fox Business.CF.avi","uid":8978495,"size":344093258,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:52e1a6c5e2af2059797c85d82bf0120603af4644&amp;dn=Stossel.2013.09.26.%5BEscaping+the+Blob%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1380498536,"description":"----------\n\nSTOSSEL - [Escaping the Education BLOB] - Fox Business Network\n2013, September 26, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nTHE BLOB: America's school children have been trapped in a government-run monopoly, a so-called &quot;public&quot; school system that bores them to tears. Attempts at improvement are stopped not just by teachers' unions, but by the BLOB, an alliance of administrators, politicians, bureaucrats, PTAs and Big Government advocates that stifle almost all innovation. The BLOB demands more money, but schools don't stink because of a lack of money. We've tripled what we spend on K-12 education yet test scores don't go up:\n\nThe good news: there are all kinds of alternatives now that allow kids to escape the government monopoly...\n\nHOMESCHOOLING: Former Presidential Candidate Ron Paul created The Ron Paul Curriculum for homeschoolers. 16-year-old Veronica Andreades and 12-year-old Jeremiah Burch discuss the perks of being homeschooled.\n\nSCHOOL VOUCHERS: Most Americans are assigned to a school based on where they live; how crazy is that? What if you were assigned to your local grocery store? Prices would be higher and there would be little choice (just like government schools). Luckily, some states now allow some poorer people to transfer to a school outside of their neighborhood. Louisiana parents love a voucher program that allows kids to leave failing schools, but the Obama administration just sued to stop the program, claiming it interferes with school desegregation efforts. Louisiana Congressman Steve Scalise says U.S. Attorney General Eric Holder thinks students should be trapped in failing schools.\n\nMEXICO TEACHERS' UNION: Union teachers in Mexico not only cannot be fired, they have been able to sell their teaching jobs, or give them to family members! But now a new government changed the rules. So union teachers in Mexico are demonstrating, sometimes rioting. Mary O'Grady of the Wall Street Journal explains.\n\nUN-SCHOOLING: The most radical form of schooling is something called &quot;un-schooling.&quot; Special Correspondent Kennedy went to visit a school that doesn't have teachers or tests. Kids do whatever they want! Do they learn? I think so.\n\nHACKATHON: 24-year-old Aaron Ginn, head of growth forseeks new ways technology can enhance education, and he's doing so with something called &quot;hackathon.&quot;","torrent":{"xt":"urn:btih:52e1a6c5e2af2059797c85d82bf0120603af4644","amp;dn":"Stossel.2013.09.26.%5BEscaping+the+Blob%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52e1a6c5e2af2059797c85d82bf0120603af4644","infoHashBuffer":{"type":"Buffer","data":[82,225,166,197,226,175,32,89,121,124,133,216,43,240,18,6,3,175,70,68]},"announce":[],"urlList":[]}}