{"title":"Southern Culture on the Skids - Mojo Box  (2004) [FLAC]","uid":4549444,"size":296961625,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:52f0969b8d8093675a57252e947b06619a04b0ee&amp;dn=Southern+Culture+on+the+Skids+-+Mojo+Box++%282004%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"storoa","files":16,"time":1228248090,"description":"Review\tby Mark Deming\n\nFollowing the departure of keyboard player Chris Bess, Southern Culture on the Skids have pared themselves back down to a three-piece on their eighth full-length album, Mojo Box. While it&amp;#039;s not quite a return to the gloriously greasy stomp of such early classics as For Lovers Only and Ditch Diggin&amp;#039;, there is a significantly lower &quot;novelty&quot; factor here than they have displayed since their move up to the big leagues with Dirt Track Date, and the relatively leaner sound agrees with them. While SCOTS are a good-time band if there ever was one, a &quot;funny for the sake of funny&quot; vibe was starting to sink into the band&amp;#039;s sound, but Mojo Box finds Rick Miller&amp;#039;s songwriting displaying a keener focus than has been heard in years, and his bizarro-world redneck fantasias of luxury mobile homes, hot babes in halter tops, and classic muscle cars play more to his strengths than, say, &quot;House of Bamboo&quot; or &quot;Make Mayan a Hawaiian.&quot; Miller&amp;#039;s guitar work is in typically stellar form, too, while bassist Mary Huff holds down the bottom end with both efficiency and imagination (and sounds good on her vocal features) and drummer Dave Hartman is still making the clatter that matters. While Mojo Box has more than a few keyboard overdubs (including one guest spot from the departed Bess) and sounds pretty tidy by this band&amp;#039;s standards, it still harks back to what made Southern Culture on the Skids more than just a batch of funny redneck jokes, and this is a welcome gesture back to classic form. Gotta love the twang-tastic cover of the Creation&amp;#039;s &quot;Biff Bang Pow&quot; too! \n\n   1. (00:03:41) - (64.89%) Southern Culture on the Skids - Smiley Yeah Yeah Yeah\n   2. (00:03:24) - (66.58%) Southern Culture on the Skids - Mojo Box\n   3. (00:02:41) - (69.44%) Southern Culture on the Skids - Doublewide\n   4. (00:02:34) - (68.84%) Southern Culture on the Skids - I Want A Love\n   5. (00:02:56) - (70.61%) Southern Culture on the Skids - &amp;#039;69 El Camino\n   6. (00:02:29) - (67.98%) Southern Culture on the Skids - The Wet Spot\n   7. (00:03:33) - (69.33%) Southern Culture on the Skids - Soulful Garage\n   8. (00:03:32) - (69.55%) Southern Culture on the Skids - Biff Bang Pow\n   9. (00:03:15) - (64.52%) Southern Culture on the Skids - Where Is The Moon?\n  10. (00:02:34) - (64.83%) Southern Culture on the Skids - Fire Of Love\n  11. (00:03:22) - (66.51%) Southern Culture on the Skids - Swamp Fox\n  12. (00:02:56) - (66.93%) Southern Culture on the Skids - The Sweet Spot\n  13. (00:04:31) - (68.74%) Southern Culture on the Skids - It&amp;#039;s All Over But The Shoutin&amp;#039;\n","torrent":{"xt":"urn:btih:52f0969b8d8093675a57252e947b06619a04b0ee","amp;dn":"Southern+Culture+on+the+Skids+-+Mojo+Box++%282004%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52f0969b8d8093675a57252e947b06619a04b0ee","infoHashBuffer":{"type":"Buffer","data":[82,240,150,155,141,128,147,103,90,87,37,46,148,123,6,97,154,4,176,238]},"announce":[],"urlList":[]}}