{"title":"CONTINUUM (2013) S02e10 x264 (WEB-DL) 1080p NLSubs (Spookkie) TB","uid":8705602,"size":1791014988,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:52fdb16cfe2ba4620ec2f3629dd7469028634c3c&amp;dn=CONTINUUM+%282013%29+S02e10+x264+%28WEB-DL%29+1080p+NLSubs+%28Spookkie%29+TB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"spookkie","files":7,"time":1374144365,"description":"\n\nCONTINUUM (2013) S02e10 x264 (WEB-DL) 1080p NLSubs (Spookkie) TBS\n\n\n\n2012 - .. | Science-Fiction, Action and Adventure\n\nContinuum is een Canadese sciencefictionserie van de zender Showcase.\nDe serie ging in premiere op 27 mei 2012.\n\nWanneer een groep terroristen hun executie in het jaar 2077 ontsnappen, keren ze terug in de tijd in het jaar 2012. Dit samen met hun CPS Protector, Kiera Cameron. Ze zit vast in het verleden en ze is niet in staat terug te keren naar haar man en zoon. Kiera concentreert zich op het oppakken van het de terroristen voordat ze schade aan kunnen richten in deze tijd. Ze gaat daarom bij de lokale politie aan het werk.\n\nStoryline\n\nSet in Vancouver British Columbia, the year is 2077, world governments have fallen and have been bought out by corporations leading to loss of privacy and basic rights. A group of fanatical terrorists, bent on getting freedom back at all costs, destroy multiple buildings killing 30,000 people while targeting 20 members of the Corporate Board. As the 7 terrorists are about to be executed they attempt an escape by being sent back in time 6 years instead being sent back 65 years to our time, 2012. Dedicated CPS Protector (future police force) Kiera Cameron (Rachel Nichols) attempts to stop their escape and gets swept away along with them. Stuck in the past and unable to get back to her husband and son, Kiera concentrates on bringing down the terrorists before they can wreak havoc in our present. Kiera receives unexpected assistance from a teen tech genius Alec Sadler (Erik Knudsen) who is well known in the year 2077 as he invented much of the technology of the age. Part of the technology Alec has invented allows him to communicate with Keira and even see through her eyes or replay events she witnessed. Impersonating a detective of the Portland Oregon police department, Kiera forms an uneasy alliance with Vancouver detective Carlos Fonnegra (Victor Webster). After an extremely violent attack on the Vancouver police headquarters by the terrorists, they are ordered to work together by the Vancouver Police Chief Dillon (Brian Markinson) to work together to stop them. \n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1954347/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1954347/&lt;/a&gt;  &lt;a href=&quot;\nhttp://www.moviemeter.nl/forum/12/12788&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/forum/12/12788&lt;/a&gt;\n\n\nVideo: 1920*1080 (WEB-DL)\nContainer: x264 MKV\nAudio: AC3\nSubs: Custom NL (Instelbaar) \nQuality over Quantity (QoQ) Releases Vertalingen.\nVertaling: Winchestergirl, Pinkgaai en ChillyWitch.\nControle: Smokey\n\nThanks (QoQ)\n\nUploaded by Spookkie","torrent":{"xt":"urn:btih:52fdb16cfe2ba4620ec2f3629dd7469028634c3c","amp;dn":"CONTINUUM+%282013%29+S02e10+x264+%28WEB-DL%29+1080p+NLSubs+%28Spookkie%29+TB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52fdb16cfe2ba4620ec2f3629dd7469028634c3c","infoHashBuffer":{"type":"Buffer","data":[82,253,177,108,254,43,164,98,14,194,243,98,157,215,70,144,40,99,76,60]},"announce":[],"urlList":[]}}