{"title":"Putumayo Presents-World Lounge By Ulysses56","uid":3510850,"size":75125309,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:54d7385737043d5057481a17103afe2fc5fc87e9&amp;dn=Putumayo+Presents-World+Lounge+By+Ulysses56&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ulysses56","files":15,"time":1155148619,"description":"Putumayo Records Presents:\nWorld Lounge  2002\nThe ultimate chill-out soundtrack for a global cocktail party. \nRip 192kbs\nCovers Included\n\nPutumayo is pleased to present World Lounge, a laid-back collection of downtempo electronica and chill-out music with global flavors. Featuring the latest fusions of electronica and DJ culture with world music, World Lounge provides the perfect soundscape for a laid-back ambiance. \nThe modern masters of so-called downtempo music are boundless globetrotters, incorporating equal amounts of the exotic and the mundane. European DJs collectives like Gotan Project and Mo&amp;#039; Horizons freely sample South American sounds to create unexpected new creations. Indian sitars, which still conjure up mental images of late-sixties psychedelic rock, are used effectively by Italian producer Nicola Conte and German DJ project Jasmon to create music that is both provocative and reverent. Enigmatic Middle Eastern melodies provide a magical backdrop to the music of Hamid Baroudi, Blue Asia, and Dissidenten. Groups like Arling &amp; Cameron, Pink Martini, Mau Mau, and Montefiori Cocktail reveal that the line between cool and kitsch is as fine as a hair from Tony Bennett&amp;#039;s toupee.\nThe music on World Lounge was selected and sequenced to serve as an aural backdrop for a contemporary lounging session. Whether curling up on a shag rug in front of the fireplace at home, or ordering manhattans with a group of friends at a local bar, we hope the music on World Lounge will help create an entrancing and invigorating mood, while introducing you to some of the most interesting artists on the global scene. \n\nTracklist:\nJasmon - Dimdanana \nNicola Conte - Missione A Bombay \nGotan Project - Santa Maria \nMo&amp;#039; Horizons - Foto Viva \nMau Mau - Venus Nabalera \nBlue Asia - Abyssinean Dub \n.Arling &amp; Cameron - Shiva&amp;#039;s Daughters \nMontefiori Cocktail - Agua De Beber \nDissidenten - Instinctive Traveler \nHamid Baroudi - Trance Dance \nPink Martini - Sympathique \n\n\n\nThis is one of the many PutumayoÂ´s records I have in mind to upload, so please help keep seeding after you downloaded.\nEnjoy It!\nUlysses56\n\n\nFor more info: http://www.putumayo.com/","torrent":{"xt":"urn:btih:54d7385737043d5057481a17103afe2fc5fc87e9","amp;dn":"Putumayo+Presents-World+Lounge+By+Ulysses56","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54d7385737043d5057481a17103afe2fc5fc87e9","infoHashBuffer":{"type":"Buffer","data":[84,215,56,87,55,4,61,80,87,72,26,23,16,58,254,47,197,252,135,233]},"announce":[],"urlList":[]}}