{"title":"John Rich - Country Done Come  To  Town (2nafish)","uid":5708354,"size":128397316,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:554f724dab11122ff6437cbed269a2355bfbae47&amp;dn=John+Rich+-+Country+Done+Come++To++Town+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1279788231,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nJohn Rich (born January 7, 1974 in Amarillo, Texas) is an American country music singer-songwriter. From 1992 to 1998, he was a member of the country music band Lonestar, in which he played bass guitar and alternated with Richie McDonald as lead vocalist. After Rich parted ways with the band Lonestar in a not so friendly way, he embarked on a solo career on BNA Records in the late 1990s, releasing two singles for the label and recording Underneath the Same Moon, which was not released until 2006. By 2003, he joined Big Kenny to form the duo Big &amp; Rich, who released three albums on Warner Bros. Records as well as ten singles, including the Number One &quot;Lost in This Moment&quot;. After Big &amp; Rich went on hiatus in 2007, Rich began work on a second solo album, Son of a Preacher Man, which has produced two more chart singles. In addition to his work in Big &amp; Rich, John has co-written singles for multiple artists, including Keith Anderson, Jason Aldean, Cowboy Troy and Gretchen Wilson, as well as producing records for several other artists.\n\nRich joined Big Kenny in 2003 to form the duo Big &amp; Rich. The duo recorded three studio albums for Warner Bros. Records: Horse of a Different Color, Comin' to Your City and Between Raising Hell and Amazing Grace, in 2004, 2005 and 2007 respectively. These albums accounted for ten singles on the country charts, including the Number One &quot;Lost in This Moment&quot;. Rich also co-wrote all of the duo's singles, primarily with Big Kenny. In the wake of Big &amp; Rich's success, his 1999 solo album Underneath the Same Moon was issued via BNA, coinciding with the release of Big Kenny's previously-unreleased solo album Live a Little.\n\nDuring Big &amp; Rich's success, Rich also worked as a songwriter and producer for other artists. His work included production for Gretchen Wilson, Keith Anderson, Jewel and John Anderson. In the same time span, he co-wrote multiple singles for other artists, including the Number One hits &quot;Redneck Woman&quot; for Gretchen Wilson, &quot;Mississippi Girl&quot; for Faith Hill and &quot;Why&quot; for Jason Aldean.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:554f724dab11122ff6437cbed269a2355bfbae47","amp;dn":"John+Rich+-+Country+Done+Come++To++Town+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"554f724dab11122ff6437cbed269a2355bfbae47","infoHashBuffer":{"type":"Buffer","data":[85,79,114,77,171,17,18,47,246,67,124,190,210,105,162,53,91,251,174,71]},"announce":[],"urlList":[]}}