{"title":"Mental Health Aspects Of Autism and Asperger Syndrome ~ariane_c","uid":8429377,"size":945245,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55e28e028ee67b7c1343aaf5b1d99803811cb30e&amp;dn=Mental+Health+Aspects+Of+Autism+and+Asperger+Syndrome+%7Eariane_c&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ariane_c","files":1,"time":1367444222,"description":"Publisher: Jessica Kingsley Pub; 1 edition (January 15, 2005)   PDF 252 pages \n\nThe first book to address the increasingly urgent need for information about psychiatric problems in people with autism spectrum disorders (ASDs), Mental Health Aspects of Autism and Asperger Syndrome systematically explains the emotional and psychological difficulties that are often encountered with ASDs. The author, an experienced psychiatrist specializing in autism, describes each of the conditions that are commonly seen in autistic children and adults, including schizophrenia, depression, anxiety, and tic disorders, and gives sound guidance on their early detection and treatment. Easy to use and authoritative, this book is an essential tool for use by both family and professionals.\n\nReview\n'Dr Ghaziuddin is to be congratulated for his timely, informative, and thoughtful book... I enjoyed reading it immensely... [It] has abundant information on this increasingly important topic.' --- Gary Mesibov, PhD, Professor &amp; Director, Division TEACCH, University of North Carolina at Chapel Hill \n\nAbout the Author\nMohammad Ghaziuddin, MD, MRCPsych, is a child psychiatrist with a special interest in children and adults with autism and related disorders. Author of several scientific articles on various aspects of autism, Dr Ghaziuddin has lectured widely both in the US and abroad. He is an Associate Professor of Child Psychiatry at the University of Michigan and in addition is on the editorial boards of several leading scientific journals. ","torrent":{"xt":"urn:btih:55e28e028ee67b7c1343aaf5b1d99803811cb30e","amp;dn":"Mental+Health+Aspects+Of+Autism+and+Asperger+Syndrome+%7Eariane_c","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55e28e028ee67b7c1343aaf5b1d99803811cb30e","infoHashBuffer":{"type":"Buffer","data":[85,226,142,2,142,230,123,124,19,67,170,245,177,217,152,3,129,28,179,14]},"announce":[],"urlList":[]}}