{"title":"La Kahena by Cheb I Sabbah morocco ethnic chill music","uid":3467841,"size":94544843,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:57ef0deccf9d1b2bafa445cf6ffce8a30ee4b973&amp;dn=La+Kahena+by+Cheb+I+Sabbah+morocco+ethnic+chill+music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nomorenames81","files":10,"time":1144426466,"description":"Product Description\nCheb i Sabbah, one of Six Degrees? best selling artists, is known around the world for his ground-breaking South Asian trilogy, Shri Durga, Mahamaya: Shri Durga Remixed and Krishna Lila. Sabbah&amp;#039;s heartfelt, spiritual approach to bringing music to the dance floor has established him as a highly respected international music producer, DJ and an influential pioneer of the underground.\n\nOn his long awaited new studio CD, La Kahena, the Algerian born Sabbah returns to the roots of his native North Africa gathering some of the most distinctive female singers from the Maghreb in a studio in Morocco. With tracks by vocalists from many different traditions of North Africa, La Kahena compellingly illustrates the diversity of this region. Tracks by traditional ensembles B?net Marrakech and Ouled Ben Aguida reflect Berber traditions. Khadija Othmani conveys the matrilineal noble culture of Algerian Tuaregs. The Gnawa master Brahim Elbelkani brings the spirit of sub-Saharan African mystic healers, originally brought to Morocco as slaves. Nadia introduces the first music Sabbah remembers hearing in his life, elegant, Andalusian songs performed at weddings and celebrations in Constantine, Algeria. And Cheba Zahouania delivers the freewheeling spirit of rai, a music born in the pleasure-loving port city of Oran, Algeria, where many Andalusians fled after their expulsion from Spain. To complete the collection, Michal Cohen, a Jewish singer of Yemenite descent, shares a song based on a poem by Shalom Shabazi, the 16th century Yemenite Jewish mystic.\n\nRecorded in studios in Marrakech, San Francisco, New York and New Delhi, Sabbah finished the sessions by adding his own &quot;dj Science&quot; or modern aural magic to these performances, making La Kahena a truly original and ground-breaking project the likes of which only the artistic vision of Cheb i Sabbah could have created. \n\n-----------\ntracks:\n\n1. Esh ?Dani, Alash Mshit: Why Did I Follow Him? \t\n2. Sadats: Saints Of Marrakesh \t\n3. Toura Toura \t\n4. i - Alla Al ?Hbab: Blessed Be My Friends ii - Hajti Fi Gurini: Longing For My Lover \t\n5. Madh Assalhin: Praising Of the Saints \t\n6. i - Alkher Illa Doffor: Peace Is Found Behind Woundsii - Ad Izayanugass: What Will Happen Will Happen \t\n7. Im Ninalou: If The Doors Are Locked \t\n8. Jarat Fil Hub: Love&amp;#039;s Chalice","torrent":{"xt":"urn:btih:57ef0deccf9d1b2bafa445cf6ffce8a30ee4b973","amp;dn":"La+Kahena+by+Cheb+I+Sabbah+morocco+ethnic+chill+music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57ef0deccf9d1b2bafa445cf6ffce8a30ee4b973","infoHashBuffer":{"type":"Buffer","data":[87,239,13,236,207,157,27,43,175,164,69,207,111,252,232,163,14,228,185,115]},"announce":[],"urlList":[]}}