{"title":"Hydrocarbon Exploration and Production 2nd ed","uid":14865726,"size":11157297,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:584e8c682b9473c4b4849147346dbd7cdeaa1035&amp;dn=Hydrocarbon+Exploration+and+Production+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1465544009,"description":"Hydrocarbon Exploration and Production 2nd ed - Frank Jahn et al. (Elsevier, 2008).pdf\r\n\r\nISBN 978-0-444-53236-7\r\n\r\nHydrocarbon Exploration and Production, Second Edition is a comprehensive and current introduction to the upstream industry, drawing together the many inter-disciplinary links within the industry. It presents all the major stages in the life of an oil or gas field, from gaining access to opportunity, through exploration, appraisal, development planning, production, and finally to decommissioning. It also explains the fiscal and commercial environment in which oil and gas field development takes place.\r\n\r\nThe book is written for industry professionals who wish to be better informed about the basic technical and commercial methods, concepts and techniques used in the upstream oil and gas business. The authors are the founders of TRACS International, a company which has provided training and consultancy in Exploration and Production related issues for many clients world-wide since 1992.\r\n\r\n* Clearly written in a concise and straightforward manner\r\n* Features detailed technical illustrations to maximize learning\r\n* Presents major advances in the industry, including technical methods for field evaluation and development and techniques used for managing risk within the business\r\n* Developed from TRACS International course materials, discussions with clients, and material available in the public domain","torrent":{"xt":"urn:btih:584e8c682b9473c4b4849147346dbd7cdeaa1035","amp;dn":"Hydrocarbon+Exploration+and+Production+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"584e8c682b9473c4b4849147346dbd7cdeaa1035","infoHashBuffer":{"type":"Buffer","data":[88,78,140,104,43,148,115,196,180,132,145,71,52,109,189,124,222,170,16,53]},"announce":[],"urlList":[]}}