{"title":"Les Gangsters, Hervé Guibert ePub","uid":15610687,"size":137894,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58c9d321c119e575bfc7f8b68c171719ce76deea&amp;dn=Les+Gangsters%2C+Herv%26eacute%3B+Guibert+ePub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ad2san","files":1,"time":1471778243,"description":"Les Gangsters (1988)\r\n \r\nParis, Minuit, 1988.\r\n \r\nPrésentation :\r\n\r\n« [...] les deux tantes nous reviennent, après avoir traversé les récits apparemment les plus autobiographiques de Guibert, en particulier Mes parents. Elles sont à nouveau les héroïnes d’une histoire qui semble vraie, et qui est racontée comme telle : de faux ouvriers se sont présentés chez les deux vieilles femmes, arguant de réparations devenues indispensables dans leur vieil hôtel particulier du XVeme ; ils ont exigé des paiements en espèce de plus en plus considérables, et fini pas leur extorquer, sous le charme et la menace, le gros de leurs économies. »\r\n\r\nRaymond Bellour, « Guibert ou l’indécidable », Le Magazine littéraire, Décembre 1988, p.80.\r\n\r\n\r\nHervé Guibert à propos des Gangsters :\r\n\r\n« Juste avant d’écrire Les Gangsters, je lisais Knut Hamsun. Comme Conrad, c’est un écrivain de l’expérience : l’un raconte la mer, l’autre le vagabondage. Mais moi, quelle est mon expérience ? Je me suis alors souvenu d’un épisode familial : une vision intolérable, criminelle de mon père et que je me suis appliqué à reconstituer dans mon journal. Mon expérience, c’est peut-être cela : quand je disparaîtrais, j’aurais tout dit. Je me serais acharné à réduire cette distance entre les vérités de l’expérience et de l’écriture.\r\nJ’ai commencé Les Gangsters trois jours après avoir découvert les faits dont étaient victimes mes grand-tantes, et j’ai écrit le livre en dix jours. L’histoire a continué pendant que j’écrivais et après que j’ai eu terminé. »\r\n\r\n« Les aveux permanents d’Hervé Guibert », entretien avec Antoine de Gaudemar, Libération, Supplément livres, 20 octobre 1988, p.12.\r\n\r\n\r\nExtrait :\r\n\r\n« Louise rentre de la messe. Je lui dis : ‘Alors, tu as bien prié pour tes gangsters ? pour qu’on ne les retrouve jamais ?’ – ‘Exactement, me répond-elle, mais j’ai aussi prié pour toi, comme tous les soirs... En tout cas, ajoute-t-elle, je ne regrette rien, on s’est bien amusées.’ La terreur l’a amusée. Je lui dis : ‘Tu veux devenir la madone des escrocs ? Avant d’égorger un enfant ou une vieille, ils se signeront en chuchotant ton nom...’ »\r\n\r\nHervé Guibert, Les Gangsters, Paris, Minuit, 1988, p.37","torrent":{"xt":"urn:btih:58c9d321c119e575bfc7f8b68c171719ce76deea","amp;dn":"Les+Gangsters%2C+Herv%26eacute%3B+Guibert+ePub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58c9d321c119e575bfc7f8b68c171719ce76deea","infoHashBuffer":{"type":"Buffer","data":[88,201,211,33,193,25,229,117,191,199,248,182,140,23,23,25,206,118,222,234]},"announce":[],"urlList":[]}}