{"title":"SAS  Special Air Service-Tactical-(WTC-SWE)","uid":4544063,"size":739286193,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:58e3c84f7342167dd5fb0d075a51d8c27cdda899&amp;dn=SAS++Special+Air+Service-Tactical-%28WTC-SWE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WTC-SWE","files":-1,"time":1228060698,"description":"BBC:\n----\n\n\n\n                          SAS SPECIAL AIR SERVICE-TACTICAL\n                         ----------------------------------\n\n\nBritain&amp;#039;s expectations of the Special Air Service have been heightened in the months since the 11 September terror attacks.The highly-trained soldiers&amp;#039; skills and ability to work behind enemy lines were praised by the US during action against al-Qaeda.And they will almost certainly play a central role in any continuation of the war on terror.But of all the perilous missions the SAS has faced it is perhaps best known for storming the Iranian embassy in London in 1980.Terrorists had killed a hostage and the operation that followed was carried out under the full glare of the world&amp;#039;s television cameras.\nThe SAS freed the remaining hostages and killed five of the six terrorists, although their spectacular success gave them much unwanted publicity.\n\nTop brass\n---------\n\nThe SAS and its motto, Who Dares Wins, was born early in the Second World War, when a British army officer, David Stirling, came up with the idea of a highly-trained special force which might wreak havoc on enemy supply lines, bases and morale.\nHe joined forces with an Australian, Jock Lewes, an officer in the Welsh Guards who had a talent for improvisation. Parachutes were the obvious way of getting troops behind enemy lines, but an early practice jump using a scrounged parachute and an unsuitable aircraft put Stirling in hospital for two months.He used the time to flesh out his plan, and on leaving hospital, he slipped past the guard at High Command headquarters, and managed to convince the top brass that his idea was both necessary and feasible.\n\nFalklands\n---------\n\nThe SAS was initially created as a desert raiding force to weaken Rommel&amp;#039;s North African logistics network as well as hinder aircraft operations.Their first successful raid was in December, 1941, when two groups destroyed 61 aircraft at two airfields. There were to be many more SAS operations in the war against Hitler and later, the SAS saw action in several counter-insurgency operations, in Oman, Aden, Malaya and Borneo.\nThey were also deployed in Northern Ireland against the IRA and saw intensive action in the Falklands.During the Gulf War, SAS teams penetrated deep within Iraq to search for mobile Scud missile launchers.But the experiences of one eight-man team illustrated how the courage and reputation of the elite force could not guarantee success.\nAfter being dropped far behind Iraqi lines, three men were killed and four captured, although they are said to have first killed 250 Iraqis.A book taking its title from the team&amp;#039;s call sign, Bravo Two Zero, made a fortune for its author Andy McNab, a pseudonym of the group&amp;#039;s leader.It has sold 1.5 million copies, been translated into 16 languages, and spawned dozens more books about the SAS, to the consternation of those whose lives could depend on the secrecy of its methods. \nThe men of the SAS have known hardship before they even join. The selection process is, as one might expect, gruelling. Probably the most testing element is the Long Drag.\nIt is a 40-mile trek over the Brecon Beacons, carrying a 55-pound backpack, that does not include the required food and water. Only about one in every 12 soldiers passes the course.\nThe SAS cap badge depicts not a winged dagger, as was thought, but King Arthur&amp;#039;s sword, Excalibur, surrounded by flames. \n\n\n\n\nFile Size: 704 MB \nFormat:AVI\nVideo Length: 00:58:24\nVideo Codec: XviD\nVideo Resolution: 640x480\nVIdeo Bitrate: 1647 kbit/s\nFPS:  25.000625\nAudio Bitrate: 191 kbit/s\nAudio Codec: MPEG Layer-3\nChannels:  2\nSubtitles:(N/A)\n\n \n\n\nENJOY:\n\n\n\nYOUR CHOICE\n\nWTC-SWE\n\n\n\n\n(Please seed so others can enjoy)","torrent":{"xt":"urn:btih:58e3c84f7342167dd5fb0d075a51d8c27cdda899","amp;dn":"SAS++Special+Air+Service-Tactical-%28WTC-SWE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58e3c84f7342167dd5fb0d075a51d8c27cdda899","infoHashBuffer":{"type":"Buffer","data":[88,227,200,79,115,66,22,125,213,251,13,7,90,81,216,194,124,221,168,153]},"announce":[],"urlList":[]}}