{"title":"HTML5, Designing Rich Internet Applications{BBS}","uid":7281217,"size":16994749,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58e3c7cad8d2c6fab8d826f24045f2d1b553ce92&amp;dn=+HTML5%2C+Designing+Rich+Internet+Applications%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1337440031,"description":"Implement the powerful new multimedia and interactive capabilities offered by HTML5, including style control tools, illustration tools, video, audio, and rich media solutions. Understand how HTML5 is changing the Web development game with this full-color, project-based treatment that shows you-not just tells you-what HTML5 can do for your Web sites. Reinforce your practical understanding of the new standard with demo applications and tutorials, so that execution is one short step away. The companion website, visualizetheweb.com, is packed full of extra information, online code libraries, and a user forum, offering even more opportunity to learn new skills, practice your coding and interact with other users.\n\n \n\n* Learn how to create images with SVG and Canvas * Optimize your HTML5 Web site's appearance on the latest Web browsers, including Chrome 5, Safari 4, Internet Explorer 9, and FireFox 3.6 * Embed video and audio into your Web page * Enhance your JavaScript knowledge with jQuery Ajax library * Control your page layout and design with CSS3, embedded fonts, animation, transformation, 3D, and rounded borders * Leverage the new HTML5 elements, such as ARTICLE, SECTION, FOOTER, HEADER, and ASIDE * Extend your Web applications to mobile devices such as the iPhone, Android, and WebOS mobile phones with HTML5 FORMs 2.0 * Implement the Geolocation API in your Web applications * Apply SQL-like local data storage to your Web solutions\n\nPaperback: 299 pages\nPublisher: Focal Press; 1 edition (July 28, 2010)\nLanguage: English\nISBN-10: 0240813286\nISBN-13: 978-0240813288","torrent":{"xt":"urn:btih:58e3c7cad8d2c6fab8d826f24045f2d1b553ce92","amp;dn":"+HTML5%2C+Designing+Rich+Internet+Applications%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58e3c7cad8d2c6fab8d826f24045f2d1b553ce92","infoHashBuffer":{"type":"Buffer","data":[88,227,199,202,216,210,198,250,184,216,38,242,64,69,242,209,181,83,206,146]},"announce":[],"urlList":[]}}