{"title":"Mystical Journeys -- Sadhguru Jaggi Vasudev","uid":4372802,"size":772337933,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5a0e6947a453d189c83e306f92c4deea2912829e&amp;dn=Mystical+Journeys+--+Sadhguru+Jaggi+Vasudev&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"deepakgod","files":2,"time":1220248586,"description":"MYSTICAL JOURNEYS KAILASH MANASAROVAR YATRA -- Sadhguru Jaggi Vasudev\n\n \nMount Kailash - even from its outer appearance, this magnificant peak in the Tibetan part of the Himalayas seems distinctly different.A geological phenomenon - may be, breathtaking in its sublime beauty - without a doubt , but what makes it one of the most sacred places in the Hindu, Buddhist, Jain and Bon religion alike? \n\nIn 2006 and 2007, Sadhguru, and along with him groups of meditators, set out to explore the truth behind the legends, and what they found was &quot;too incredible for any sensible man to believe&quot;. (Sadhguru) \n\nWhile Mount Kailash proved to be an unequalled spiritual treasure, the near by Lake Manasarovar, the highest fresh-water lake in the world, equally shrouded in myth as Kailash, held a literally outlandish secret. \n\nThis extraordinary account takes us on a journey to a land of astonishing natural beauty, to sights of immense spiritual significance. Glimpses of seemingly boundless inner possibilities, unveiled by one of the most profound mystics of our times, make this documentation truly awe-inspiring. ","torrent":{"xt":"urn:btih:5a0e6947a453d189c83e306f92c4deea2912829e","amp;dn":"Mystical+Journeys+--+Sadhguru+Jaggi+Vasudev","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a0e6947a453d189c83e306f92c4deea2912829e","infoHashBuffer":{"type":"Buffer","data":[90,14,105,71,164,83,209,137,200,62,48,111,146,196,222,234,41,18,130,158]},"announce":[],"urlList":[]}}