{"title":"The Tragedy of the Euro [EPUB]","uid":8650821,"size":954245,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a4fb9a8011462c34794d810951ac78b087daaad&amp;dn=The+Tragedy+of+the+Euro+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1373096325,"description":"Philipp Bagus, professor of economics at Universidad Rey Juan Carlos in Madrid, is a young scholar with a large influence, having forecast all the problems with the Euro and having persuaded many economists on the Continent that this currency is no better than any fiat currency. In some ways it is much worse because it has cartelized the management of European monetary regimes and created a terrible moral hazard. We often hear analysis of the workings of the Fed. Discussion of the European Central Bank is more rare. Bagus compares the two institutions to show a fundamental difference. Member states of the ECB can run deficits and expect them to be financed by the ECB. This is not true with the Fed. So Europe has a tragedy of the commons at work with its monetary policy that sets up very dangerous incentives for member states. For this reason, the system is unworkable. With this book, Professor Bagus brings his scholarship to English readers, explaining the background to the idea of European unity and its heritage of sound money. He explains that the Euro is not what the older classical liberals had hoped for but instead is a politically managed money that is destined for failure. He writes with a keen sense for economic analytics and empirical detail, offering one of the most accessible and yet rigorous accounts of the emergence of the Euro. He predicts its downfall due to political pressures, bad banking practices, and exploding public-sector liabilities. The analogies with the dollar are indeed close, but with welfare states at a more advanced stage, it will be a race to see which paper currency will crumble first. Professor Bagus brings theoretical power to investigating one of the most important topics in economics today. His arguments and evidence convinced even Jesus Huerta de Soto to withdraw support for the Euro. For this reason, de Soto has written the introduction to this important work.\n &lt;a href=&quot;\nhttp://www.amazon.com/Tragedy-Euro-Large-Print-Edition/dp/1479296759/ref=sr_1_1?ie=UTF8&amp;qid=1373088768&amp;sr=8-1&amp;keywords=the+tragedy+of+the+euro&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Tragedy-Euro-Large-Print-Edition/dp/1479296759/ref=sr_1_1?ie=UTF8&amp;qid=1373088768&amp;sr=8-1&amp;keywords=the+tragedy+of+the+euro&lt;/a&gt;","torrent":{"xt":"urn:btih:5a4fb9a8011462c34794d810951ac78b087daaad","amp;dn":"The+Tragedy+of+the+Euro+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a4fb9a8011462c34794d810951ac78b087daaad","infoHashBuffer":{"type":"Buffer","data":[90,79,185,168,1,20,98,195,71,148,216,16,149,26,199,139,8,125,170,173]},"announce":[],"urlList":[]}}