{"title":"Angelique (Boxset DVD 2-2006)DVD9 (dutch subs) NLT-Release","uid":6017602,"size":6112168233,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5b59749a419bf7d99167346f21804d6e6d3f8283&amp;dn=Angelique+%28Boxset+DVD+2-2006%29DVD9+%28dutch+subs%29+NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nlt-Release-XX-Men","files":-1,"time":1291697531,"description":"Angelique (Boxset DVD 2-2006)DVD9 (dutch subs) NLT-Release\n\n[img]http://img405.imageshack.us/img405/5084/angeliques.jpg[/img]\n\nBeleef de aangrijpende avonturen van de beeldschone AngÃƒÂ©lique (MichÃƒÂ¨le Mercier) die wordt getroffen door het noodlot. Het verhaal gaat over ontmoetingen met de rijke graaf van Toulouse Joffrey de Peyrac (Robert Hossein), haar toekomstige man en enige ware liefde. AngÃƒÂ©lique en Joffrey worden geconfronteerd met de macht van invloedrijke personen tijdens het bewind van Louis XIV, de Zonnekoning. Liefde, actie en avontuur maken van AngÃƒÂ©lique een waar kostuumdrama vol actie. Een tijdloos succes waar mensen van alle leeftijden van zullen genieten!\n\nDVD 2: The Road to Versailles \nNa de executie van haar man Joffrey de Peyrac wordt AngÃƒÂ©lique op zichzelf teruggeworpen. Alleen en wanhopig worstelt ze zich door moeilijke tijden heen om voor haar kinderen te zorgen. AngÃƒÂ©lique brengt verandering in haar situatie door zich aan te sluiten bij het Hof der Wonderen waar ze een bondgenoot vindt in de persoon van jeugdvriend Nicholas, die nu de koning van de Parijse onderwereld is. In een verwoede poging om haar respect terug te krijgen en gebeten op wraak, wordt ze opnieuw het middelpunt van lust, hofintriges en jaloezie. Maar de liefde zal wederom overwinnen!\n\n**************************************************\n\nExperience the dramatic adventures of the beautiful Angelique (Michele Mercier) who is struck by fate. The story is about encounters with the wealthy Count of Toulouse, the Joffrey Peyrac (Robert Hossein), her future husband and one true love. Angelique and Joffrey are faced with the power of influential people during the reign of Louis XIV, the Sun. Love, action and adventure of Angel where a costume drama full of action. A timeless success where people of all ages will enjoy!\n\nAngelique DVD 2: The Road to Versailles\nAfter the execution of her husband, the Joffrey Angelique Peyrac is thrown back on itself. Alone and desperate struggles they go through difficult times for her children. Angelique will change its position by joining in the Court of Miracles where she finds an ally in the person of Nicholas childhood friend, now the king of the Parisian underworld. In a frantic effort to regain her respect and bitten on revenge, she is again the center of lust, jealousy and hofintriges. But love will conquer again!\n\nBron: Retail Dvd, 5 disks\nSpeelduur 485:00 min\nBeeldformaat: 2.35 :1\nKleur: Color\nTaal: Frans, Engels\nAudio: DD 2.0 / DD 1.0\nOndertitels: Nederlands\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD9 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Avontuur Drama Romantiek\n \nWeblink : http://www.bol.com/nl/p/dvd/angelique-the-complete-collection/1002004004499903/index.html \n\nEnjoy the movie\n\nXX-Men\n\n","torrent":{"xt":"urn:btih:5b59749a419bf7d99167346f21804d6e6d3f8283","amp;dn":"Angelique+%28Boxset+DVD+2-2006%29DVD9+%28dutch+subs%29+NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b59749a419bf7d99167346f21804d6e6d3f8283","infoHashBuffer":{"type":"Buffer","data":[91,89,116,154,65,155,247,217,145,103,52,111,33,128,77,110,109,63,130,131]},"announce":[],"urlList":[]}}