{"title":"Jon Sable, Freelance (Mike Grell)","uid":5437499,"size":2228953049,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5b90e4f74b91461ed578aefa0a8cd2d0f578f4a0&amp;dn=Jon+Sable%2C+Freelance+%28Mike+Grell%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1268783694,"description":"Jon Sable Freelance is a comic book series, one of the first series created for the fledging publisher First Comics in 1983.  It was written and drawn by Mike Grell and was a fully creator-owned title, as were all of First Comics' titles.\n\nJonathan Sable was a bounty hunter and mercenary who previously had been an athlete in the 1972 Munich Olympic Games. After witnessing the terrorist outrages at those games, he married a fellow athlete and they relocated to Rhodesia, where Sable became an organizer of safaris for tourists, and later a game warden. It was during this time his family was murdered by poachers. After avenging his slain family, Sable returned to the USA and became a free-lance mercenary.\nHe also has a double identity as a successful children's book writer under the name of &quot;B.B. Flemm.&quot; Unlike many such characters, his literary agent is aware of his other identity's activities, but is most persuasive in enforcing his writing contract obligations as well.\n\nThe character was heavily influenced by Ian Fleming's James Bond novels as well as drawing on pulp fiction crime stories. Also, many of the stories of Sable's hunting exploits in Africa were influenced by Peter Hathaway Capstick's novels.\nAt a convention in the late 1980s, Grell stated that his idea for Sable was &quot;something like a cross between James Bond and Mickey Spillane's Mike Hammer.&quot;\n\nJon Sable Freelance lasted 56 issues from June 1983 to February 1988 before being cancelled. While Grell wrote and did all the covers, he stopped drawing the stories after #44.  The series was suspended, and after a few months, Marv Wolfman was writing and Bill Jaaska was drawing a new series called Sable, with Grell having no part.  This lasted 27 issues before cancellation.  Marv Wolfman abruptly left the series after issue #23 and comic book fan Steve Kaye took over the writing chores for the final four issues. Fan favorite artist Tim Vigil provided covers for the remaining issues.\n\nA third First Comics series, Mike Grell's Sable, reprinted the first ten issues of the original Jon Sable Freelance series.\n\nAfter the title's cancellation (and First's ceasing operations), the character did not receive his own series again until March 2005, when IDW Publishing released the first of a new six-issue mini-series titled Jon Sable Freelance: Bloodtrail (originally announced as Jon Sable, Freelance: Conspiracy) written and drawn by Grell.  IDW have also been reprinting the entire original run in a series of trade paperbacks.\n\nA new series, Jon Sable: Ashes of Eden, began publication as an online series in November 2007, and was published as a 5-issue mini-series beginning in 2008 and ending in 2009.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:5b90e4f74b91461ed578aefa0a8cd2d0f578f4a0","amp;dn":"Jon+Sable%2C+Freelance+%28Mike+Grell%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b90e4f74b91461ed578aefa0a8cd2d0f578f4a0","infoHashBuffer":{"type":"Buffer","data":[91,144,228,247,75,145,70,30,213,120,174,250,10,140,210,208,245,120,244,160]},"announce":[],"urlList":[]}}