{"title":"Joe Bagale - Joe Bagale","uid":7370308,"size":133443625,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5bfecc3d3651fe072809fe8b21182b6929b87a07&amp;dn=Joe+Bagale+-+Joe+Bagale&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vanush","files":-1,"time":1340215060,"description":"Joe Bagale is one of the most original and creative artists of his generation. A 27 year old singer-songwriter/composer, multi-instrumentalist, and producer, who is pushing the envelope of what we know as &quot;POP&quot; music. His compositions feature the soul of R&amp;B and the heart of rock, redefining the San Francisco music scene.\n\nThe self-titled debut, combines Joe's diverse influences into a soulful expression of sound. Not only has Joe written and produced the album, he also played keyboards, drum-set, aux. percussion, guitars, bass, synths, samples and sang all lead and backup vocals. Tracks such as &quot;Mrs. Oh&quot; and &quot;Call on Me&quot; reveal true inspiration and are speaking to a growing legion of fans. \n\nBorn and raised in Rochester, NY, Joe attended the Eastman School of Music as a jazz-performance major in drumset. His musical experiences in Rochester included lessons from Rich Thompson, Steve Gadd, Jack DeJohnette, Ron Carter (bass), Clay Jenkins (trumpet) and his father, John Bagale. At the young age of 17, he received the &quot;Outstanding Rhythm Section Award&quot; in the &quot;Essentially Ellington Competition,&quot; presented by Wynton Marsalis. While focusing on drumset, Joe was also developing outstanding skills on the piano, guitar, and bass, at the same time developing his vocal and compositional ability. Leaving Eastman early, Joe moved to San Francisco in search of his calling, where he now leads his own group, on guitar, keyboards and from sometimes even behind the drum kit, and is also a full time member of Bay Area bands: Supertaster, Realistic Orchestra, Dissappear Incompletely, and the Jazz Mafia Symphony Orchestra. Joe has a diverse fan base, having appeared for thousands at festivals and venues along both coasts including Lincoln Center's Avery Fischer Hall in NYC, the Hollywood Bowl, the Montreal Jazz Festival and the San Francisco Jazz Festival. He has shared the stage with the likes of Stevie Wonder, Bill Cosby, Lyrics Born, Zion-I, and has been a main writer/vocal director for the critically acclaimed Brass Bows and Beats.\n\nWith a new album in the works, and supporting shows planned for this summer and fall, Joe Bagale is moving forward and gaining notoriety nation wide as well as international. By connecting with his audience, and displaying phenomenal talent, Joe Bagale is emerging at the forefront of modern original music. Mass-market appeal hasn't been blended with soul like this since the heydays of Stevie Wonder and Steely Dan.","torrent":{"xt":"urn:btih:5bfecc3d3651fe072809fe8b21182b6929b87a07","amp;dn":"Joe+Bagale+-+Joe+Bagale","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bfecc3d3651fe072809fe8b21182b6929b87a07","infoHashBuffer":{"type":"Buffer","data":[91,254,204,61,54,81,254,7,40,9,254,139,33,24,43,105,41,184,122,7]},"announce":[],"urlList":[]}}