{"title":"The Sims 2 Apartment Pets [NDS][ESP] (By TUNEO)","uid":4378175,"size":33554456,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:5c29a749690e501e7820985f93ccf8a58fdb0f4e&amp;dn=The+Sims+2+Apartment+Pets+%5BNDS%5D%5BESP%5D+%28By+TUNEO%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TUNEO","files":2,"time":1220519186,"description":"Conocido es el dicho popular que dice que todo en la vida es mejor con cachorros y gatitos alrededor; sin embargo, en la ÃƒÂºltima instalaciÃƒÂ³n portÃƒÂ¡til de una de las franquicias mÃƒÂ¡s exitosas de todos los tiempos, los chicos de EA parecen querer acabar con esta escuela de pensamiento. Ã‚Â¿Son realmente asÃƒÂ­ de aburridas las mascotas en el mundo real?\n\nComo toda entrega relacionada a Los Sims, &quot;The Sims 2: Apartement Pets&quot; nos enfrenta al desafÃƒÂ­o de cuidar a nuestro Sim y a su hogar, sin olvidar el tema central de la entrega: las mascotas. AsÃƒÂ­ pues, el piso de nuestra personita virtual estarÃƒÂ¡ poblado por hamsters, serpientes y pÃƒÂ¡jaros, pero sÃƒÂ³lo los perros y los gatos representan un verdadero desafÃƒÂ­o en el sentido de que son las ÃƒÂºnicas especies que deberemos cuidar. AdemÃƒÂ¡s de la casa, el ÃƒÂºnico otro lugar al que nuestro Sim tendrÃƒÂ¡ acceso es una peluquerÃƒÂ­a para mascotas en la que podremos modificar la apariencia de nuestros compaÃƒÂ±eros peludos, y el de la tienda misma, con el fin de convertirnos en el orgulloso dueÃƒÂ±o de la tienda para mascotas mÃƒÂ¡s popular de la ciudad. Ã‚Â¡Vaya sueÃƒÂ±o!\n\nAunque la descripciÃƒÂ³n anterior podrÃƒÂ­a hacernos pensar que el juego presenta variadas herramientas de personalizaciÃƒÂ³n, la verdad es que la jugabilidad de la entrega es vergonzosamente pobre. La mayor parte del tiempo estaremos dedicados a completar con ÃƒÂ©xito una serie de minijuegos que incluyen, por ejemplo, aquel en el que vemos a nuestra mascota de perfil y recibimos la orden de acariciarla o peinarla en ciertos puntos determinados. Sin importar si estamos intoxicando a nuestro animal con perfume, casi ahogÃƒÂ¡ndolo en la tina o cepillÃƒÂ¡ndolo exhaustivamente, todos los minijuegos en el tÃƒÂ­tulo son exactamente iguales, incluyendo los opcionales presentados como &quot;sÃƒÂ³lo por diversiÃƒÂ³n&quot; que, en su mayorÃƒÂ­a, representan una verdadera pÃƒÂ©rdida de tiempo que no estaremos dispuestos a vivir mÃƒÂ¡s de una vez.\n\nEn lo que respecta a la personalizaciÃƒÂ³n, &quot;The Sims 2: Apartment Pets&quot; es un tÃƒÂ­tulo que, lamentablemente, queda en deuda con la franquicia a la cual pertenece. AsÃƒÂ­, por ejemplo, podremos comprar nuevos muebles para nuestro piso, pero sÃƒÂ³lo decidiremos en cuanto al estilo ya que la posiciÃƒÂ³n de los mismos es predeterminada. Por lo mismo, si eres un fanÃƒÂ¡tico de &quot;Los Sims&quot; por la amplia gama de posibilidades que los juegos te dan al momento de liberar al decorador de interiores que llevas dentro, es mejor que guardes tu dinero y lo gastes adquiriendo muebles reales para tu piso real.\n\nEn resumen, si tuviÃƒÂ©semos que describir esta nueva instalaciÃƒÂ³n en tan sÃƒÂ³lo una palabra, esta serÃƒÂ­a aburrida. Sin embargo, la guinda del pastel estÃƒÂ¡ dada por la figura del TÃƒÂ­o Bill, quien constantemente te enviarÃƒÂ¡ emails con informaciÃƒÂ³n supuestamente importante. No te preocupes por la renta, dice el tÃƒÂ­o, &quot;el dueÃƒÂ±o del piso y yo tenemos un arreglo&quot;. Al poco tiempo despuÃƒÂ©s, te encontrarÃƒÂ¡s con una mujer en un hogar para mascotas quien te explica que Bill tiene una copia de las llaves de tu piso y te ha dejado un gato que ha encontrado en la calle para que cuides de ÃƒÂ©l. Ã‚Â¿CuÃƒÂ¡l es el punto, entonces, en sumergirnos en una entrega de simulaciÃƒÂ³n si no podemos controlar la posiciÃƒÂ³n de nuestros muebles ni el tipo de mascotas que adoptamos? A pensar en esto, chicos, antes de adquirir una copia de este lamentable, pero cierto, juego del universo Sim.","torrent":{"xt":"urn:btih:5c29a749690e501e7820985f93ccf8a58fdb0f4e","amp;dn":"The+Sims+2+Apartment+Pets+%5BNDS%5D%5BESP%5D+%28By+TUNEO%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c29a749690e501e7820985f93ccf8a58fdb0f4e","infoHashBuffer":{"type":"Buffer","data":[92,41,167,73,105,14,80,30,120,32,152,95,147,204,248,165,143,219,15,78]},"announce":[],"urlList":[]}}