{"title":"tag_der_idioten_1981.xvid.avi","uid":4330301,"size":818701608,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5c42a3095cbcc565dc3139823a3b34a4131c9110&amp;dn=tag_der_idioten_1981.xvid.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mesothorax","files":1,"time":1218008820,"description":"Tag der Idioten ist ein deutscher Spielfilm des Autorenfilmers Werner Schroeter aus dem Jahre 1981.\n\nHandlung\n\nCarole Schneider ist eine schÃƒÂ¶ne Frau, doch ihr Leben ist eine einzige Schwierigkeit. Auch an Geld mangelt es ihr nicht und dennoch ist sie unzufrieden mit dem Leben. Mit aller Gewalt versucht sie die Aufmerksamkeit ihrer Mitmenschen zu erregen, doch dies gelingt ihr nicht mal bei ihrem Geliebten Alexander. In die Leere dieser Welt ruft sie ihr TÃƒÂ¶tet mich! hinaus. Doch ihre Provokationen enden meist ebenso im Nichts wie ihr Alltag. Erst als sie unberechtigterweise Menschen des Terrorismus verdÃƒÂ¤chtigt und bezichtigt, wird sie in eine Nervenheilanstalt eingeliefert. Mit den Wahnvorstellungen der anderen Insassen erweitert sie hier ihre eigenen Phantasien. Bald kann sie die RealitÃƒÂ¤t vom Wahnsinn nicht mehr unterscheiden. Sie entschlieÃƒÅ¸t sich dazu fÃƒÂ¼r immer in der Anstalt zu bleiben, wird jedoch als gesund entlassen. Dem Leben in der RealitÃƒÂ¤t erneut ausgeliefert begeht sie Selbstmord.\n\nHintergrund\n\nDie Dreharbeiten fanden vom 12. Februar bis zum 3. April 1981 in Prag und MÃƒÂ¼nchen statt. Der Film erlebte seine UrauffÃƒÂ¼hrung am 31. Oktober 1981 bei den Hofer Filmtagen. Im Jahr darauf war er Wettbewerbsbeitrag bei den Internationalen Filmfestspielen von Cannes 1982, ohne jedoch bei der Preisvergabe berÃƒÂ¼cksichtigt zu werden.","torrent":{"xt":"urn:btih:5c42a3095cbcc565dc3139823a3b34a4131c9110","amp;dn":"tag_der_idioten_1981.xvid.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c42a3095cbcc565dc3139823a3b34a4131c9110","infoHashBuffer":{"type":"Buffer","data":[92,66,163,9,92,188,197,101,220,49,57,130,58,59,52,164,19,28,145,16]},"announce":[],"urlList":[]}}