{"title":"BATTLE IN THE BALTICS 1944-45: The Fighting for Latvia, Lithuani","uid":5723197,"size":42393800,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c9b8b1eb6a5b71b8e88c6b5af7383e5791e5900&amp;dn=BATTLE+IN+THE+BALTICS+1944-45%3A+The+Fighting+for+Latvia%2C+Lithuani&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1280359726,"description":"Battle in the Baltics 1944 - 1945 is an exclusive insight into the last frantic months of the Wehrmacht and Waffen-SS on the Eastern Front 1944 - 1945. From mid-August 1944 there was nothing but a drum-beat of defeats for the German Army as it fought to the grim death to try and hold back the overwhelming might of the Russians from reaching the borders of the Reich. It was in the Baltic`s where Army Group North played a decisive role in trying to stem the rout and preventing the fragile lines from finally being smashed to pieces.\n\nDrawing on a host of rare and unpublished photographs accompanied by in-depth captions, the book provides a revealing insight into the last desperate months of the war. It reveals in detail how the remnants of Army Group North were driven back across a scarred and devastated wasteland to the borders of Estonia, Latvia, Lithuania, East Prussia and Pomerania. What followed was the Battle of the Baltic`s where exhausted and undermanned German forces fought to almost near extinction against the constant hammer blows of Soviet ground and aerial bombardments.\n\nEverywhere disintegrating German forces tried to cling onto vital ground. Eventually after many precious German Panzer and infantry divisions were encircled and annihilated the remnants of Hitler`s once vaunted force was pushed back through the Baltic states into East Prussia, and then fought to the death in the last few small pockets of land surrounding three ports: Libau in Kurland, Pillau in East Prussia and Danzig at the mouth of the River Vistula. It was here that the final battle of the Baltic`s would take place where German troops were ordered to `stand and fight` and wage an unprecedented battle of attrition. amazon.com","torrent":{"xt":"urn:btih:5c9b8b1eb6a5b71b8e88c6b5af7383e5791e5900","amp;dn":"BATTLE+IN+THE+BALTICS+1944-45%3A+The+Fighting+for+Latvia%2C+Lithuani","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c9b8b1eb6a5b71b8e88c6b5af7383e5791e5900","infoHashBuffer":{"type":"Buffer","data":[92,155,139,30,182,165,183,27,142,136,198,181,175,115,131,229,121,30,89,0]},"announce":[],"urlList":[]}}