{"title":"MAN'S MOST DANGEROUS MYTH The Fallacy of Race - M. F. ASHLEY MON","uid":12596799,"size":15844256,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e2ce2da9649c688c0fbd16028ffb2b7372a461f&amp;dn=MAN%27S+MOST+DANGEROUS+MYTH+The+Fallacy+of+Race+-+M.+F.+ASHLEY+MON&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"perfect_stan","files":1,"time":1445273644,"description":"MAN'S MOST DANGEROUS MYTH: The Fallacy of Race\r\nBy M. F. ASHLEY MONTAGU\r\n\r\nIn our time the problem of race has assumed an alarmingly exaggerated importance. Alarming, because racial dogmas have been made the basis for an inhumanly brutal political philosophy which has already resulted in the death or social disfranchisement of millions of innocent individuals; exaggerated, because when the nature of contemporary &quot;race&quot; theory is scientifically analyzed and understood it ceases to be of any significance for social or any other kind of action. It has been well said that there is no domain where the sciences, philosophy, and politics blend to so great an extent and in their contact have so much importance to the man of the present day and of the future as in modern &quot;race&quot; theory. Few problems in our time more pressingly require solution than this. It is highly desirable, therefore, that the facts about &quot;race,&quot; as science has come to know them, should be widely disseminated and clearly understood. To this end the present volume has been written. This book is not, however, a textbook or a treatise on &quot;race.&quot; It purports to be an examination of contemporary aspect of &quot;race&quot; theory, and seeks only to clarify the reader's thinking upon an important subject about which clear thinking is generally avoided. It would be quite beyond the powers of a single person to say all that there is to be said upon the subject. As Aldous Huxley has put it, &quot;The problem of race is as much a problem for historians and psychologists as for geneticists. Anything like a definite and authoritative solution of it must be cooperative. Also, to carry conviction, it should be official and international. The race theory claims to be scientific. It is, surely then, the business of science, as organized in the universities and learned societies of the civilized world, to investigate this claim.&quot;\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:5e2ce2da9649c688c0fbd16028ffb2b7372a461f","amp;dn":"MAN%27S+MOST+DANGEROUS+MYTH+The+Fallacy+of+Race+-+M.+F.+ASHLEY+MON","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e2ce2da9649c688c0fbd16028ffb2b7372a461f","infoHashBuffer":{"type":"Buffer","data":[94,44,226,218,150,73,198,136,192,251,209,96,40,255,178,183,55,42,70,31]},"announce":[],"urlList":[]}}