{"title":"Waking Up Dead [End of Days Love #1][2013][Emma Shortt][mobi/epu","uid":9094203,"size":1002767,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e601cd07af9d3a9ce0f345d36494c19a522bb5a&amp;dn=Waking+Up+Dead+%5BEnd+of+Days+Love+%231%5D%5B2013%5D%5BEmma+Shortt%5D%5Bmobi%2Fepu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"AN0NYMOUS142857","files":-1,"time":1382648732,"description":"Waking Up Dead [End of Days Love #1][2013][Emma Shortt][mobi/epub][INFERNO]\n\n\nWaking Up Dead (End of Days Love #1) Emma Shortt\n\n\n\nFormat: mobi/epub\nLength: 388 pages\nGenre: Horror\nDate: 22 October 2013\n\nYou know your life has hit rock bottom when you're living off cooked rats and showering once every few months - if you're lucky. But for Jackson Hart things are about to get a whole lot worse. When her best friend, Tye, disappears hunting for food, kick-ass Jackson's 'head south to safety' plan looks like it's dead before it's even begun. But then she meets ex-mechanic Luke Granger, who takes her to his bunker, feeds her with non-rat based food, and offers her protection against the zombie hordes - not that she needs it. She knows how to use a machete and isn't afraid to.\n\nJackson might have been tempted to stay in the city with her rescuer. Food, shampoo and the possibility of finally getting laid, what more could she ask for? But the flesh eaters are getting smarter and when the bunker is compromised, Jackson and Luke have no choice but to make the journey south.\n\nLuke and Jackson team up to find other humans in a road-trip romance for the ages. Travelling for thousands of miles with zombies shadowing their every move they must utilize every resource at their disposal?and then some. On the way, they discover that even if flesh eating zombies are knocking down their door, there's always time for sex and maybe even for love\n\nAuthor:\n\nAs a kid Emma wanted to be an astronaut, or maybe Captain Janeway. Because she didn't really think her career choices through very well she ended up in an everyday geek job, crunching numbers and sighing over syntax. It seemed a long way from the stars and in an effort to escape Emma decided to get serious about her other passion. Writing.\n\nSeveral years later and Emma has yet to walk on the moon or sit in the Captain's chair, but she is still writing. She scribbles stories in all sorts of genres, contemporary, paranormal, post-apocalyptic, historical, sci-fi...if she hasn't tried it yet she will before long. The only common theme is the romance. A hopeless romantic everything Emma writes has a love story in there somewhere.","torrent":{"xt":"urn:btih:5e601cd07af9d3a9ce0f345d36494c19a522bb5a","amp;dn":"Waking+Up+Dead+%5BEnd+of+Days+Love+%231%5D%5B2013%5D%5BEmma+Shortt%5D%5Bmobi%2Fepu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e601cd07af9d3a9ce0f345d36494c19a522bb5a","infoHashBuffer":{"type":"Buffer","data":[94,96,28,208,122,249,211,169,206,15,52,93,54,73,76,25,165,34,187,90]},"announce":[],"urlList":[]}}