{"title":"The Queen of Bedlam (Unabridged) by Robert R McCammon","uid":10734401,"size":1012168533,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5f3f383a8f68cefd958c6cc5f3775f8306d76e34&amp;dn=The+Queen+of+Bedlam+%28Unabridged%29+by+Robert+R+McCammon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dogmatist","files":-1,"time":1407676230,"description":"The Queen of Bedlam (Book 2 of Matthew Corbett Series)\nby Robert R McCammon\nNarrated by Edoardo Ballerini\nFormat: 3 High quality .mp3 files downloaded directly from Audible.com\n\nAs always, if thou enjoyest this work, then consider purchasing it to support the artist. \n\nDescription:\n\nHis epic masterwork Speaks the Nightbird, a tour de force of witch hunt terror in a colonial town, was hailed by Sandra Brown as &quot;deeply satisfying...told with matchless insight into the human soul.&quot;\nNow, Robert McCammon brings the hero of that spellbinding novel, Matthew Corbett, to 18th-century New York, where a killer wields a bloody and terrifying power over a bustling city carving out its identity - and over Matthew's own uncertain destiny.\nThe unsolved murder of a respected doctor has sent ripples of fear throughout a city teeming with life and noise and commerce. Who snuffed out the good man's life with the slash of a blade on a midnight street? The local printmaster has labeled the fiend &quot;the Masker,&quot; adding fuel to a volatile mystery...and when the Masker claims a new victim, hardworking young law clerk Matthew Corbett is lured into a maze of forensic clues and heart-pounding investigation that will both test his natural penchant for detection and inflame his hunger for justice.\nIn the strangest twist of all, the key to unmasking the Masker may await in an asylum where the Queen of Bedlam reigns - and only a man of Matthew's reason and empathy can unlock her secrets. From the seaport to Wall Street, from society mansions to gutters glimmering with blood spilled by a deviant, Matthew's quest will tauntingly reveal the answers he seeks - and the chilling truths he cannot escape.\n\nENJOY!!!","torrent":{"xt":"urn:btih:5f3f383a8f68cefd958c6cc5f3775f8306d76e34","amp;dn":"The+Queen+of+Bedlam+%28Unabridged%29+by+Robert+R+McCammon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f3f383a8f68cefd958c6cc5f3775f8306d76e34","infoHashBuffer":{"type":"Buffer","data":[95,63,56,58,143,104,206,253,149,140,108,197,243,119,95,131,6,215,110,52]},"announce":[],"urlList":[]}}