{"title":"Hindi - Jab We Met (2007) 2CD DVD-Rip XVid","uid":3963199,"size":1470609380,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5fc20faf435ea164e7cdfd0c10aaf87796279c25&amp;dn=Hindi+-+Jab+We+Met+%282007%29+2CD+DVD-Rip+XVid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"raghunayak","files":3,"time":1199573501,"description":"CAST: Kareena Kapoor, Shahid Kapur, Dara Singh, Kiran Juneja, Etc\nGENRE: Comedy, Rommance\nDIRECTOR: Imtiaz Ali\nPRODUCER: Dhilin Mehta\nLYRICS: Irshad Kamil\nMUSIC BY: Pritam, Sandesh Shandilya\nLANGUAGE: Hindi\nSUBTITLES: English\nSOURCE: DVD9\n\nIMDB:http://www.imdb.com/title/tt1093370/\n\nSynopsis :Aditya (Shahid Kapur), a defeated industrialist, is even more broken as the girl he loves is getting married. Unable to muster up the courage to return home, he drifts out of the gathering and aimlessly boards a train, bounding away into the night. As destiny would have it, on the train he meets Geet (Kareena Kapoor) ? a beautiful but annoyingly talkative girl who is leaving Mumbai to go her hometown ? Bhatinda (Punjab). Later, she has plans of eloping with her boyfriend. Geet irritates Aditya to the point of getting him to leave the train. As she tries to get him back on the train, she ends up missing it and the two find themselves stranded on a desolate station with no luggage or money. Begins the idyllic journey through the exuberant North Indian heartland in which this odd couple will make their way through buses and taxis and camel-carts, crossing Highways and deserts and lakes, meeting all kinds of people, to reach her house in Punjab. On arrival, Geet&amp;#039;s family mistakes the two for lovers. Before this misconception can be cleared, Geet escapes to her boyfriend in Manali. Aditya leaves with her, confirming the suspicion that they are lovers. In Manali, Aditya feels empowered to return to Mumbai and resurrect his ailing business. Life takes a positive turn and Aditya begins to do well. One day Geet&amp;#039;s family who think that she is with him confronts Aditya. He is shocked to learn that Geet has not returned home. He takes it upon himself to find her. He finally tracks her down in a Himalayan town and begins another journey to reach Bhatinda and flow into the colors and conceptions of a loud and happy North Indian family!How their separate journeys become one, forms the destination of JAB WE MET, a beautiful and captivating saga of made-for-each-other love. Lilting, musical, amusing and packed with mischievous contrivances ? this breezy fun-filled romantic comedy set in cultural North India looks like it&amp;#039;s ready to recreate the magical era of the 90s, in the form of Aditya and Geet, being essayed by real-life lovebirds, Shahid Kapoor and Kareena Kapoor.\n\nDetails:\n\nSIZE: 1,36 GB\n\nFile Name ..........: Jab We Met (2007) 2CD DVDRip - XviD.avi\nTotal Size (M ....: 1,402.34 MB\n\nVideo Size (M ....: 1,171.88 MB\nVideo Length .......: 02:23:50\nVideo Codec Code ...: XVID\nVideo Codec Name ...: XviD MPEG-4 codec\nVideo Bitrate ......: 1139 KB/s\nResolution .........: 672 x 288\nAspect Ratio .......: 2.33:1\nFramerate ..........: 23.976 FPS\n\nAudio Size (M ....: 230.45 MB\nAudio Codec Code ...: 85 (0x0055)\nAudio Codec Name ...: MPEG-1 Layer 3 (MP3)\nAudio Bitrate ......: 224 KB/s (CBR)\nChannels ...........: 2 Ch\nSampling Rate ......: 48000 Hz\n\nVisit http://download-guru.blogspot.com","torrent":{"xt":"urn:btih:5fc20faf435ea164e7cdfd0c10aaf87796279c25","amp;dn":"Hindi+-+Jab+We+Met+%282007%29+2CD+DVD-Rip+XVid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fc20faf435ea164e7cdfd0c10aaf87796279c25","infoHashBuffer":{"type":"Buffer","data":[95,194,15,175,67,94,161,100,231,205,253,12,16,170,248,119,150,39,156,37]},"announce":[],"urlList":[]}}