{"title":"Cecelia Ahern - Scrivimi ancora [Pdf Epub - Ita]","uid":12779580,"size":2353771,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6026e787b96773968bafd4cffedd73c205d062dd&amp;dn=Cecelia+Ahern+-+Scrivimi+ancora+%5BPdf+Epub+-+Ita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vitolanz","files":2,"time":1447781202,"description":"Cecelia Ahern - Scrivimi ancora [Pdf Epub - Ita][TNTVillage]\r\n--------------------------------------------------------------------------------\r\n.: Dettagli :.\r\n\r\nAutore: Cecilia Ahern\r\nTitolo: Scrivimi ancora \r\nAnno: 2006\r\nLingua: Italiana\r\nGenere: Rosa\r\nDimensione del file: 1,70 MB (PDF) 550 KB (ePub)\r\nFormato del file: PDF + ePub\r\n--------------------------------------------------------------------------------\r\n.: Trama :.\r\nFin da bambini, Rosie e Alex, compagni di banco in una scuola elementare di Dublino, cominciano a scriversi letterine e bigliettini in una fitta e tenera corrispondenza. Così si scambiano inviti alle feste, progettano marachelle o sparlano di genitori e insegnanti. Il tempo passa, ma loro non cambiano modo di comunicare, utilizzando le e-mail e gli sms per i pettegolezzi dell’adolescenza e per confessarsi le rispettive prime esperienze sentimentali. Quando Alex è costretto a trasferirsi a Boston, Rosie pensa a sua volta di iscriversi a un’università americana. Ma, alla vigilia della partenza, un evento inaspettato la costringe ad annullare il viaggio. Divisi da un oceano e dalle circostanze della vita, continueranno a scriversi, perché il loro intensissimo legame è destinato a non interrompersi mai…\r\n--------------------------------------------------------------------------------\r\n.: Biografia dell'autore :.\r\n\r\nCecelia Ahern (Dublino, 30 settembre 1981) è una scrittrice irlandese, laureata in giornalismo e comunicazione.\r\nÈ figlia del primo ministro irlandese Bertie Ahern, e sua sorella, Georgina, è sposata con Nicky Byrne, membro del gruppo pop irlandese Westlife. Cecilia ha sposato David Keoghan il 12 giugno 2010 in Celbridge, Irlanda. Dal 2009 è madre di una bambina, Robin, e nel 2012 è nato il suo secondogenito, Sonny.\r\nHa scritto il suo primo romanzo, P.S. I love you, a soli 20 anni. È divenuto un bestseller in brevissimo tempo ed è stato tradotto in oltre 50 paesi. Ben presto la Warner Bros ne ha acquistato i diritti per farne un film, uscito nei cinema italiani il 1º febbraio 2008 col titolo P.S. I Love You, e che vede protagonisti Hilary Swank e Gerard Butler. Nel 2014, invece, è uscito il film tratto da Scrivimi ancora, il secondo omonimo romanzo di Cecelia.\r\nOltre ad aver pubblicato diversi romanzi, ha scritto alcuni brevi racconti, destinando il ricavato delle vendite in opere di beneficenza. Ha prodotto la serie TV Samantha chi?, con Christina Applegate, trasmessa dall'emittente americana ABC","torrent":{"xt":"urn:btih:6026e787b96773968bafd4cffedd73c205d062dd","amp;dn":"Cecelia+Ahern+-+Scrivimi+ancora+%5BPdf+Epub+-+Ita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6026e787b96773968bafd4cffedd73c205d062dd","infoHashBuffer":{"type":"Buffer","data":[96,38,231,135,185,103,115,150,139,175,212,207,254,221,115,194,5,208,98,221]},"announce":[],"urlList":[]}}