{"title":"Rick Derringer-13 cd","uid":5312575,"size":904542157,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6030811f025108b8ee7e3417c474883f770baf88&amp;dn=Rick+Derringer-13+cd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"flitigalisa","files":138,"time":1264608612,"description":" &lt;a href=&quot;http://thepiratebay.se/user/flitigalisa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://thepiratebay.se/user/flitigalisa&lt;/a&gt;\n\n\nRick Derringer (born Richard Zehringer, August 5, 1947, in Fort Recovery, Ohio) is an American guitarist, vocalist, and entertainer\nWhen he was seventeen years old, his band The McCoys recorded &quot;Hang on Sloopy&quot; in the summer of 1965, which became the number one song in America before &quot;Yesterday&quot; by The Beatles knocked it out of the top spot. The song was issued by Bang Records. He adopted the Derringer stage name which was inspired by the Bang Records logo which featured a derringer pistol. \nPrior to being the McCoys, the group was first called &quot;The Rick Z Combo&quot;, then &quot;Rick and the Raiders&quot;, then &quot;Rick and the Ravens&quot;. \n \nDerringer, 1978\nDerringer also recorded and played with a version of Johnny Winter's band called &quot;Johnny Winter And ...&quot; and both Edgar Winter's White Trash and The Edgar Winter Group. Derringer also had a successful solo career, and his solo version of &quot;Rock and Roll, Hoochie Koo&quot; was a hit single. He also recorded extensively with Steely Dan, playing lead guitar on songs such as &quot;Show Biz Kids&quot;.\nDerringer appeared on Alice Cooper's Killer album in 1971, playing the solo on &quot;Under My Wheels.&quot; Along with Judas Priest, Derringer opened for Led Zeppelin on their last American tour  \nDerringer also performed a track for the World Wrestling Federation on The Wrestling Album. &quot;Real American&quot; would later be used as Hulk Hogan's entrance music (and was associated before with the tag team, U.S. Express). Derringer also performed the entrance theme for WWF Tag Team Demolition on Piledriver:The Wrestling Album 2, as well as a duet version of &quot;Rock 'n Roll Hoochie Koo&quot; with Gene Okerlund. \nSee also: Music in professional wrestling\nIn the 1980s, Derringer expanded his producing skills, discovering &quot;Weird Al&quot; Yankovic as well as Mason Ruffner. He also played on the second Silver Condor album on the track &quot;Thank God For Rock and Roll&quot;, produced and sung by Joe Cerisano. He has played for &quot;Weird Al&quot; on many of his albums, playing guitar and mandolin; on the track &quot;Eat It&quot;, Derringer played the guitar solo, an homage/parody to Eddie Van Halen's solo on the Michael Jackson song &quot;Beat It&quot;. Rick Derringer played guitar on &quot;Exciter&quot; on the album Lick It Up by KISS ] There is speculation that he played on other tracks as well.\nHe co-wrote and sang back-up vocals on &quot;Calm Inside The Storm&quot; on Cyndi Lauper's 1986 True Colors album. He served as one of her tour musicians from 1986 - 1992, prompting him to compare Cyndi to Barbra Streisand: &quot;She's better live than Barbra.&quot;\n","torrent":{"xt":"urn:btih:6030811f025108b8ee7e3417c474883f770baf88","amp;dn":"Rick+Derringer-13+cd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6030811f025108b8ee7e3417c474883f770baf88","infoHashBuffer":{"type":"Buffer","data":[96,48,129,31,2,81,8,184,238,126,52,23,196,116,136,63,119,11,175,136]},"announce":[],"urlList":[]}}