{"title":"Body For Hire - The Complete Bodyguard Training Series [Volume 1","uid":4828482,"size":2303021774,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:60df589082d8dadbb9256b0b1d8d5973cfe66b67&amp;dn=Body+For+Hire+-+The+Complete+Bodyguard+Training+Series+%5BVolume+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"aikijohn","files":-1,"time":1239040548,"description":"A multiple series of 2 hour videos featuring lessons in VIP Protection training. The instructors have provided bodyguard services to many in Hollywood including David Faustino, Jon Bon Jovi, Arnold Schwarzenegger, Robert Redford, and Randall TEX Cobb. This is the first and only bodyguard training video series available.\n\n\n\nRandall TEX Cobb, actor, Los Angeles, CA\nThese videos show lessons you can teach the celebrity what to do when fans become aggressive. I recommend these tapes.\n\n\n\n\nSeveral years ago I recruited a number of world class, experienced military and law enforcement professionals for a new training project. These instructors were drawn from the former ranks of the U.S. Army's DELTA force, the U.S. Department of Energy's top-secret security service, and some of America's most active law enforcement SWAT teams. Each instructor came to Hawk East, Inc.'s training program with special talents and skills as the country's best teachers. The VIP Protection Specialist Training Course comes from this program. Most on-site VIP Protection Specialist training courses cost thousands of dollars to attend. Now, you can begin your training for a fraction of that price. This DVD set contains all three videos comprising the complete Body For Hire VIP Protection basic course.\n\nRoger Hair, President of Hawk East, Inc.\n \n\n   \t\n\n4.0 out of 5 stars \nBody For Hire; The Complete Bodyguard Training Series, January 11, 2007\nBy William T. Anderson (Chicago, Il) - This tape series is a good intro for people who are wanting to get some idea of what is necessary to enter the executive protection field.. The presentation is well executed and is easily understood.. For someone who hasn't been through any type of Executive Protection field introduction or any classes, it is a good start..\n\n   \t\n\n5.0 out of 5 stars \nEh.....it's okay., January 8, 2008\nBy E. Thiel (New Jersey) - First off, the quality of the videos (direct VHS copies) isn't very good, but is watchable. That being said, the information is pretty good. I found vehicle searches, protective formations, and the defensive driving techniques to be the best parts. I wish I could have saved a ton of money and learned those few things in a book, or for free on a web site, but I haven't found those topics described the way they were in this video in any book or on any web site. So in that sense it was worth it. King of boring at times. Lots of lecturing from the class room. Definitely no worth $90. Even $50 would still be too much. Save your money.\n\n\n\n5.0 out of 5 stars \nBody Guard for Hire, May 12, 2007\nBy Ronald E. Sherrod - Excellent Training Tape. You can tell it was orignally VHS copied over to DVD. Very good content\n\n   \t\n4.0 out of 5 stars \nIntroduction, May 5, 2007\nBy M. Parr &quot;Kepi&quot; (Riga, Latvia) A reasonable introduction for people looking at the role of Executive Security before paying out for training. Pity that is a direct Video to DVD copy and it is a bit dated and could benefit from bringing it up to date. The content for the first session is a simple filming of classroom training. The remaining DVDs actually take you out of the classroom and become a bit more interesting.\n\nWould I recomend it, yeah, would I consider it definitive training, no, but it gives a good grounding into the concepts of Exec Protection.\n\n\n  \t\n4.0 out of 5 stars \nGreat place to start, November 9, 2008\nBy David - This video series is a starting point to see if you are &quot;really&quot; interested in this field and not the &quot;Kevin Costner&quot; movie.\n\n\n  \t\n4.0 out of 5 stars \nBodyguard Training, May 12, 2007\nBy JK (Australia) - A very informative DVD series for those entering the security industry prior to attending a course.\n\n\n  \t\n5.0 out of 5 stars \nGreat training supplement, July 8, 2005\nBy P.Foy (L.A. CA) - Great set of DVD's. Makes a great supplement to any Bodyguard training program.\n\n\n","torrent":{"xt":"urn:btih:60df589082d8dadbb9256b0b1d8d5973cfe66b67","amp;dn":"Body+For+Hire+-+The+Complete+Bodyguard+Training+Series+%5BVolume+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60df589082d8dadbb9256b0b1d8d5973cfe66b67","infoHashBuffer":{"type":"Buffer","data":[96,223,88,144,130,216,218,219,185,37,107,11,29,141,89,115,207,230,107,103]},"announce":[],"urlList":[]}}