{"title":"New Frontiers in Asymmetric Catalysis","uid":12085056,"size":13954499,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61090442b38432f320f0a5149b32e85b4f68cd15&amp;dn=New+Frontiers+in+Asymmetric+Catalysis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1435879085,"description":"New Frontiers in Asymmetric Catalysis - Koichi Mikami and Mark Lautens (Wiley, 2007).pdf\n\nISBN: 978-0-471-68026-0\n\nA compilation of recent advances and applications in asymmetric catalysis \nThe field of asymmetric catalysis has grown rapidly and plays a key role in drug discovery and pharmaceuticals. New Frontiers in Asymmetric Catalysis gives readers a fundamental understanding of the concepts and applications of asymmetric catalysis reactions and discusses the latest developments and findings. With contributions from preeminent scientists in their respective fields, it covers: \n* &quot;Rational&quot; ligand design, which is critically dependent on the reaction type (reduction, oxidation, and C-C bond formation) \n* Recent findings on activation of C-H bonds, C-C bonds, and small molecules (C=O, HCN, RN=C, and CO2) and the latest developments on C-C bond reorganization, such as metathesis \n* Advances in &quot;chirally economical&quot; non-linear phenomena, racemic catalysis, and autocatalysis \n* Some of the recent discoveries that have led to a renaissance in the field of organocatalysis, including the development of chiral Br?nstead acids and Lewis acidic metals bearing the conjugate base of the Br?nstead acids as the ligands and the chiral bi-functional acid/base catalysts \nThe book ends with a thought-provoking perspective on the future of asymmetric catalysis that addresses both the challenges and the unlimited potential in this burgeoning field. This is an authoritative, up-to-date reference for organic chemists in academia, government, and industries, including pharmaceuticals, biotech, fine chemicals, polymers, and agriculture. It is also an excellent textbook for graduate students studying advanced organic chemistry or chemical synthesis","torrent":{"xt":"urn:btih:61090442b38432f320f0a5149b32e85b4f68cd15","amp;dn":"New+Frontiers+in+Asymmetric+Catalysis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61090442b38432f320f0a5149b32e85b4f68cd15","infoHashBuffer":{"type":"Buffer","data":[97,9,4,66,179,132,50,243,32,240,165,20,155,50,232,91,79,104,205,21]},"announce":[],"urlList":[]}}