{"title":"Prayers for Bobby","uid":4676417,"size":1092349952,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6137fb8ff580f833b80b2d8cd837cc9b85feff8d&amp;dn=Prayers+for+Bobby&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DrGaellon","files":1,"time":1232914041,"description":"In &quot;Prayers for Bobby,&quot; Mary Griffith (Sigourney Weaver) is a devout Christian who raises her children with the conservative teachings of the Presbyterian Church. However, when her son Bobby (Ryan Kelley) confides to his older brother he may be gay, life changes for the entire family after Mary learns about his secret. While Bobby's father (Henry Czerny) and siblings slowly come to terms with his homosexuality, Mary believes God can cure him of what she considers his 'sin' and persuades Bobby to pray harder and seek solace in church activities in hopes of changing him. Desperate for his mother's approval, Bobby does what is asked of him, but through it all, the church's apparent disapproval of homosexuality causes him to grow increasingly withdrawn and depressed. Guilty over the pain he is causing Mary, Bobby moves away, yet hopes that some day his mother will accept him. His subsequent depression and self-loathing intensifies as he blames himself for not being the 'perfect' son and is driven to suicide. Faced with their tragedy, Mary begins to question her faith when she receives no answers from her pastor concerning her devastating loss. Through her long and emotional journey, Mary slowly reaches out to the gay community and discovers unexpected support from a very unlikely source. The film is based on the 1995 Leroy Aarons book of the same name. Also stars Dan Butler, Austin Nichols and Scott Bailey.","torrent":{"xt":"urn:btih:6137fb8ff580f833b80b2d8cd837cc9b85feff8d","amp;dn":"Prayers+for+Bobby","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6137fb8ff580f833b80b2d8cd837cc9b85feff8d","infoHashBuffer":{"type":"Buffer","data":[97,55,251,143,245,128,248,51,184,11,45,140,216,55,204,155,133,254,255,141]},"announce":[],"urlList":[]}}