{"title":"Jo Wood: Java Programming for Spatial Sciences","uid":4717374,"size":4540922,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:637f8e6fed4172b379240edf42aa52b23283bc55&amp;dn=Jo+Wood%3A+Java+Programming+for+Spatial+Sciences&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"VasiaZozulia","files":1,"time":1234350558,"description":"The Java programming language has been one of the most exciting internet-friendly technologies to emerge in the last decade. Java Programming for Spatial Sciences introduces the subject to those who wish to use computers to handle information with a geographical element. The book introduces object-oriented modeling including key concepts such as abstraction, inheritance and encapsulation. It shows how these ideas can be used to model, process and visualize geographic information leading the reader from initial ideas of class design through to the implementation of feature rich raster and vector models of space. It includes some of the more recent developments in internet technologies such as web-based applets, remote communication and XML, showing how these can be used to deliver geographic information in a modern computing environment. The text is aimed at new programmers as well as those in fields such as geography, GIS, remote sensing, archaeology and biology who wish to make use of geographic information. It provides a useful course text for advanced undergraduates and postgraduates in these fields. The material is heavily example-led, and contains programming exercises and quizzes, making it suitable for self-paced learning.","torrent":{"xt":"urn:btih:637f8e6fed4172b379240edf42aa52b23283bc55","amp;dn":"Jo+Wood%3A+Java+Programming+for+Spatial+Sciences","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"637f8e6fed4172b379240edf42aa52b23283bc55","infoHashBuffer":{"type":"Buffer","data":[99,127,142,111,237,65,114,179,121,36,14,223,66,170,82,178,50,131,188,85]},"announce":[],"urlList":[]}}