{"title":"Hermanos de Sangre 1x09x10 + Extras Final T01 HDTV Spanish by to","uid":6613571,"size":2456690888,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:640f910af6baaf98b13f913a45acb15ae3e6afdf&amp;dn=Hermanos+de+Sangre+1x09x10+%2B+Extras+Final+T01+HDTV+Spanish+by+to&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"carambolas","files":6,"time":1313688834,"description":"Si quieres mas series, peliculas, juegos, etc... tanto por descarga directa como por torrent. visitanos:\n &lt;a href=&quot;\nhttp://www.tonytorrent.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tonytorrent.com&lt;/a&gt;\n\nEn el aÃƒÂ±o 2000, Steven Spielberg y Tom Hanks revolucionaron la televisiÃƒÂ³n norteamericana con el estreno de una producciÃƒÂ³n ÃƒÂ©pica que cambiÃƒÂ³ el panorama audiovisual de este paÃƒÂ­s durante toda la temporada: Hermanos de Sangre.\nLa cadena HBO, la mÃƒÂ¡s prestigiosa cadena de pago de Estados Unidos, fichÃƒÂ³ a estos grandes de Hollywood para liderar un equipo de estrellas que llevÃƒÂ³ a cabo esta superproducciÃƒÂ³n, cuyo coste superÃƒÂ³ los 120 millones de euros (Cerca de veinte mil millones de pesetas).\n\nHermanos de Sangre narra de un modo vivo y realista todas las experiencias que cualquier soldado de la Segunda Guerra Mundial mantendrÃƒÂ­a para siempre en su memoria. Con un trasfondo muy intenso emocionalmente, la serie recorre los triunfos y las tragedias de una unidad militar que no sÃƒÂ³lo se convirtiÃƒÂ³ en un sÃƒÂ­mbolo de la lucha aliada, sino que tambiÃƒÂ©n sirviÃƒÂ³ para definir a toda una saga de hÃƒÂ©roes de carne y hueso. Hermanos de Sangre presenta una perspectiva nunca vista del conflicto armado mÃƒÂ¡s importante de la historia de la humanidad, a travÃƒÂ©s de la uniÃƒÂ³n y la camaraderÃƒÂ­a de un grupo de hombres que fueron capaces de conquistar aquello que parecÃƒÂ­a imposible.","torrent":{"xt":"urn:btih:640f910af6baaf98b13f913a45acb15ae3e6afdf","amp;dn":"Hermanos+de+Sangre+1x09x10+%2B+Extras+Final+T01+HDTV+Spanish+by+to","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"640f910af6baaf98b13f913a45acb15ae3e6afdf","infoHashBuffer":{"type":"Buffer","data":[100,15,145,10,246,186,175,152,177,63,145,58,69,172,177,90,227,230,175,223]},"announce":[],"urlList":[]}}