{"title":"Interactive Information Retrieval in Digital Environments","uid":4732731,"size":4200956,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:645bf5c486d8e98fd91f734300aa8cf7d70d0a47&amp;dn=Interactive+Information+Retrieval+in+Digital+Environments&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VasiaZozulia","files":1,"time":1235122998,"description":"The emergence of the Internet allows millions of people to use a variety of electronic information retrieval systems, such as: digital libraries, Web search engines, online databases, and online public access catalogs. Interactive Information Retrieval in Digital Environments provides theoretical framework in understanding the nature of information retrieval, and offers implications for the design and evolution of interactive information retrieval systems. Interactive Information Retrieval in Digital Environments includes the integration of existing frameworks on user-oriented information retrieval systems across multiple disciplines; the comprehensive review of empirical studies of interactive information retrieval systems for different types of users, tasks, and subtasks; and the discussion of how to evaluate interactive information retrieval systems. Researchers, designers, teachers, scholars, and professionals will gain the foundation for new research on this subject matter, and guidance to evaluate new information retrieval systems for the general public as well as for specific user groups.","torrent":{"xt":"urn:btih:645bf5c486d8e98fd91f734300aa8cf7d70d0a47","amp;dn":"Interactive+Information+Retrieval+in+Digital+Environments","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"645bf5c486d8e98fd91f734300aa8cf7d70d0a47","infoHashBuffer":{"type":"Buffer","data":[100,91,245,196,134,216,233,143,217,31,115,67,0,170,140,247,215,13,10,71]},"announce":[],"urlList":[]}}