{"title":"Overkill-White Devil Armory 320k  mp3  ak2014","uid":10561595,"size":121912774,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:64ffbec67ad7c032a1dc8324ff487fd408ec08e0&amp;dn=Overkill-White+Devil+Armory+320k++mp3++ak2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":11,"time":1405461952,"description":"Overkill-White Devil Armory 320k  mp3  ak2014 What we got...Overkill is an American thrash metal band, formed in 1980 in New Jersey. They have gone through many line-up changes, with singer Bobby &quot;Blitz&quot; Ellsworth and bassist D.D. Verni remaining from the original lineup. Along with Anthrax, whose one-time lead guitarist Dan Spitz was also an early member of Overkill, the band is one of the most successful East Coast thrash metal bands. The band has a notable mascot named &quot;Chaly&quot;, a skeletal bat with a skull-like face, horns, bony wings, and green eyes. Chaly has appeared on most of their album covers.\n\nTo date, Overkill has released seventeen studio albums (including an album of cover songs), three EPs and three live albums. They were one of the early thrash metal bands to sign to a major label (Atlantic Records, in 1986), but would not achieve commercial success until the popularization of the genre in the late 1980s, with their contemporaries Anthrax, Exodus, Metallica, Megadeth, Slayer and Testament. The band's most successful records are Under the Influence (1988), The Years of Decay (1989), I Hear Black (1993) and The Electric Age (2012), which debuted at No. 142, No. 155, No. 122 and No. 77 respectively on the Billboard 200 chart. As of 2006, Overkill has sold over 625,000 albums in the U.S. since the beginning of the SoundScan era and over 1.6 million records worldwide as of 2012. And now the time is for this new album so get it........","torrent":{"xt":"urn:btih:64ffbec67ad7c032a1dc8324ff487fd408ec08e0","amp;dn":"Overkill-White+Devil+Armory+320k++mp3++ak2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64ffbec67ad7c032a1dc8324ff487fd408ec08e0","infoHashBuffer":{"type":"Buffer","data":[100,255,190,198,122,215,192,50,161,220,131,36,255,72,127,212,8,236,8,224]},"announce":[],"urlList":[]}}