{"title":"Sexually Broken--Stunning Cherie DeVille turned into blowjob dev","uid":9416256,"size":850705245,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:6895d93353051c71dbda5c35570be5f1c93845fa&amp;dn=Sexually+Broken--Stunning+Cherie+DeVille+turned+into+blowjob+dev&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1388450800,"description":"Stunning Cherie DeVille turned into blowjob device, hardcore deepthroating, relentless pounding! | Cherie DeVille | Matt Williams\n\nDecember 30, 2013\n\n\nMP4 only.\n\n\nBeautiful Cherie DeVille oozes quiet grace and sophistication, coming across as quite the lady. We here at Sexuallybroken don't give a damn how classy she is, today she is getting reduced to a blowjob device. She will be turned into just a mouthhole for our use and pleasure. \n\nKneeling bound in a classic slave position that spreads her legs open wide, Cherie is blindfolded and ring gagged. The ringgag keeps her face cranked open, there is nothing she can do to protect her throat. A high powered vibrator is bolted in place between her opened legs. Her neck is bound against a custom made bondage device. This refined specimen of womanhood is now nothing but a cocksheath. Any hard cock that came by could make use of this handy tool. We walk right up and make ourselves right at home.\n\nCherie sputters, completely unable to stop us from sliding in. We own every inch of her soft pink throat. The blindfold keeps her dizzy and disoriented, but we want to see those big blue eyes of hers struggling around the dick. We rip it off, forcing her to look at us. Her face is flushed and her eyes water. This princess is now just a cock slave. The bondage, the relentless pounding out of her throat meat, the utter helplessness of her situation has Cherie swooning.\n\nWhile the dick owns her mouth, the vibrator has been working the other end, ripping out orgasm after orgasm out of her exposed cunt. Cherie is broken down and covered in her own juices, her messy mouth running down her toned body. We leave the vibrator on full blast. Today we are going to milk every single orgasm possible out of that bound body. Cherie twitches and gasps, blasted deep into sexual subspace and unable to to a thing to stop it. Enjoy the ride dear. \n \nScreens  &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_30cdeville/SexuallyBroken-Cherie-DeVille-Matt-Williams-Stunning-Cherie-DeVille-turned-into-blowjob-device-hardcore-deepthroating-relentless-pounding.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_30cdeville/SexuallyBroken-Cherie-DeVille-Matt-Williams-Stunning-Cherie-DeVille-turned-into-blowjob-device-hardcore-deepthroating-relentless-pounding.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:6895d93353051c71dbda5c35570be5f1c93845fa","amp;dn":"Sexually+Broken--Stunning+Cherie+DeVille+turned+into+blowjob+dev","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6895d93353051c71dbda5c35570be5f1c93845fa","infoHashBuffer":{"type":"Buffer","data":[104,149,217,51,83,5,28,113,219,218,92,53,87,11,229,241,201,56,69,250]},"announce":[],"urlList":[]}}