{"title":"Mr. Andrea Bocelli Sacred Arias Concert (DivX)","uid":5163840,"size":837856313,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:68a1dacf0ab05c841577c7c7538807c6c4c24ef9&amp;dn=Mr.+Andrea+Bocelli+Sacred+Arias+Concert+%28DivX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mrizzo2","files":-1,"time":1258304033,"description":"IMDB http://www.imdb.com/title/tt0305217/\n\nThis is a re-launch of this concert torrent, if youve downloaded this video\nbefore, please feel free to join this torrent instead as its multitracker\nenabled and you only need download a jpg images of th dvd cover we've since\nadded as a souvenir. Great quality video and sound!\n\nMr. Andrea Bocelli exemplifies the supreme spirit of the men of Italy in the\nsense of genuine idealism that is at the core of their sense of being. I am\nhopeful that this greatness will once again see its due on this earth as these\nmen have a desire for legitimacy in their midst in respect of what they will\nallow to prevail ultimately that will be an example to all.\n\nThis concert has some true greats including a supreme &quot;Ave maria&quot; rendition\nat the very start of th programme. The choice of conductor is not to my liking\nI must admit as th mechanical movements are dissonant to the material at hand,\nas such i suggest that this element of the programme be overlooked and the\ngenius of Bocelli focussed on exclusively instead. ta!!\n\nMichael Rizzo Chessman\nReview: moviesbyrizzo.info\n\n\nOptional Note: This is a multi-tracker torrent\nIf you use utorrent software, simply highlight the mounted torrent, then\nclick on &quot;trackers&quot; in your software, next, right click on the tracker that\nis showing, and select &quot;add tracker&quot; You should then then see all the trackers\nthat are alreay included atthe outset. Place a space (blank line) between each\ntracker showing, then click &quot;ok&quot; Your trackers will now show status and update\nmore easily when required (if desired, right click manually, on a selected\ntracker/DHT and select &quot;update&quot; for a better read).\n\nPS If you enable &quot;show alternating background color&quot; in your preferences\nmenu for &quot;UI settings&quot;, you'll find your screen easier on the eye and more\npleasing to read. Enjoy!\n","torrent":{"xt":"urn:btih:68a1dacf0ab05c841577c7c7538807c6c4c24ef9","amp;dn":"Mr.+Andrea+Bocelli+Sacred+Arias+Concert+%28DivX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68a1dacf0ab05c841577c7c7538807c6c4c24ef9","infoHashBuffer":{"type":"Buffer","data":[104,161,218,207,10,176,92,132,21,119,199,199,83,136,7,198,196,194,78,249]},"announce":[],"urlList":[]}}