{"title":"Halloween Sounds - Ligar","uid":4465733,"size":75661382,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:690feb3ffb615165b29c14d012d6bb3e91d3f39a&amp;dn=Halloween+Sounds+-+Ligar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ligar","files":1,"time":1224903446,"description":"this is a very long mp3 rip of a Halloween Sounds CD I had laying around. This is a release one week before Halloween rolls around for you guys. Here's some details for you guys:\n\nWhat exactly is the audio? A bunch of sounds like howls of wolves, ghostly sounds, screams, thunder, etc.\n\nHow long is it? 55 minutes and 17 seconds\n\nWhat would you recommend this in use for? A haunted house, maybe a party. These sounds could be a little scary (especially the screaming) so maybe a very young childrens' party wouldn't be the best idea but you can make up your own minds.\n\nIf you need any more info, ask below, but I'd recommend just downloading it. Happy Halloween!\n\n\nI converted the file into two parts that are ready for direct download here:\nPart I:\nhttp://ligartorrents.tripod.com/hw1.htm\nPart II:\nhttp://ligartorrents.tripod.com/hw2.htm\n\n^^^^^^^^^^^^^^^^^^^^\nThese links are .htm links, these are just so I can see how many people actually use the links, as you can see, they have a counter in green on the window and it counts down from 5 to redirect to the files.\n\n---------------------------------------------------------------------------------\n\nI just REALLY wanted to thank you guys for being such good downloaders on this torrent, I went to an uploader computer and forgot my flash drive so I had to use the torrent (I dodn't hold myself back too much because it has almost 100 seeders!) and I get 200kb/s! Thank-you so much! I downloaded in about 2 minutes! This is my most successful torrent yet but I did release this a week before halloween (on a Friday this year! yay!) and it is legit with direct download links.\n---------------------------------------------------------------------------------\n\nIt's halloween today and I really wanted to thank you again! 234 seeders as I'm seeing now! Have fun, leave comments and stuff if you want saying how you used it, or not, whatever. Have fun and stay safe on Halloween tonight!","torrent":{"xt":"urn:btih:690feb3ffb615165b29c14d012d6bb3e91d3f39a","amp;dn":"Halloween+Sounds+-+Ligar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"690feb3ffb615165b29c14d012d6bb3e91d3f39a","infoHashBuffer":{"type":"Buffer","data":[105,15,235,63,251,97,81,101,178,156,20,208,18,214,187,62,145,211,243,154]},"announce":[],"urlList":[]}}