{"title":"All About History - Book Of US Presidents 2016","uid":14072383,"size":32521658,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69a711aa4645a15e551149c2145abe7850266706&amp;dn=All+About+History+-+Book+Of+US+Presidents+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1459186997,"description":"From inspirational leaders like Abraham Lincoln to flawed and controversial figures such as Richard Nixon, the White House has played host to some of the most iconic individuals in history. The All About History Book of US Presidents profiles each and every one of them. With detailed features on every president, from Washington to Obama, this book offers a compelling insight into the people that shaped the United States as we know it today. We hope you enjoy it. Featuring: George Washington – An instrumental figure in world history, Washington was the United States’ first and arguably greatest president. Abraham Lincoln – Politically, the president of a country waging war on itself ought to have failed, yet Abraham Lincoln is revered for his leadership. John F Kennedy – An iconic leader whose time in office was fraught with Cold War tension, ‘JFK’ remains a fascinating figure years after his untimely death. Richard Nixon – One of the most controversial and enigmatic presidents ever, Nixon’s legacy will forever be tarnished by the scandal that led to his downfall.\r\n\r\nAll About History: Book Of US Presidents 2016\r\nEnglish | PDF | 148 pages | 22.77 MB","torrent":{"xt":"urn:btih:69a711aa4645a15e551149c2145abe7850266706","amp;dn":"All+About+History+-+Book+Of+US+Presidents+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69a711aa4645a15e551149c2145abe7850266706","infoHashBuffer":{"type":"Buffer","data":[105,167,17,170,70,69,161,94,85,17,73,194,20,90,190,120,80,38,103,6]},"announce":[],"urlList":[]}}