{"title":"Microemulsions - Properties and Applications - Monzer Fanun","uid":15300164,"size":11779494,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ac201914dfe83bf67adbe15007597588efee307&amp;dn=Microemulsions+-+Properties+and+Applications+-+Monzer+Fanun&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1468474252,"description":"Microemulsions - Properties and Applications - Monzer Fanun (CRC, 2009).pdf\r\n\r\nISBN 978-1-4200-8959-2\r\n\r\nThe effective use of microemulsions has increased dramatically during the past few decades as major industrial applications have expanded in a variety of fields. Microemulsions: Properties and Applications provides a complete and systematic assessment of all topics affecting microemulsion performance and discusses the fundamental characteristics, theories, and applications of these dispersions.\r\n\r\nThoroughly encompassing the significant developments of the past ten years, this book describes a wide range of topics, including interactions at microemulsion interfaces, new types of surfactants, and the fundamentals of nanotechnology. It outlines experimental and traditional measurement techniques in a variety of microemulsified systems and provides reliable coverage of applicable techniques.\r\n\r\nTheory and Characterization Methods\r\n\r\nThe initial chapters cover theoretical aspects of microemulsion formulation, with particular focus on methodologies for preparation. The book also addresses characterization methods, including X-ray diffraction, transmission electron microscopy (TEM), light scattering, and small-angle neutron scattering. It includes discussions of viscosimetry, conductivity, ultrasonic velocity, and nuclear magnetic resonance (NMR).\r\n\r\nPractical Applications\r\n\r\nThe remainder of the coverage focuses on current and potential applications of microemulsions. The book examines commercial uses, including biocatalysis and enzymatic reactions, nutrition, the extraction of contaminated solids, pollution control, dispersion of drugs, and oil recovery. The contributors also discuss the use of microemulsions as a reaction medium for the formation of polymeric and inorganic nanoparticles, and applications in electrokinetic chromatography.\r\n\r\nComprising the work of an international community of colloid scientists, this book explains why microemulsions are used for the intended application, how they are made, and how they react. Each chapter contains a description of the fundamental phenomena and principles involved in microemulsion processes, emphasizing the mechanism of microemulsion formation and deformation. A summary of recent research, the book eliminates the need to search through dozens of arcane online journal articles for critical information","torrent":{"xt":"urn:btih:6ac201914dfe83bf67adbe15007597588efee307","amp;dn":"Microemulsions+-+Properties+and+Applications+-+Monzer+Fanun","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ac201914dfe83bf67adbe15007597588efee307","infoHashBuffer":{"type":"Buffer","data":[106,194,1,145,77,254,131,191,103,173,190,21,0,117,151,88,142,254,227,7]},"announce":[],"urlList":[]}}