{"title":"My Dysfunctional Family S01E01 Turning A Blind Eye WS DSR x264-N","uid":10512704,"size":250247763,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6ae56c59ea95f5e336e174433ba098e937dd7588&amp;dn=My+Dysfunctional+Family+S01E01+Turning+A+Blind+Eye+WS+DSR+x264-N&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RKSTR","files":1,"time":1404866918,"description":"Struggling parents call family fixer Dave Vitalli for help with their difficult teenagers, but anything can happen when he shows up. His years of experience working with families in crisis have taught him the apple usually doesn't fall far from the tree, and parents soon find themselves under as much scrutiny as their kids. You won't find Vitalli's techniques in any textbook. Armed with lie detectors, drug-sniffing dogs and other surprise tactics, Vitalli pulls no punches digging out the truth and setting families straight.\n\nEpisode 1\nFamily fixer Dave Vitalli sets off to Virginia to help a struggling single mom, Kandace, whose teenagers now run the household. Oldest daughter Amber loves to party, and 16-year-old Justus continuously gets high. The attitude and lack of respect from the youngest daughter, Ashton, is a constant source of frustration for everyone. Dave must reign in the teens and give their mother a wake-up call before the family falls completely apart.\nKandace (Mom) -- Kandace has admittedly given up as a mother, and she's turned a blind eye to her kids' drinking and drug use.\nAmber age 17, Justus age 16 &amp; Ashton age 13 ","torrent":{"xt":"urn:btih:6ae56c59ea95f5e336e174433ba098e937dd7588","amp;dn":"My+Dysfunctional+Family+S01E01+Turning+A+Blind+Eye+WS+DSR+x264-N","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ae56c59ea95f5e336e174433ba098e937dd7588","infoHashBuffer":{"type":"Buffer","data":[106,229,108,89,234,149,245,227,54,225,116,67,59,160,152,233,55,221,117,136]},"announce":[],"urlList":[]}}