{"title":"Conversations with Myself - Nelson Mandela .epub","uid":9363268,"size":17005362,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b089dc2ae3bf141cfd0bdaa964c0901dd8d32dc&amp;dn=Conversations+with+Myself+-+Nelson+Mandela+.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387325259,"description":"Nelson Mandela is widely considered to be one of the most inspiring and iconic figures of our age. Now, after a lifetime of taking pen to paper to record thoughts and events, hardships and victories, he has bestowed his entire extant personal papers, which offer an unprecedented insight into his remarkable life.\n\nA singular international publishing event, Conversations with Myself draws on Mandela's personal archive of never-before-seen materials to offer unique access to the private world of an incomparable world leader. Journals kept on the run during the anti-apartheid struggle of the early 1960s; diaries and draft letters written in Robben Island and other South African prisons during his twenty-seven years of incarceration; notebooks from the postapartheid transition; private recorded conversations; speeches and correspondence written during his presidency--a historic collection of documents archived at the Nelson Mandela Foundation is brought together into a sweeping narrative of great immediacy and stunning power. An intimate journey from Mandela's first stirrings of political consciousness to his galvanizing role on the world stage, Conversations with Myself illuminates a heroic life forged on the front lines of the struggle for freedom and justice.\n\nWhile other books have recounted Mandela's life from the vantage of the present, Conversations with Myself allows, for the first time, unhindered insight into the human side of the icon.","torrent":{"xt":"urn:btih:6b089dc2ae3bf141cfd0bdaa964c0901dd8d32dc","amp;dn":"Conversations+with+Myself+-+Nelson+Mandela+.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b089dc2ae3bf141cfd0bdaa964c0901dd8d32dc","infoHashBuffer":{"type":"Buffer","data":[107,8,157,194,174,59,241,65,207,208,189,170,150,76,9,1,221,141,50,220]},"announce":[],"urlList":[]}}