{"title":"Kaufmann - Nietzsche Philosopher, Psychologist, Antichrist","uid":4853059,"size":6371181,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b778193d55d7cf8aaa871b5cae679dca5b415dc&amp;dn=Kaufmann+-+Nietzsche+Philosopher%2C+Psychologist%2C+Antichrist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gorra09","files":-1,"time":1239952412,"description":"This is the best biography of Nietzsche that I have read. I'm glad I found an ebook copy in PDF format to own and to share. Here's some info:\n\nNietzsche, philosopher, psychologist, antichrist\nBy Walter Arnold Kaufmann\nPublished by Princeton University Press, 1974\nISBN 0691019835, 9780691019833\n\nThis classic is the benchmark against which all modern books about Nietzsche are measured. When Walter Kaufmann wrote it in the immediate aftermath of World War II, most scholars outside Germany viewed Nietzsche as part madman, part proto-Nazi, and almost wholly unphilosophical. Kaufmann rehabilitated Nietzsche nearly single-handedly, presenting his works as one of the great achievements of Western philosophy. Responding to the powerful myths and countermyths that had sprung up around Nietzsche, Kaufmann offered a patient, evenhanded account of his life and works, and of the uses and abuses to which subsequent generations had put his ideas. Without ignoring or downplaying the ugliness of many of Nietzsche's proclamations, he set them in the context of his work as a whole and of the counterexamples yielded by a responsible reading of his books. More positively, he presented Nietzsche's ideas about power as one of the great accomplishments of modern philosophy, arguing that his conception of the &quot;will to power&quot; was not a crude apology for ruthless self-assertion but must be linked to Nietzsche's equally profound ideas about sublimation. He also presented Nietzsche as a pioneer of modern psychology and argued that a key to understanding his overall philosophy is to see it as a reaction against Christianity. Many scholars in the past half century have taken issue with some of Kaufmann's interpretations, but the book ranks as one of the most influential accounts ever written of any major Western thinker.\n","torrent":{"xt":"urn:btih:6b778193d55d7cf8aaa871b5cae679dca5b415dc","amp;dn":"Kaufmann+-+Nietzsche+Philosopher%2C+Psychologist%2C+Antichrist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b778193d55d7cf8aaa871b5cae679dca5b415dc","infoHashBuffer":{"type":"Buffer","data":[107,119,129,147,213,93,124,248,170,168,113,181,202,230,121,220,165,180,21,220]},"announce":[],"urlList":[]}}