{"title":"Thunder Wolves (2-click run)","uid":8543553,"size":671535503,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6bd869ae98d4cb2a87dcd6ed79fac1ae7dc43d57&amp;dn=Thunder+Wolves+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1370459718,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nWhen this wolf pack strikes, you hear the thunder roll. The Thunder Wolves\nattack from the air. They are mercenaries, and the best helicopter pilots in\nthe world. Every one of them is ready for action at all timesand ready to\nfight evil, wherever it lurks.\n\nThe Thunder Wolves have already made it through countless battles. They are\nequipped to destroy their enemiesdestruction is part of their business. Put\nyourself in the pilot's seat of a combat helicopter and become a member of\nthe most experienced and dangerous helicopter team in the world!\n\nSupport the Thunder Wolves in their global battle against terrorism. Take\npart in varied operations and do whatever it takes to thwart the diabolical\nplans of your enemies! Defeat them once and for all, and save the world!\n\nFeatures\n* Experience furious helicopter action in this relentless, adrenaline (and\nlead) pumped arcade shooter!\n* Master 13 action-packed missions in 4 different regions of the world!","torrent":{"xt":"urn:btih:6bd869ae98d4cb2a87dcd6ed79fac1ae7dc43d57","amp;dn":"Thunder+Wolves+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bd869ae98d4cb2a87dcd6ed79fac1ae7dc43d57","infoHashBuffer":{"type":"Buffer","data":[107,216,105,174,152,212,203,42,135,220,214,237,121,250,193,174,125,196,61,87]},"announce":[],"urlList":[]}}