{"title":"Planet Earth: Caves 1080i.DivX.AC3.mkv","uid":3675710,"size":2434475123,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:6c826c9631b9545c03218736c40af850dadc5e21&amp;dn=Planet+Earth%3A+Caves+1080i.DivX.AC3.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bell0q","files":1,"time":1177814847,"description":"Planet Earth: Caves\nVideo: MKV, 3viX 4.5.1 (DivX), 1080i HD\nResolution: 1920x1080 (1.77:1)\nFPS: 29.97 fps, 6189kbps\nAudio: AC3 5.1+LFE, 48kHz, 384kbps\nBitrate: 6.42Mbps\nDuration: 49:21\nSource: HDTV, Discovery HD Theater\n\nThe Cave of Swallows in Mexico is a 400 metre vertical shaft. Its deep enough to engulf the Empire State Building yet few people even know its existence.\n\nLechuguilla cave, in the USA, is 193 kilometres long and 500 metres deep. It contains whole chambers filled with the most astonishing crystals including some a staggering six metres long. There&amp;#039;s nothing like it anywhere on earth yet the name Lechuguilla is virtually unheard of.\n\nCaves are Planet Earth&amp;#039;s final frontier and this programme will go where few have been before.\n\nCaves are one of the only habitats not directly driven by sunlight but this doesn&amp;#039;t mean there&amp;#039;s no wildlife.\n\nCave angel fish are perhaps the most adapted creatures on earth since they live only on cave waterfalls - hanging on with microscopic hooks on their flattened fins. Until now they have never been filmed before.\n\nDeer Cave in Borneo is a daytime retreat for five million bats and their droppings support an entire community of creatures. Shine a light on one massive pile of droppings and the whole place shimmers with millions of dung-eating insects.\n\nPlanet Earth descends into an undiscovered world to introduce some of the most remarkable and bizarre animals on earth.\n\nFrom cave swiftlets who navigate through pitch black caverns using echo locations and build nests out of saliva, to the troglodytes - weird creatures that never see daylight or ever set foot on the surface.\n\nSpecialists like the Texas cave salamander and Thailand&amp;#039;s cave angel fish have neither eyes nor pigment. The entire populations of both are found in just a couple of caves.\n\nGaining unique access to a hidden world including poisonous caves and flooded caves, full of stalactites, stalagmites, snotites, and troglodytes, few natural history programmes could boast such a wealth of surprises.","torrent":{"xt":"urn:btih:6c826c9631b9545c03218736c40af850dadc5e21","amp;dn":"Planet+Earth%3A+Caves+1080i.DivX.AC3.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c826c9631b9545c03218736c40af850dadc5e21","infoHashBuffer":{"type":"Buffer","data":[108,130,108,150,49,185,84,92,3,33,135,54,196,10,248,80,218,220,94,33]},"announce":[],"urlList":[]}}