{"title":"The Dragon Lord's Daughters  by Bertrice Small EPUB EN","uid":9193795,"size":426765,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6e6ed02f523910e97804c59dde2338375d97c6c5&amp;dn=The+Dragon+Lord%27s+Daughters++by+Bertrice+Small+EPUB+EN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"perseu","files":-1,"time":1384443364,"description":"\nAVERIL - She may be the Lord's eldest and illegitimate\ndaughter, but Averil knows her dazzling beauty can buy her\nwhat she wants most: marriage to a great and powerful lord.\nBut fate has other plans in the rugged form of Rhys Fitzhugh.\nThinking her the sole heiress, the penniless bailiff kidnaps\nthe beauty. Now, to salvage his honor, he must marry the\nopenly hostile Averil and accept his greatest challenge...\nwinning her love, loyalty, and trust...\n\nMAIA - As the legitimate heiress with a hefty dowry, Maia can\nhave any man she chooses, namely Emrys Llyn, a descendant of\nLancelot and the Lady of the Lake. But strange, dangerous\nrumours surround the handsome Emrys... his name means &quot;immortal,&quot;\nand two of his wives have died suddenly under mysterious\ncircumstances. Can her unwavering love prove his innocence... or\nwill Maia suffer the same fate as Emry's previous wives?\n\nJUNIA - As charming as she is irrepressible, Junia is the Lord's\nyoungest daughter. Her father has long since given up trying to\ncontrol her whims and passions, and Junia is content to roam the\ncountryside where she can be alone with the gentle, golden-haired\nyoung man she meets and loves in secret. For he is the son of her\nfather's sworn enemy, and loving him may cost her more than she\ncould ever imagine...\n\n\nThe Dragon Lord's Daughters\nby Bertrice Small\nLanguage: EN\nPages: EPUB 707","torrent":{"xt":"urn:btih:6e6ed02f523910e97804c59dde2338375d97c6c5","amp;dn":"The+Dragon+Lord%27s+Daughters++by+Bertrice+Small+EPUB+EN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e6ed02f523910e97804c59dde2338375d97c6c5","infoHashBuffer":{"type":"Buffer","data":[110,110,208,47,82,57,16,233,120,4,197,157,222,35,56,55,93,151,198,197]},"announce":[],"urlList":[]}}