{"title":"Dmitry Orlov: Social Collapse Best Practices","uid":4753985,"size":246085589,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6ec04b194cf9479c1945910301a4f1ff77126160&amp;dn=Dmitry+Orlov%3A+Social+Collapse+Best+Practices&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1236354048,"description":"With vintage Russian black humor, Dmitry Orlov describes the social collapse he witnessed in Russia in the 1990s and spells out its practical lessons for the American social collapse he sees as inevitable.\n\nThe American economy in the 1990s described itself as &quot;Goldilocks&quot; - just the right size - when in fact is was &quot;Tinkerbelle,&quot; and one day the clapping stops.\n\nAs in Russia, the US made itself vulnerable to the decline of crude oil, a trade deficit, military over-reach, and financial over-reach.\n\n\nStewart Brand - Stewart Brand is a co-founder and managing director of Global Business Network, founded and runs the GBN Book Club, and is the president of The Long Now Foundation. Brand is well known for founding, editing and publishing the Whole Earth Catalog (01968-85), which received a National Book Award for the 01972 issue. In 01984, he founded The WELL (Whole Earth 'Lectronic Link), a computer teleconference system for the San Francisco Bay Area. It now has 11,000 active users worldwide and is considered a bellwether of the genre. Brand has been a member of the Board of Trustees of the Santa Fe Institute, an interdisciplinary center studying the sciences of complexity, since 01989. He received the Golden Gadfly Lifetime Achievement Award from the Media Alliance, San Francisco in the same year. He was a founding member of the Board of Directors of the Electronic Frontier Foundation, an organization which supports civil rights and responsibilities in electronic media, and is an acting adviser to Ecotrust, Portland-based preservers of temperate rain forest from Alaska to San Francisco. Brand is the author of many pioneering books including The Clock Of The Long Now in 01999, How Buildings Learn: What Happens After They're Built in 01994, The Media Lab: Inventing the Future at MIT in 01987, and Two Cybernetic Frontiers on Gregory Bateson and cutting-edge computer science in 01974. It had the first use of the term &quot;personal computer&quot; in print and was the first book to report on computer hackers.\nDmitry Orlov - Dmitry Orlov is an engineer and a writer on subjects related to Peak Oil. He was born in Leningrad and moved to the United States at the age of 12. Orlov was an eyewitness to the collapse of the Soviet Union over several extended visits to his Russian homeland between the late 1980s and mid-1990s. He has a BS in Computer Engineering and an MA in Applied Linguistics. His latest book is Reinventing Collapse (June 2008). His article Closing the Collapse Gap compares the collapse-preparedness of the USA and the USSR.\n\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it...\n &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog...\n &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:6ec04b194cf9479c1945910301a4f1ff77126160","amp;dn":"Dmitry+Orlov%3A+Social+Collapse+Best+Practices","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ec04b194cf9479c1945910301a4f1ff77126160","infoHashBuffer":{"type":"Buffer","data":[110,192,75,25,76,249,71,156,25,69,145,3,1,164,241,255,119,18,97,96]},"announce":[],"urlList":[]}}