{"title":"DonaldFagen-Sunken Condos(2012) 24-88.2-FLAC","uid":10927168,"size":948762015,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6ec2608fae773a8ad8ab3d64415f4e50508d6b0b&amp;dn=DonaldFagen-Sunken+Condos%282012%29+24-88.2-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hal4000","files":-1,"time":1409370905,"description":"Donald Jay Fagen (born January 10, 1948) is an American musician and songwriter, best known as the co-founder (along with partner Walter Becker) and lead singer of the rock band Steely Dan.\n\nFollowing the initial breakup of Steely Dan in 1981, he launched a long-running, if sporadic, solo career in 1982, spawning four albums to date. The fourth album, Sunken Condos, was released on October 16, 2012.\n\nMorph the Cat wrapped up an alleged trilogy in 2006, a trilogy that only became apparent when Donald Fagen's three solo albums were boxed in a set called The Nightfly Trilogy in 2007, and Fagen then busied himself with live performances, something he avoided at the peak of his popularity in the '70s and '80s. With Walter Becker, he took several classic Steely Dan albums on tour, he became a frequent fixture at Levon Helm's Midnight Rambles, and, in 2010, he became the ringleader of the Dukes of September, a superstar blue-eyed soul revue featuring Michael McDonald and Boz Scaggs. All this high-octane rhythm can be heard on Sunken Condos, Fagen's 2012 album and easily the liveliest solo album he's released since The Nightfly in 1982. Much of that is due to a pronounced emphasis on rhythm. Sunken Condos doesn't ease on its groove, the way the otherwise excellent Morph the Cat did. Sunken Condos crackles with energy even when things are smooth; witness how &quot;Memorabilia&quot; and &quot;Weather in My Head,&quot; jazzy funk numbers both, never succumb to lite comfortable grooves, as Fagen and his peerless band keep pushing at the contours of their rhythms, letting the music breathe. And that addition of space is a marked difference from much of Fagen's work since Gaucho, when he began to place an emphasis on precision over feel. Certainly, Sunken Condos boasts an immaculate production and there is not a note out of place but it is unmistakably a feel album, one where it's a pleasure to hear the band play and to hear Fagen play with his delivery, sculpting his phrases with an impish glee. That Sunken Condos also contains his sharpest songwriting in a long time -- whether they percolate like &quot;I'm Not the Same Without You&quot; or sweetly sigh like &quot;Miss Marlene,&quot; the tunes are immediate the way the songs on Steely Dan's 2000 comeback, Two Against Nature, were -- is no coincidence. Long a master of obfuscation, Fagen plays it straight on Sunken Condos, tightening his songwriting and letting his music swing, and the results are an absolute joy.\n\nOfficial high resolution digital download PCM 24 bit 88.2 Khz. FLAC.","torrent":{"xt":"urn:btih:6ec2608fae773a8ad8ab3d64415f4e50508d6b0b","amp;dn":"DonaldFagen-Sunken+Condos%282012%29+24-88.2-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ec2608fae773a8ad8ab3d64415f4e50508d6b0b","infoHashBuffer":{"type":"Buffer","data":[110,194,96,143,174,119,58,138,216,171,61,100,65,95,78,80,80,141,107,11]},"announce":[],"urlList":[]}}