{"title":"Simon R Green - DeathStalker Collection 100%","uid":4744004,"size":4053476846,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7046cb0d096dce49821c841632b893c984c715f2&amp;dn=Simon+R+Green+-+DeathStalker+Collection+100%25&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"thebadman77","files":234,"time":1235718419,"description":"\nFirst Deathstalker series\n\nThe Empire that spanned lightyears, is now rotten to the core and its half-mad empress rules with a fist of iron.\nThe main thrust of the stories of the Empire concern Owen Deathstalker and his attempt to rebel against the Empire. \n \nSecond Deathstalker series\n\nOwen's descendant Lewis is dragged unwillingly into emulating his ancestor's desperate heroism. Lewis just wants to be a good Paragon \n(a kind of high-tech supercop/knight) and faithfully serve his best friend, King Douglas. Unfortunately, Lewis and the king's intended bride fall \nhopelessly in love. Even more unfortunately, as if there weren't enough monstrously subversive groups plotting against the throne from outside \nthe court, Lewis's jealous rival, Finn, who has a perfect Paragon's surface but a brilliant sociopath's soul, succeeds in discrediting Lewis and \nthrowing the government into disarray. And then the planet-scouring Terror erupts from another dimension. \n\n\n\nDeathstalker\n\nThe Iron Bitch - her Imperial Majesty Lionstone XIV - ruled the human Empire with fear. From peasants to masters of the galaxy's most powerful \nfamilies, all were subject to the queen's unpredictable decrees of &quot;outlawing&quot; and death. Owen Deathstalker, unwilling head of his clan, sought to \navoid the perils of the Empire's warring factions but unexpectedly found a price on his head.  He fled to Mistworld, where he began to build an unlikely \nforce to topple the throne - a broken hero, an outlawed Hadenman, a thief, and a bounty hunter. With their help, The Deathstalker took the first step on \na far more dangerous journey to claim the role for which he'd been destined since before his birth...\n\n\n\nDeathstalker Rebellion\n \nAt the heart of the galaxy-spanning tyrannical Empire lies Golgotha, the planet of the Iron Throne. Once it was impregnable. Now... the Iron Bitch may have made a \nfatal mistake. In outlawing Owen Deathstalker, she has woken a lust for revenge in a quiet man - and unwittingly created a focus for a galaxy full of hatred for her \nloathsome rule. At last the espers and the clones, the AIs and the freaks, the innocent and the damned alike, have someone to look to, someone to lead the Deathstalker Rebellion. And then, the killing begins...\n\n\n\nDeathstalker War\n \nGalaxy in flames. Fate had made Owen Deathstalker a rebel hero in an empire choked by tyranny. Embracing his warrior lineage for the sake of freedom, he stoked the \nflames of revolution, gathering the forces that one day must strike against Imperial authority. That day has come. With his valiant compatriots Hazel d'Ark and \nJack Random, Owen must now bring the uprising to a fiery conclusion. From the rebel strongholds of Mistworld and Virimonde to the Empire's mighty heart on the \nplanet of Golgotha, the fate of humanity now depends on a clash of arms across light-years of space. But Deathstalker's desperate cause will need more than an \narmy of courageous fighters to succeed - for the cunning Empress has some evil surprises to unleash...\n\n\n\nDeathstalker Honor\n \nThey were, after all, official heroes of the great Rebellion: Owen Deathstalker, outlawed aristocrat and reluctant warrior. Hazel d'Ark, ex-clonelegger and ex-pirate. \nJack Random, legendary professional rebel. Ruby Journey, infamous bounty hunter. Together they fought impossible odds in the name of freedom and justice. \nThey gathered an army of the bold and the valiant, the downtrodden and the desperate, and led them to victory. And in the great steel and brass Palace on Golgotha \nthey threw down the Empress Lionstone XIV, the Iron Bitch, and destroyed the Iron Throne of Empire for ever. They should have lived happily ever after.\nUnfortunately, life isn't like that.\n\n\nDeathstalker Destiny\n \nHazel d'Ark, ex-clonelegger and ex-pirate, is an official hero of the great rebellion - but she's also been kidnapped. Now it's up to the legendary Owen Deathstalker to \nventure into the Obeah Systems to find and rescue his companion-in-arms. But there's far more behind the kidnapping than the usual demands for huge amounts of \nmoney, for the Blood Runners, Hazel's evil captors, have stolen a part of the Madness Maze and they have devastating plans for its use. Once more, Owen is called \nupon to fulfill his destiny. And even when all the loose ends are being tied up, as everyone is bidding fair to live happily ever after, the Recreated turn up to \nthreaten the existence of humanity... And this time Owen's actions will decide the fate of the entire Empire. This is his destiny. Deathstalker destiny. And all humanity \nwaits upon him.\n \n \n***Possible spoilers. Read further on your own risk...***\n\n\n\nDeathstalker Legacy\n \nIt has been two hundred years since Owen Deathstalker fell, dying to save the Empire and all Humanity. Now it is a Golden Age for all: for men, for aliens and for the \nAIs of Shub. But one evil man has determined to bring it all crashing down, and now the Terror has finally arrived, threatening them all with extinction. The old heroes \nhave become legends, and the cry goes out for new heroes. It's time for the latest Deathstalker, Lewis, to do his bit. Unfortunately, he and his companions, a diva, a \nconman, a homicidal psychopath and a reptiloid called Saturday, have all been outlawed and declared traitors. Deathstalker luck. Always bad. Unless Lewis Deathstalker \ncan defy the odds to get the Madness Maze and tread the same dangerous path to glory that his ancestor did, the Golden Age is about to be wiped out for ever. \nTogether with Humanity...\n\n\n\nDeathstalker Return\n \nLewis Deathstalker is on the run, with an evil Empire snapping at his heels. He and his companions, the diva Jesamine Flowers, the conman Brett Random, the \nPsychopath Rose Constantine and a reptiloid called Saturday, travel from world to world, searching for help and answers to the mysteries of the past. On the \nplanet Unseeli, they talk with what remains of the traitor Carrion, and the ghost of a man called Silence. On Lachrymae Christi, an old legend called Tobias \nMoon tells them the truth behind the legends. On Shandrakor, they explore the ruins of the old Deathstalker Standing, and fight with more than one kind of \nmonster. And on Haden, finally, they come to the Madness Maze, and the culmination of Lewis's epic quest: the return of Owen Deathstalker.\n\n\nDeathstalker Coda\n \nDeathstalker Coda: the final volume of the great Deathstalker Saga. Two Deathstalkers must fight for the survival of Humanity: Lewis Deathstalker, in the present, \nand Owen Deathstalker in the past. While Lewis Deathstalker and his companions lead rebel forces against the evil usurper, Emperor Finn, the exiled King Douglas \nraises an army from the downcast and oppressed peoples of the Rookery. And Owen Deathstalker has his own mission: to seek out the dread secret that has turned \nhis lost love Hazel d'Ark into the terrifying Terror. To do that, he must travel back in Time, further and further, visiting the Empire at different levels of its development, \nsearching for the truth behind Hazel's transformation, before the Terror really does destroy everything.\n\n\nGeneral Information\n===================\n Title:               DeathStalker Collection\n Author:              Simon Green\n Genre:               Scifi\n Series Name:         Deathstalker Return\n\nFile Information\n\n Parity Archive:      No\n Ripped By:           Nobby .  All bow down to the master for his work! I love you Nobby!\n Ripped With:         easy cd-da extractor pro\n Encoded At:          CBR 32 kbit/s 44100 Hz Mono\n ID3 Tags:            Set, v1.1, v2.3\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Simon_R._Green&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Simon_R._Green&lt;/a&gt; &lt;a href=&quot;\nhttp://www.bluemoonrising.nl/deathstalker.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bluemoonrising.nl/deathstalker.htm&lt;/a&gt; &lt;a href=&quot;\nhttp://www.graphicaudio.net/c-8-deathstalker.aspx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.graphicaudio.net/c-8-deathstalker.aspx&lt;/a&gt;\n\nThis is the full set 100% complete.\n                                                                                                     \n","torrent":{"xt":"urn:btih:7046cb0d096dce49821c841632b893c984c715f2","amp;dn":"Simon+R+Green+-+DeathStalker+Collection+100%25","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7046cb0d096dce49821c841632b893c984c715f2","infoHashBuffer":{"type":"Buffer","data":[112,70,203,13,9,109,206,73,130,28,132,22,50,184,147,201,132,199,21,242]},"announce":[],"urlList":[]}}