{"title":"The People of the Eye_ Deaf Ethnicity - Pillard,Lane,Hedberg [No","uid":8684354,"size":7230363,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:705b78854d1ac0e5af3d7d173f4cea9d90f03266&amp;dn=The+People+of+the+Eye_+Deaf+Ethnicity+-+Pillard%2CLane%2CHedberg+%5BNo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":5,"time":1373762465,"description":"What are ethnic groups? Are Deaf people who sign American Sign Language (ASL) an ethnic group? In The People of the Eye, Deaf studies, history, cultural anthropology, genetics, sociology, and disability studies are brought to bear as the authors compare the values, customs, and social organization of the Deaf World to those in ethnic groups. Arguing against the common representation of ASL signers as a disability group, the authors discuss the many challenges to Deaf ethnicity in this first book-length examination of these issues.\nStepping deeper into the debate around ethnicity status, The People of the Eye also describes, in a compelling narrative, the story of the founding families of the Deaf World in the US. Tracing ancestry back hundreds of years, the authors reveal that Deaf people's preference to marry other Deaf people led to the creation of Deaf clans, and thus to shared ancestry and the discovery that most ASL signers are born into the Deaf World, and many are kin.\nIn a major contribution to the historical record of Deaf people in the US, The People of the Eye portrays how Deaf people- and hearing people, too- lived in early America. For those curious about their own ancestry in relation to the Deaf World, the figures and an associated website present pedigrees for over two hundred lineages that extend as many as three hundred years and are unique in genealogy research. The book contains an every-name index to the pedigrees, providing a rich resource for anyone who is interested in Deaf culture. ","torrent":{"xt":"urn:btih:705b78854d1ac0e5af3d7d173f4cea9d90f03266","amp;dn":"The+People+of+the+Eye_+Deaf+Ethnicity+-+Pillard%2CLane%2CHedberg+%5BNo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"705b78854d1ac0e5af3d7d173f4cea9d90f03266","infoHashBuffer":{"type":"Buffer","data":[112,91,120,133,77,26,192,229,175,61,125,23,63,76,234,157,144,240,50,102]},"announce":[],"urlList":[]}}