{"title":"Crash Vegas - Red Earth (1990) [320 kbps]","uid":4137281,"size":102286183,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:70e8e509798dfb0d1925e678dbbdfdc7a6401b54&amp;dn=Crash+Vegas+-+Red+Earth+%281990%29+%5B320+kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sjbnj","files":11,"time":1208319307,"description":"MP3@320 kbps\n\nCrash Vegas was a noted Canadian folk rock band which formed in 1988,[1] and achieved moderate success in the early 1990s.\n\nThe band was formed by Michelle McAdorey and Colin Cripps, initially as a vehicle for songs McAdorey had written with Greg Keelor of the band Blue Rodeo. The band also included Jocelyne Lanois and Ambrose Pottie.\nThey released their debut album, Red Earth, on Risque Disque in 1990. They had several notable hits on Canadian radio (&quot;Inside Out&quot;, &quot;Sky&quot; and &quot;Smoke&quot;), and seemed poised for success. However, Risque Disque soon went bankrupt, leaving the band in limbo. In 1992, they signed a new deal with London/Polygram.\nLanois left the band, and was replaced by Darren Watson for the band&amp;#039;s second album. That album, Stone, also included contributions from John Porter and Butch Vig. However, Crash Vegas had a rocky relationship with Polygram, and they subsequently moved to Sony Records after contributing a cover of &quot;Pocahontas&quot; to that label&amp;#039;s Neil Young tribute album Borrowed Tunes.\nIn 1993, the band participated in the Another Roadside Attraction tour, and collaborated with The Tragically Hip, Midnight Oil, Hothouse Flowers and Daniel Lanois on the one-off single &quot;Land&quot; to protest forest clearcutting in British Columbia.\nIn 1995, the band, now down to the core duo of Cripps and McAdorey, released their third album, Aurora. They were supported by John Borra and Mike Sloski on the album, and by Gavin Brown and Eric Chenaux on tour. The single &quot;On and On (Lodestar)&quot; garnered significant radio airplay in Canada, but the album sold poorly after its initial push.\nIn 1996, Crash Vegas disbanded. McAdorey pursued a solo career, and Cripps went on to join Junkhouse, which received their first widespread exposure when they opened for Crash Vegas during the Red Earth tour.\n\nTrack Listing:\nRed Earth\nDown to the wire\nSky\nsmoke\nI Gave You My Heart\nThe One That kKeeps Me Running\nMoving too fast\nInside Out\nJulia rain\nIt&amp;#039;s Not Funny Anymore\nBury Her","torrent":{"xt":"urn:btih:70e8e509798dfb0d1925e678dbbdfdc7a6401b54","amp;dn":"Crash+Vegas+-+Red+Earth+%281990%29+%5B320+kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70e8e509798dfb0d1925e678dbbdfdc7a6401b54","infoHashBuffer":{"type":"Buffer","data":[112,232,229,9,121,141,251,13,25,37,230,120,219,189,253,199,166,64,27,84]},"announce":[],"urlList":[]}}