{"title":"Satanatras - Eight-Ate-Hate","uid":8384829,"size":90264106,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:71435b0d347fef1af1866c3541d737f054694795&amp;dn=Satanatras+-+Eight-Ate-Hate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"elgatoloco63","files":12,"time":1366261276,"description":"The Satanatras were a punk band from Toronto, Ontario.  Front man, Jeff Beardall, was originally from New Brunswick.  He started a band called, Guilt Parade, in 1985 and released a few albums.  The band relocated to Toronto and signed with Fringe Records.  They toured Canada as well as the U.S. before breaking up during the early 90's.  Beardall would then hook up with Dallas Good of The Sadies and form, The Satanatras.  The band didn't have a long run and Dallas Good left the band before their full length album, Eight Ate Hate, was released in 1994 with Raw Energy Records.  I believe there was another indie EP entitled, 777, which preceded this release in 1992.  They were a popular act within the city at that time and were part of a vibrant scene that included bands like hHead (&quot;Collide&quot;), Groovy Religion (&quot;Suki&quot;) as well as Change Of Heart (see blog 6/30/11).  This is a really rare disc and it has some great tunes on it especially the album opener, Out Of The Blue.  The other two members of the band for this release in 1994, were Ruston Baldwin and Christian Wagner.  Ruston would go on to play drums for a number of punk bands like Dogs With Jobs.\n\n","torrent":{"xt":"urn:btih:71435b0d347fef1af1866c3541d737f054694795","amp;dn":"Satanatras+-+Eight-Ate-Hate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71435b0d347fef1af1866c3541d737f054694795","infoHashBuffer":{"type":"Buffer","data":[113,67,91,13,52,127,239,26,241,134,108,53,65,215,55,240,84,105,71,149]},"announce":[],"urlList":[]}}