{"title":"Supernatural S01E11, 12, 13, 14, 15 &amp; 16 DVDrip DutchReleaseTeam","uid":6357314,"size":1901519188,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:73987c6832276dd6c0c070b770f092fa81fe2d10&amp;dn=Supernatural+S01E11%2C+12%2C+13%2C+14%2C+15+%26+16+DVDrip+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MtotheAtiash","files":-1,"time":1304186566,"description":"USA\nGenre: Fantasy \nTaal: Engels\nOndertitels: vaste Nederlandse ondertiteling &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0460681/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0460681/&lt;/a&gt;\nAflevering nummer 11 - 16\n\nScarecrow\nSam and Dean have a falling out when their father contacts them and sends them to them to a small town where the citizens sacrifice couples to a pagan god which manifests through a scarecrow. But while Dean strikes off on his own, to help one girl, Sam meets a shady young drifter, named Meg, at a bus depot while on his way out of town, whom is not what she appears to me.\n\nFaith\nWhen Dean is accidentally electrocuted fighting a monster, he permanently damages his heart. When he's diagnosed as only having a month, at most, to live, Sam searches for a means to save him and finds Roy Le Grange, a faith healer who may actually be the real deal. After Le Grange heals Dean, the brothers discover that Le Grange is using black magic to bind a &quot;Reaper&quot; to do his bidding... and each healing comes with a terrible price of someone else's life.\n\nRoute 666\nDean gets contacted by his first love, an African American woman, about racist murders that occur on a desert route, caused by a truck that seems driver-less\n\nNightmare\nSam has a premonition in which a man is killed, but the murder is made to look like a suicide. Sam convinces Dean that they must investigate the case, but the two are puzzled when they fail to find anything that indicates that the death was supernatural in nature. That is, until they find out that Max, the reclusive son of the first victim, has been using his recently acquired power of telekinesis to kill the family members that once abused him. Sam also discovers Max's mother was killed by the same fiery demon that took his own mom.\n\nThe Benders\nAfter hearing in 'smallville' Hibbing, while masquerading as Minnesota state police, a boy's story about a monster probably was inspired by a Godzilla movie, Sam points out the county was marked by dad as suspicious and has the state's highest ratio of disappearances, but Dean just wants to relax, at least till the morning, until Sam disappears on the parking lot. Dean teams up with local police woman Kathleen, who even after finding out they impersonated cops decides not to arrest him before Sam is found, because her own brother also disappeared years earlier. Their search reaches the large, lonely house where a sinister human family keeps Sam and others in cages, and their intentions at least are monstrous...\n\nShadow\nDean and Sam are investigating a mysterious murder in Chicago and discover that Meg is responsible for it. However, when they try to catch her, Meg unleashes shadow spirits on them and they realize that she is really setting a trap for their father.\n\nhardcoded dutch subs\n\ndeze review wordt u aangeboden door het DutchReleaseTeam\nVoor de reviews van de nieuwste films, muziek, series, games etc ga dan eens naar &lt;a href=&quot;\nhttp://www.hetmultimediacafe.be&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hetmultimediacafe.be&lt;/a&gt;","torrent":{"xt":"urn:btih:73987c6832276dd6c0c070b770f092fa81fe2d10","amp;dn":"Supernatural+S01E11%2C+12%2C+13%2C+14%2C+15+%26+16+DVDrip+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73987c6832276dd6c0c070b770f092fa81fe2d10","infoHashBuffer":{"type":"Buffer","data":[115,152,124,104,50,39,109,214,192,192,112,183,112,240,146,250,129,254,45,16]},"announce":[],"urlList":[]}}