{"title":"Abhaya and The Steam Injuns - Nepali","uid":7445058,"size":62526259,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:744246562a8fa18e76134f8df0bfc4d4d4fedd86&amp;dn=Abhaya+and+The+Steam+Injuns+-+Nepali&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ampmskm","files":16,"time":1342343705,"description":"Abhaya and the Steam Injuns Representing Nepal Since 2003.\n\nBiography\n\nABHAYA AND THE STEAM INJUNS\nThe band began its musical quest on January 2nd, 2003 playing live gigs in hotels and lounge bars. It was essentially an acoustic blues band before it kicked off as a rock outfit. Lead singer Abhaya Subba is the founder member and manager of the band, while Rinchen Palzar who now plays the lead guitar joined the band in early 2004. Shailendra Singh on the keys was discovered by Abhaya while she was judging a reality show, The Sprite band challenge and he joined the band in 2008. Tsewang NT Hyolmo on the bass joined the band mid 2009 and so did NabinT Magar as the drummer. \nAbhaya had always been featured in well known bands such as Parikrama, Red Skywalkers and Punchtatva but she was getting frustrated with the way most other bands underestimated her song writing skills. What she had been seeking for was a band that would let her express herself fully and have a similar vision. She formed the band in 2003 with younger musicians than her who seemed to be more accepting of her need to write songs and articulate her full potential as a musician.\n\nTheir first self titled album, released in February 2005, surprised Nepal as they had never seen such a bold female singer ever. It went on to becoming a runaway success and the band managed to carve a niche amongst the youth of Nepal. \n\nWith their groundbreaking second album, Nayan, hitting the Nepali charts in 2008 their songs managed to embrace a larger listenership that established the band as one of the best that Nepal has ever seen or heard. \n\nThey have been nominated for several major music awards in Nepal and were awarded the honor of being the Number 1 band of Nepal by Radio Kantipur in 2009.\n\nThey have performed extensively all over Nepal and are planning a US tour in the near future. They have been invited to major concerts in Hong Kong, Australia and India. \nTheir best is yet to come. They are now in the process of recording their third album and are raring to push the benchmark and to make music a thinking, entertaining and steamy affair.\n\nBand Interests\nTo tour the world and the seven seas!","torrent":{"xt":"urn:btih:744246562a8fa18e76134f8df0bfc4d4d4fedd86","amp;dn":"Abhaya+and+The+Steam+Injuns+-+Nepali","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"744246562a8fa18e76134f8df0bfc4d4d4fedd86","infoHashBuffer":{"type":"Buffer","data":[116,66,70,86,42,143,161,142,118,19,79,141,240,191,196,212,212,254,221,134]},"announce":[],"urlList":[]}}