{"title":"The.Natural.1984.directors.cut.Dvdrip.Xvid","uid":4692031,"size":1469202479,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:745516472828d5a360cfe3381521a74b31945dc0&amp;dn=The.Natural.1984.directors.cut.Dvdrip.Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mach1speeds","files":2,"time":1233427351,"description":"Director Barry Levinson treats The Natural as a kind of shrine to America's national pastime, baseball, complete with all the possible mythic resonance that can be gleaned from the subject. Fans of the Bernard Malamud novel may be dismayed, but anyone who fell for the similarly mythic Field of Dreams will be hooked. Levinson displays an unabashed devotion to the game, although the film could use more of the realities of chewing tobacco and pine tar. The story opens as a young man (Robert Redford, in soft lighting) emerges from the sun-dappled heartland as maybe the best baseball player anybody's ever seen. On his way to the majors, he is waylaid by an enigmatic black widow (Barbara Hershey) and vanishes for many years. When he re-emerges, a silent mystery, he lands a spot with a New York team and begins tearing up the league--he's still the natural. Redford is fine, and Kim Basinger and Oscar-nominated Glenn Close are effective as the women in his life. The crowning touch is the soaring, extraordinary music by Randy Newman, the singer-songwriter turned orchestral composer.","torrent":{"xt":"urn:btih:745516472828d5a360cfe3381521a74b31945dc0","amp;dn":"The.Natural.1984.directors.cut.Dvdrip.Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"745516472828d5a360cfe3381521a74b31945dc0","infoHashBuffer":{"type":"Buffer","data":[116,85,22,71,40,40,213,163,96,207,227,56,21,33,167,75,49,148,93,192]},"announce":[],"urlList":[]}}