{"title":"Dating.In.The.Dark.S01E06.PDTV.XviD-2HD.avi","uid":5534526,"size":367189348,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:747a7c11afea2e12e818f1d31618472f8526cdaf&amp;dn=Dating.In.The.Dark.S01E06.PDTV.XviD-2HD.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"err0001","files":1,"time":1273025444,"description":"Dating in the Dark S01E06\n\nThe contestants in this episode are Matt, Jose, Jeff, Deanne, Renee and Gina. In this final episode of season 1, the contestants are assisted by an ex-profiler for the FBI. The contestants also get a chance to learn about their date by seeing the clothes their dates slept in the night before.\n\nAccording to Wikipedia, this show has been renewed by ABC for a second season of six episodes, scheduled to air in the summer of 2010.\n\nThe resolution is 512x384. \n\n\nSeries Info: This reality show asks the question - Is Love Blind? Three men and three women are sequestered in separate wings of the house, unable to have any conversation or contact with the opposite sex unless in a completely dark room. They can't see each other but we can see them since they are being filmed with special cameras.\n\nInitially, all six contestants have a group date in which they all sit at a table in the dark room exchanging names and getting to know one another's voices and personality types. After this date, each person can go on one-on-one dates with person(s) they want to know more about. One-on-one dates are also held in the dark room. They do this by &quot;messaging&quot; the other person via a computer.\n\nThroughout the show, the host provides both the men and women additional insight into the other contestants by providing personality profiles showing which contestants are a &quot;best match&quot;, and also allowing them to view items the others have brought to the house. \n\nTowards the end of the show, each person can pick one other that they would like to see in the light. This is done in the dark room with the two contestants standing at opposite ends; one contestant is shown to the other for the first time and vice versa. During this process the couple must remain silent.\n\nThe end of the show culminates with each person opting to meet someone on the balcony of the house. Cameras are set up to show both the door to the balcony and the front door. One person goes to the balcony first and then must wait to see if the person they invited joins them on the balcony or walks out the front door. Joining the other on the balcony signifies that they want to pursue a relationship / go on future dates while walking out the front door signifies that they do not want to pursue anything further.\n","torrent":{"xt":"urn:btih:747a7c11afea2e12e818f1d31618472f8526cdaf","amp;dn":"Dating.In.The.Dark.S01E06.PDTV.XviD-2HD.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"747a7c11afea2e12e818f1d31618472f8526cdaf","infoHashBuffer":{"type":"Buffer","data":[116,122,124,17,175,234,46,18,232,24,241,211,22,24,71,47,133,38,205,175]},"announce":[],"urlList":[]}}