{"title":"Don Nardo - The Black Death World History [2011][A]","uid":9940030,"size":9133215,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:74e0c587493dfb5547231f693af31c33f721f86f&amp;dn=Don+Nardo+-+The+Black+Death+World+History+%5B2011%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1397225577,"description":"Description\nProduct Details\nBook Title: Black Death, The (World History (Lucent))\t\nBook Author: Don Nardo (Author)\nSeries: World History (Lucent)\nLibrary Binding: 128 pages\nPublisher: Lucent Books; 1 edition (February 10, 2011)\nLanguage: English\nISBN-10: 1420503480\nISBN-13: 978-1420503487\n\nBook description\nBracketed by explorations of previous and modern plagues, six essays describe the 14th-century ravages from such perspectives as epidemiology, the death toll, the medical response, social controls, the flagellants, and the ever popular blaming the Jews. Another three look at the ongoing impact on economics and the population, education, agriculture, architecture, and the church. Annotation c. Book News, Inc., Portland, OR (booknews.com)\n\nEditorial Reviews\nFrom School Library Journal\nGrade 10 Up-An excellent, inclusive volume for reports. The two major sections, &quot;The Black Death Ravages Europe&quot; and &quot;The Economic and Cultural Impact of the Black Death,&quot; illustrate the focus of the text. Students are given a clear explanation of the disease and how it may have spread and some coverage of its social, economic, and cultural repercussions. The essays each speak to a specific issue. An appendix that includes 16 primary documents, a concise chronology, lists for further reading divided by content, and an index complete this valuable research tool.\nJoanne K. Cecere, Highland High School, NY\nCopyright 1999 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.\n\nMore About the Author - Don Nardo\nBiography\nDon Nardo is a historian and award-winning writer who specializes in the ancient world, especially the civilizations of Greece and Rome. He began as a actor and worked with the National Shakespeare Company before turning to writing screenplays and teleplays and, soon afterward, devoting much of his time to historical research and writing. In the past two decades, he has published nearly two hundred volumes on diverse historical topics. And having earned numerous favorable reviews, he is widely recognized as the country's leading writer of historical works for young adults. He is also versed in various other subjects and as a result is frequently asked by publishers to write books on a number of scientific and literary topics.\nMr. Nardo also composes and arranges orchestral music, having started composing in his early teens. Over the years he has turned out more than eighty musical works, including 2 symphonies, 4 string quartets, several concertos, a film score, incidental music for stage productions, and several commissions, the most recent a double concerto for violin and Portuguese guitar written for two noted musicians. He is also the resident composer and arranger for the Amadis Orchestra, based in Connecticut.\n","torrent":{"xt":"urn:btih:74e0c587493dfb5547231f693af31c33f721f86f","amp;dn":"Don+Nardo+-+The+Black+Death+World+History+%5B2011%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74e0c587493dfb5547231f693af31c33f721f86f","infoHashBuffer":{"type":"Buffer","data":[116,224,197,135,73,61,251,85,71,35,31,105,58,243,28,51,247,33,248,111]},"announce":[],"urlList":[]}}