{"title":"The Golden Book of Chemistry Experiments","uid":5832507,"size":29258784,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:752f433d6154f8b28259556199c6b5c71892976b&amp;dn=The+Golden+Book+of+Chemistry+Experiments&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1284575079,"description":"# Publisher: Golden Press (1962)\n# ASIN: B001CFZRR8\n\n\nReview from Amazon:\n\nMy mom bought this book for me in Woolworth's dime store in Maple Heights, Ohio. I was about 11 yrs. old &amp; I think the price was $1.95. This book is TERRIFIC--I wore this book out doing dozens of experiments from it, many repeatedly, and dreaming over it at other times. The tone of the book is very INSPIRATIONAL and contains good historical information. The drawings are wonderfully rendered and magnetic. The book antedates the era of overprotectiveness of children. There is some risk to some of the experiments but nothing super dangerous or explosive--the risk areas are carefully marked, some with red print. My parents did not supervise my use of the book. Many of the experients are done with household items. Eventually, I had my own chem lab in the basement, built from ideas here. My parents, who were a plumber and a housewife, fostered the kind of exploration that this book fostered. I met my future wife at age 15 in the Future Scientist's Club in the basement of the Cleveland Natural History Museum and she became a molecular biologist; our daughter is a professional science writer. My favorite experiments were the making of elemental iodine from its salts thru sublimation but a close second was the electrolysis of water into hydrogen and oxygen--this one you can easily and safely do on your kitchen table. In those days, real chemistry sets were available and hobby stores sold not only electric trains and plastic models but real lab glassware that I would save up my allowance to buy. I'm now 58 and a board certified general and vascular surgeon. Much of my interest in science is traceable to this book, which is nothing short of superb. The last chapter is more advanced and teaches the balancing of chemical equations--when I was a junior in HS, I used this chapter to help teach my mom chemistry, who at that time was a freshman in nursing school. I was placed in advanced HS and college chemistry classes from the get-go. I think we need to go back in our USA educational philosophy to the place where this book was written from. I LOVED (&amp; LOVE) this book, still have my worn original copy. This book is suitable for the focused sort of child through interested adult. It should be used by chemistry teachers, too, because it is really a collection of class demonstrations, if you want it for that. Interested parents could also use this book to do sciece demos for younger children. \n &lt;a href=&quot;\nhttp://www.amazon.com/GOLDEN-BOOK-CHEMISTRY-EXPERIMENTS-Laboratory-Over/dp/B001CFZRR8/ref=sr_1_3?ie=UTF8&amp;s=books&amp;qid=1284567634&amp;sr=8-3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/GOLDEN-BOOK-CHEMISTRY-EXPERIMENTS-Laboratory-Over/dp/B001CFZRR8/ref=sr_1_3?ie=UTF8&amp;s=books&amp;qid=1284567634&amp;sr=8-3&lt;/a&gt;","torrent":{"xt":"urn:btih:752f433d6154f8b28259556199c6b5c71892976b","amp;dn":"The+Golden+Book+of+Chemistry+Experiments","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"752f433d6154f8b28259556199c6b5c71892976b","infoHashBuffer":{"type":"Buffer","data":[117,47,67,61,97,84,248,178,130,89,85,97,153,198,181,199,24,146,151,107]},"announce":[],"urlList":[]}}