{"title":"Stephen King-The Body","uid":8696129,"size":123784516,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:758f7e9bf860a6daf89e0b486ab4ccae4d38ecaa&amp;dn=Stephen+King-The+Body&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twocows","files":39,"time":1373936176,"description":"The most important things are the hardest things to say. They are the things you get ashamed of, because words diminish them--words shrink things that seemed limitless when they were In your head to no more than living size when they're brought out. But it's more than that, isn't it? The most important things lie too close to wherever your secret heart is buried, like landmarks to a treasure your enemies would love to steal away. And you may make revelations that cost you dearly only to have people look at you in a funny way, not understanding what you've said at all, or why you thought it was so important that you almost cried while you were saying it. That's the worst, I think. When the secret stays locked within not for want of a teller but for want of an understanding ear.\nI was twelve going on thirteen when I first saw a dead human being. It happened in 1960, a long time ago... although sometimes it doesn't seem that long to me. Especially on the nights I wake up from those dreams where the hail fell into his open eyes.","torrent":{"xt":"urn:btih:758f7e9bf860a6daf89e0b486ab4ccae4d38ecaa","amp;dn":"Stephen+King-The+Body","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"758f7e9bf860a6daf89e0b486ab4ccae4d38ecaa","infoHashBuffer":{"type":"Buffer","data":[117,143,126,155,248,96,166,218,248,158,11,72,106,180,204,174,77,56,236,170]},"announce":[],"urlList":[]}}