{"title":"Ultimate Hacker Movie Collection #2","uid":4411963,"size":2962605390,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:759dac20609222872b34f24185835fa0af13a5d9&amp;dn=Ultimate+Hacker+Movie+Collection+%232&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Adequate","files":6,"time":1222298682,"description":"A few movies that weren&amp;#039;t included in the &quot;Ultimate Hacker Movie Collection&quot; (http://thepiratebay.se/torrent/3373172)\n\n\nWarGames (1983)\nA young computer whizz kid accidentally connects into a top secret super-computer which has complete control over the U.S. nuclear arsenal. It challenges him to a game between America and Russia, and he innocently starts the countdown to World War 3. Can he convince the computer he wanted to play a game and not the real thing?\n\nSneakers (1992)\nMartin Bishop is the head of a group of experts who specialise in testing security systems. When he is blackmailed by Government agents into stealing a top secret black box, the team find themselves embroiled in a game of danger and intrigue. After they recover the box, they discover that it has the capability to decode all existing encryption systems around the world, and that the agents who hired them didn&amp;#039;t work for the Government after all...\n\n23 - Nichts Ist So Wie Es Scheint (1998)\nThe movie&amp;#039;s plot is based on the true story of a group of young computer hackers from Hannover, Germany. In the late 1980s the orphaned Karl Koch invests his heritage in a flat and a home computer. At first he dials up to bulletin boards to discuss conspiracy theories inspired by his favorite novel, R.A. Wilson&amp;#039;s &quot;Illuminatus&quot;, but soon he and his friend David start breaking into government and military computers. Pepe, one of Karl&amp;#039;s rather criminal acquaintances senses that there is money in computer cracking - he travels to east Berlin and tries to contact the KGB.\n\nTakedown (2000)\nKevin Mitnick is quite possibly the best hacker in the world. Hunting for more and more information, seeking more and more cybertrophies every day, he constantly looks for bigger challenges. When he breaks into the computer of a security expert and an ex-hacker, he finds one - and much more than that...\n","torrent":{"xt":"urn:btih:759dac20609222872b34f24185835fa0af13a5d9","amp;dn":"Ultimate+Hacker+Movie+Collection+%232","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"759dac20609222872b34f24185835fa0af13a5d9","infoHashBuffer":{"type":"Buffer","data":[117,157,172,32,96,146,34,135,43,52,242,65,133,131,95,160,175,19,165,217]},"announce":[],"urlList":[]}}