{"title":"Bonnie Tyler - It's A Heartache","uid":4647492,"size":101158916,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:76ca7ea3320d9c37364bfb789f38fbc31d179a58&amp;dn=Bonnie+Tyler+-+It%5C%27s+A+Heartache&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1231934001,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;It's a Heartache&quot; is a pop-country song that was recorded by Juice Newton, Bonnie Tyler and Ronnie Spector (of the Ronettes) in 1978. Tyler had the biggest hit with the song, peaking at #3 in the U.S. and #4 in the UK. However, Newton's version went Gold in Mexico and was the original charting version in the United States, peaking at #86 on Billboard's Hot 100 before Tyler's quickly released cover version eclipsed Newton's single's chart success.\n\nTyler's version was recorded right after she had surgery for nodule removal. In the middle of healing, she accidentally yelled out in frustration, causing the distinctive rasp in her voice that she is best known for today. Badfinger drummer Mike Gibbins played drums on the Tyler single.\n\nFollowing the Top 10 success of her 1976 song &quot;Lost in France&quot;, Tyler released her first album in 1977 entitled The World Starts Tonight. A further single from the album, &quot;More Than a Lover,&quot; made the UK Top 30, whereas the follow up single, &quot;Heaven,&quot; reached the Top 30 in Germany. In 1977, Tyler was diagnosed with nodules on her vocal cords that were so severe that surgery was mandatory. However, Tyler began speaking again prior to her doctor's orders, causing her voice to take on a raspy quality. At first this made her believe that her singing career was over, but (to her surprise) her next single made her an international star. &quot;It's a Heartache&quot; made #3 on the US chart and had become a hit worldwide; it topped the charts in several countries (including France and Australia) and peaked at #2 in Germany and at #4 in the UK. The Natural Force album was also retitled It's a Heartache for the U.S. market and certified gold there.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:76ca7ea3320d9c37364bfb789f38fbc31d179a58","amp;dn":"Bonnie+Tyler+-+It%5C%27s+A+Heartache","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76ca7ea3320d9c37364bfb789f38fbc31d179a58","infoHashBuffer":{"type":"Buffer","data":[118,202,126,163,50,13,156,55,54,75,251,120,159,56,251,195,29,23,154,88]},"announce":[],"urlList":[]}}