{"title":"Lars Borgnäs - Nationens intresse (Svensk Retail EPUB)","uid":13018684,"size":846131,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76e5888d170cfcf962556fc69bf15c26b26723db&amp;dn=Lars+Borgn%26auml%3Bs+-+Nationens+intresse+%28Svensk+Retail+EPUB%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1450319237,"description":"Författare: Lars Borgnäs\r\n       Titel: Nationens intresse\r\nUtgivningsår: 2011\r\n       Språk: Svenska\r\n        ISBN: 9789113034713\r\n      Format: Retail EPUB\r\n\r\nI tre av de mest omskakande skeendena i den svenska nutidshistorien - ubåtskränkningarna, Estoniakatastrofen och mordet på Olof Palme - har sanningen om vad som skedde aldrig tillåtits komma fram.\r\n\r\nSanningen har dolts bakom hemligstämplar och ofullständiga utredningar, och ersatts med &quot;offentliga sanningar&quot;. Undersökande kommissioner har hindrats från att komma åt central information, vilseletts och påverkats av aktörers - främst militärens och specifikt den militära underrättelsetjänstens - egen dolda agenda. Där utredare har påpekat brister har dessa inte åtgärdats. Avgörande frågor har lämnats obesvarade.\r\n\r\nAtt västliga ubåtar kränkte våra vatten på åttiotalet i hemligt samförstånd med högre svenska officerare - med direkta konsekvenser för svensk utrikes- och säkerhetspolitik - har förtigits. Centrala motivbilder kring Palmemordet som pekar in i statsförvaltningen har aldrig utretts. Detsamma gäller viktiga omständigheter kring Estonias förlisning.\r\n\r\nDetta är konkreta fakta. Ställda bredvid varandra ger de upphov till ett problematiskt mönster. Här finns en gemensam komponent som heter militär underrättelsetjänst och svensk säkerhetspolitik. Vad som har uppfattats som nationens intresse har fått stå i vägen för sanningen. Borgnäs berättar om de tre skeendena och mönstret i hur sanningen blockerats. Han leder i bevis att den verklighetsbild som allmänheten bibringats är felaktig och reser frågor kring det berättigade i att medier och allmänhet vilseletts - i nationens intresse. Borgnäs lyfter också fram några av de centrala aktörerna och belyser deras roller och motiv.\r\n\r\nVilka krav kan allmänheten ställa på att få veta vad som verkligen hände? Och vilken rätt har makthavarna att dölja eller inte söka sanningen - i nationens intresse?","torrent":{"xt":"urn:btih:76e5888d170cfcf962556fc69bf15c26b26723db","amp;dn":"Lars+Borgn%26auml%3Bs+-+Nationens+intresse+%28Svensk+Retail+EPUB%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76e5888d170cfcf962556fc69bf15c26b26723db","infoHashBuffer":{"type":"Buffer","data":[118,229,136,141,23,12,252,249,98,85,111,198,155,241,92,38,178,103,35,219]},"announce":[],"urlList":[]}}