{"title":"Who Is Daredevil","uid":13482555,"size":2041847700,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:775e53aa92aa8d1b6f7403588dabc2d087a2d76f&amp;dn=Who+Is+Daredevil&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"C-Edits","files":107,"time":1455063093,"description":"The objective with these torrents was always to enlighten the masses of a particular character so that the reader can pick up any comic (with said character inside it) and feel confident in understanding it.\r\n\r\nSaying that: This one is a little different where else Ghost Rider was less known and therefore the comics derived off more &quot;elements&quot; and single issues. Daredevil fans definitely held a lot more Archs, Writer, Artist to higher standers--- leaving a vast more amount of comics to read through. Trying my best to keep the 100 issue mark it's evident I lost some &quot;Story Elements&quot; along the way. Stuck at a hundred and ten it was recommended by a friend to leave it-- to add a PRE-MARVEL NOW section. Against it at first I eliminated 4 more issues added a Videos describing the possibility of his power. I couldn't go any further, I left it, as is.\r\n\r\nHOPE IT'S GOOD AS I TRIED HARD TO PLEASE ALL OTHER DAREDEVIL FANS\r\n\r\nOver 40 years of comics filtered out leaving in it's place only the greatest and most needed Collection that is Daredevil's History. Who is Daredevil!?? Discover the answer.\r\n\r\nA combination of the Highest Voted, (By Hundreds of fans through forums, online votes and well known Daredevil experts) Most Necessary (Origin of Heroes, Villains, and Story Elements) with Marvel's Personal Favorites (As illustrated previously in there own compilation)","torrent":{"xt":"urn:btih:775e53aa92aa8d1b6f7403588dabc2d087a2d76f","amp;dn":"Who+Is+Daredevil","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"775e53aa92aa8d1b6f7403588dabc2d087a2d76f","infoHashBuffer":{"type":"Buffer","data":[119,94,83,170,146,170,141,27,111,116,3,88,141,171,194,208,135,162,215,111]},"announce":[],"urlList":[]}}