{"title":"Mickey Newbury - It Looks Like Rain (1969) v0","uid":9502273,"size":84251297,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:77f57fc0a5a5d5682c2432910b66d9c78ac494e8&amp;dn=Mickey+Newbury+-+It+Looks+Like+Rain+%281969%29+v0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"paulrobin","files":-1,"time":1390247384,"description":"In sonic terms, It Looks Like Rain sounds as far from the studio slickness of the &quot;countrypolitan&quot; machine that rock &amp; roll was from Lawrence Welk. In fact, Newbury's sound held more in common with Tim Buckley's or Simon &amp; Garfunkel's or Fred Neil's. But even here, comparisons fail. Aided by co-producers Bob Beckham and guitarist Jerry Kennedy, Newbury created an album so haunting, so elegant, so full of melancholy and mystery, it sounds out of time, out of space and is as enigmatic in the 21st century as it was when it was released in 1969. The album's sound seems to come from inside the mind of the listener, rather than from the speakers on the stereo. The album commences with the sounds of thunder and rain that introduce &quot;She Even Woke Me Up to Say Goodbye,&quot; and rather than just a cheap effect, they sound integral to both song and album, placing the listener inside them. One understands implicitly that they are entering a song cycle. Newbury's stories are so vivid, and so picaresque even with their lyric economy, they feel like movies. He can move back and forth in time while changing images to suit his evolving narrative. &quot;San Francisco Mable Joy&quot; is a long tale of dispossession, dislocation, failure, and death, but so poetically beautiful, it resounds deep in the heart of the listener. The thunderstorm becomes more prevalent but never gets in the way; it is the very frame this song fills and becomes part of; Newbury's sung lyrics are like sheets of rain pouring down as he understatedly and powerfully emotes. Suddenly, a gunshot cuts just loudly enough to jar from the reverie. At six-minutes-and-forty-three seconds, the song's drama creates a tension that is countered by a sadness so mournful it becomes nearly unbearable. And even though you know what's coming as the story winds down, the song's ending is totally devastating. The rest of It Looks Like Rain follows suit; it is masterfully and deliberately articulated. It is fine and accurate in its execution yet so carefully soft and spacious in its pace, it is brimming with strangeness balanced by charm; it defies any attempt at categorization or criticism. While it was regarded with nearly complete commercial disinterest in its day, it has been suitably regarded as a rare work of genius that has influenced countless songwriters in its wake. ","torrent":{"xt":"urn:btih:77f57fc0a5a5d5682c2432910b66d9c78ac494e8","amp;dn":"Mickey+Newbury+-+It+Looks+Like+Rain+%281969%29+v0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77f57fc0a5a5d5682c2432910b66d9c78ac494e8","infoHashBuffer":{"type":"Buffer","data":[119,245,127,192,165,165,213,104,44,36,50,145,11,102,217,199,138,196,148,232]},"announce":[],"urlList":[]}}