{"title":"eXperience 112","uid":7120189,"size":1334491889,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7899f917ae3b4af0d383a216311dec4022bc4f32&amp;dn=eXperience+112&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"esharoth","files":-1,"time":1332343065,"description":"Title: eXperience 112\nGenre: adventure / puzzle-solving / 3rd-person\nReleased: 11th October 2007\nDeveloper: Lexis Numerique\nPublisher: Micro Application\nDescription:\neXperience112 is a third-person adventure game played from an unusual angle. The game is set aboard a grounded ship in the Atlantic Ocean. The player is inside an operations room, but unable to move about. Instead, he has to guide an ill woman by the name of Lea Nichols using surveillance monitors and various complex control systems. No direct control can be exercised over Lea, instead the player uses a point-and-click interface to examine the different rooms from various angles and help her overcome obstacles by opening doors, turning valves, distracting enemies, flipping switches or taking direct control over systems governing temperature, water or electricity. Lea is not a puppet however, and she will not blindly follow every decision. It takes time to earn her trust, depending on factors such as respecting her privacy and not leading her into situations where she becomes wounded or unconscious. There is a strong emphasis on the narration as the player does not know himself or his relationship to Lea. Fragments are introduced through flashbacks, scenes during actual gameplay and by looking through documents, files, e-mails and video logs on the ship's intranet.\n\nBonus content: backgrounds, manual, maps, pictures, portraits, soundtrack, wallpapers.\n\nHow to play:\n1) Download the game;\n2) Mount or burn disc image;\n3) Run setup.exe to install (it will start automatically if you have autorun enabled);\n4) Play the game without the disc.\n\nIf you like the game, BUY it!","torrent":{"xt":"urn:btih:7899f917ae3b4af0d383a216311dec4022bc4f32","amp;dn":"eXperience+112","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7899f917ae3b4af0d383a216311dec4022bc4f32","infoHashBuffer":{"type":"Buffer","data":[120,153,249,23,174,59,74,240,211,131,162,22,49,29,236,64,34,188,79,50]},"announce":[],"urlList":[]}}