{"title":"Glenn Miller - A Christmas Concert - Big Band Swing","uid":9307713,"size":106728856,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:79d44fb7d10b28c7c6fb3251452b81864d8a7cc1&amp;dn=Glenn+Miller+-+A+Christmas+Concert+-+Big+Band+Swing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1386345679,"description":"Source: 1996 CD\n-\nGlenn Miller - A Christmas Concert 320cbr (Big Papi) 1996 Big Band Swing\n-\nNote: This is a Christmas concert but not all the songs are Christmas. -Big Papi\n-\nBy Alan Glasscock\nThis collection is a must-have for all Miller enthusiasts! All of the selections are taken from radio broadcasts, and, for one reason or another, were never recorded for commercial release by Glenn Miller's big band on record. Miller's band is perhaps most famous for his trademark saxophone section sound featured on so many ballad hits of his day, and was never considered a true &quot;swing&quot; band by the jazz purists. But tunes in this collection are a rare glimpse at just how the Miller band COULD swing, and these performances were certainly inspired by the live audience in attendance. The selections feature such soloists as Tex Beneke on tenor sax, Ernie Caceres on both alto sax and clarinet, and Billy May on trumpet. (Billy May was also the composer of &quot;Daisy May.&quot;) Many of these tunes were previously released on limited edition multi-record sets by RCA during the '50s, have not been available since, and this is their first time issued on CD. The remastered sound quality is excellent! This collection features both medium tempo numbers as well as the mile-a-minute &quot;killer dillers&quot; with which Miller would often close his radio broadcasts. Not a bad tune in the bunch!","torrent":{"xt":"urn:btih:79d44fb7d10b28c7c6fb3251452b81864d8a7cc1","amp;dn":"Glenn+Miller+-+A+Christmas+Concert+-+Big+Band+Swing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79d44fb7d10b28c7c6fb3251452b81864d8a7cc1","infoHashBuffer":{"type":"Buffer","data":[121,212,79,183,209,11,40,199,198,251,50,81,69,43,129,134,77,138,124,193]},"announce":[],"urlList":[]}}