{"title":"MLB Manager 2015 v1.1.5","uid":11805250,"size":161411937,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:7adf22e0a94fbc970c986bfdf35d0e72b690de0d&amp;dn=MLB+Manager+2015+v1.1.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Androider","files":2,"time":1428548498,"description":"Guide your favorite MLB franchise to glory! MLB Manager 2015, officially licensed by MLB.com, is the most fun and realistic baseball game ever created for mobile devices.\n\nPLEASE NOTE: Android devices with less than 512 MB of RAM are NOT supported!\n\nThe game offers three gameplay modes:\n\n- Major League Baseball Game: Choose your favorite MLB team and play out the 2015 season and beyond. There is no limit, guide your team into the future!\n- Fictional Game: MLB Manager creates one of four fictional baseball worlds and populates it with fresh players and clubs. Select a team and build a dynasty from scratch.\n- Historical MLB Game: Choose one of three past MLB seasons -- 1919, 1939, or 2012 -- and see if it produces a different outcome.\n\nAfter selecting a gameplay mode, choose a team and handle every aspect of managing it:\n\n- Manage your team, set lineups, depth charts, pitching staff and more!\n- Call the shots from the dugout and watch the games unfold.\n- Step into the shoes of the General Manager: Negotiate contracts, sign free agents, put together trades, draft the next superstar, promote players from the minors etc.\n\nDuring games, the play-by-play text is generated from a huge database of tens of thousands of lines that bring the action alive. Bottom of the ninth, two outs, bases loaded, you're down by two runs and you have your best hitter stepping to the plate against your opponent's rock-solid closer ... What will happen next?\n\nDuring the season, news tickers bring you headlines from around the leagues! Your biggest rival just pulled off a blockbuster trade with the trading deadline looming ... How will you respond?\n\nAs MLB Manager's living world evolves, players develop their careers, age, and eventually retire, with a possible spot in the OOTP Hall of Fame waiting for them. New players drafted by you and groomed in the minors take their place and become the next generation of superstars.\n\nMLB Manager 2015 is the ultimate game for baseball fans!\n\nWhat's New:\n\n- Fixed a problem with player contract demands being too high.\n- Fixed issues with certain buttons being hard to read on iPad\n- Fixed issues with editing player names &amp; salaries\n- Improved trade AI\n- Fixed a bug that prevented the import of historical rookies after the year 2012.\n- Updated real rosters and tweaked team budgets (need to start new game for changes to apply)\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.ootpdevelopments.mlbm2015&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.ootpdevelopments.mlbm2015&lt;/a&gt;\n\n\nInstructions:\n\n1.Copy 'com.ootpdevelopments.mlbm2015' folder to 'sdcard/Android/obb'\n2.Install APK\n3.Launch the game","torrent":{"xt":"urn:btih:7adf22e0a94fbc970c986bfdf35d0e72b690de0d","amp;dn":"MLB+Manager+2015+v1.1.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7adf22e0a94fbc970c986bfdf35d0e72b690de0d","infoHashBuffer":{"type":"Buffer","data":[122,223,34,224,169,79,188,151,12,152,107,253,243,93,14,114,182,144,222,13]},"announce":[],"urlList":[]}}