{"title":"Learning Drupal 6 Module Development - May 2008 - eBook","uid":4224324,"size":4100894,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b15e5e00ec00554b10322a947715b6d3e465441&amp;dn=Learning+Drupal+6+Module+Development+-+May+2008+-+eBook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BZBee","files":1,"time":1212747239,"description":"Learning Drupal 6 Module Development\n\nWalk through the development of complete Drupal 6 modules with this primer for PHP programmers, written specifically for Drupal 6 to get you started coding your first module.\n\nAre you a Drupal developer looking to update to version 6? This book covers the new and updated APIs to guide your transition to Drupal 6. The new menu system, the Forms and Schema APIs, and many core revisions are covered in this book. \n\n#####################################\n\nIn Detail\n\nWith great power comes... tremendous flexibility. Drupal is an award-winning open-source Content Management System, and the feature-packed sixth release is right around the corner. It&amp;#039;s a modular system, with an elegant hook-based architecture, and great code. These are a few of the perks that make Drupal a choice platform for developers who want the power of an established CMS, but the freedom to make it work for them. From social networking to AJAX to e-commerce, the hundreds of existing modules attest to Drupal&amp;#039;s flexibility. When you create a new module for Drupal, it fits seamlessly into the look and feel of your overall site. If you can think it in PHP, you can code it as a Drupal module.\n\nDive into Drupal module development as we create the Philosopher Biographies website, developing new modules and themes to meet practical goals. Create custom content types. Add AJAX functionality with the jQuery library. Use external XML APIs to add content to your site. Email newsletters to site members. Use themes. Empower administrators with extra features. And bundle it all up in a custom installation profile. You won&amp;#039;t find a &quot;hello world&quot; here!\n\nIf you&amp;#039;re eager to start creating modules for Drupal 6, this is your book. Walk through the development of complete Drupal modules with this primer for PHP programmers. Specifically written for Drupal 6, this book will get you coding modules as quickly as possible, and help you add the features that will give your work that professional gloss!\n\nJust getting started with Drupal development? This book will give you a clear, concise and, of course, practical guidance to take you from the basics of creating your first module to developing the skills to make you a Drupal developer to be reckoned with.\n\nAre you a Drupal developer looking to update to version 6? This book covers the new and updated APIs to guide your transition to Drupal 6. The new menu system, the Forms and Schema APIs, and many core revisions are covered in this book.\n\n#####################################\n\t\nWhat you will learn from this book\n\n    * A developer&amp;#039;s overview of important Drupal concepts and APIs, like nodes, menus, and forms\n    * Using Drupal tools for module development\n    * Creating a new module from scratch\n    * Harnessing the power of the Drupal hook system\n    * Using key Drupal functions\n    * Creating custom content types, from basic to advanced\n    * Performing database operations\n    * Writing module installers and uninstallers\n    * Making Drupal content available to JavaScript with a JSON service\n    * Interacting with the theme system to build crisp layouts\n    * Creating richer user interfaces with Drupal&amp;#039;s JavaScript libraries\n    * Working with blocks, nodes, actions, and menus\n    * Using a web service to retrieve and display XML data\n    * Creating an administration interface\n    * Customizing user profiles\n    * Writing actions and triggering them with events\n    * Working with the Forms API\n    * Defining custom hooks and making modules work together\n    * Exploring the database and schema API\n    * Creating an installation profile to bundle your modules into a custom Drupal distribution\n\n#####################################\n\t\nWho this book is written for\n\nThis book is written for PHP developers who want to add custom features to Drupal. You will need to know the basics of PHP and MySQL programming, but no experience of programming Drupal is required, although you will be expected to be familiar with the basic operation of Drupal.\n\n#####################################\n\nAuthor -  Matt Butcher\n\nMatt Butcher is the principal consultant for Aleph-Null, Inc. (http://aleph-null.tv), where he specializes in content management systems, Linux system integration, and Open Source technologies. He has been an active participant in Open Source technologies for over a decade. Along with Learning Drupal 6, Matt has also written Mastering OpenLDAP, Managing and Customizing OpenCms 6, and Building Websites with OpenCms, all of which are published by Packt. When not pushing bits, Matt likes to explore Colorado with his wife and three daughters.\n\n#####################################","torrent":{"xt":"urn:btih:7b15e5e00ec00554b10322a947715b6d3e465441","amp;dn":"Learning+Drupal+6+Module+Development+-+May+2008+-+eBook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b15e5e00ec00554b10322a947715b6d3e465441","infoHashBuffer":{"type":"Buffer","data":[123,21,229,224,14,192,5,84,177,3,34,169,71,113,91,109,62,70,84,65]},"announce":[],"urlList":[]}}