{"title":"George Benson - Anthology (2CD) [EAC-FLAC] [RePoPo]","uid":4882244,"size":1003324629,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7b5dc67d5c4a7692548e0d75d65e22b9609d3f87&amp;dn=George+Benson+-+Anthology+%282CD%29+%5BEAC-FLAC%5D+%5BRePoPo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"repopo","files":-1,"time":1241454456,"description":"*******************************************************************************\n                        George Benson - Anthology (2CD)\n*******************************************************************************\n\n\nCD1\n\n01. Shadow Dancers    [0:04:46.67]\n02. Ain't That Peculiar    [0:02:57.65]\n03. A Foggy Day    [0:02:33.35]\n04. Ready And Able    [0:03:33.65]\n05. What's New    [0:05:31.53]\n06. Chattanooga Choo Choo    [0:03:38.00]\n07. White Rabbit    [0:07:00.57]\n08. Summertime (Live)    [0:07:19.00]\n09. Breezin'    [0:05:21.03]\n10. This Masquerade    [0:08:04.47]\n11. Shark Bite    [0:06:10.08]\n12. Nature Boy    [0:06:00.72]\n13. The Greatest Love Of All (Single Version)    [0:03:36.23]\n14. On Broadway (Live) (Single Version)    [0:05:15.27]\n15. We All Remember Wes (Live)    [0:05:47.68]\n\n\nCD2\n\n01. Love Ballad (Single Version)    [0:04:19.37]\n02. Off Broadway    [0:05:26.13]\n03. Moody's Mood    [0:03:27.57]\n04. Give Me The Night (Single Version)    [0:03:42.58]\n05. Turn Your Love Around    [0:03:50.70]\n06. Love All The Hurt Away (With Aretha Franklin)    [0:04:09.10]\n07. Mimosa (With Jimmy Smith)    [0:05:50.32]\n08. Being With You    [0:03:55.58]\n09. 20/20    [0:04:06.02]\n10. New Day    [0:04:27.60]\n11. Kisses In The Moonlight (Single Version)    [0:03:54.68]\n12. Mt. Airy Road (With Earl Klugh)    [0:07:52.07]\n13. Let's Do It Again (Single Version)    [0:03:42.00]\n14. Tenderly    [0:03:06.65]\n15. Ready Now That You Are    [0:05:50.05]\n16. The Long And Winding Road    [0:05:54.50]\n17. C-Smooth    [0:05:52.38]\n\n\n-------------------------------------------------------------------------------\n\nAlbum Review   by Al Campbell\n\nGeorge Benson's two-disc Anthology from Rhino ultimately manages to encapsulate \nBenson's career. These 32 tracks not only highlight the obligatory vocal pop \nhits &quot;Turn Your Love Around,&quot; &quot;Give Me the Night,&quot; and &quot;On Broadway,&quot; but dish \nout a heavy dose of his early jazz recordings that followed in the footsteps of \nWes Montgomery, and his many appearances throughout the years with Brother Jack \nMcduff, Lonnie Smith, Hubert Laws, Aretha Franklin, Jimmy Smith, Earl Klugh, and \nthe Count Basie Orchestra. If you're only accustomed to Benson's pop/jazz \ncrossover work, check out this definitive overview. \n\n-------------------------------------------------------------------------------\n\nON BROADWAY\n\nSong Review   by Jason Elias\n\nThis song proves that strongly written songs can keep coming back. Unbeknownst \nto a lot of the record-buying public, &quot;On Broadway&quot; was a song that went through \nmany configurations. Songwriters Barry Mann and Cynthia Weil originally wrote it \nwith a girl group in mind. The producers Jerry Leiber and Mike Stoller liked it \nfor the Drifters, and after some tweaking, it became an early-'60s Brill \nBuilding classic. Years later, George Benson, the leading jazz-pop artist, \ntackled it for his 1978 live album, Weekend in LA. For his version, Benson \nturned the song into a track that boasted his late-'70s band's unique sound. In \nmany respects, the lyrics fit Benson to a tee, especially the line, &quot;I can play \nthis here guitar.&quot; That of course garnered a lot of applause. This track seemed \nto feed off of the crowd's energy and probably wouldn't have worked as well as a \nstudio endeavor. Some may never be pleased, though. For some this is too close \nto Vegas-y, but Benson's singing desires had long been in the making. To assuage \nthose who are worried, Benson also does some great riffing here. Keyboardist \nJorge Dalto does some great synthesizer lines, especially on the fade that gave \nthis song a sense of freshness and a special touch. \n\n-------------------------------------------------------------------------------\n\nGIVE ME THE NIGHT\n\nSong Review   by Jason Elias\n\nReleased in mid-1980, this polished song caught the tail end of the disco era. \nThis is unabashed flash and glitz that producer Quincy Jones was becoming famous \nfor. For Benson, Jones didn't stray too far from his late-'70s, early-'80s \nhitmaking recipe. This track is almost defiantly lush. Sonically, Jones put an \necho on Benson's guitar riffs on this track and throughout &quot;Give Me the Night.&quot; \nThat gives this almost three-dimensional sound. Patti Austin is heard throughout \ndoing scat vocals through the verses. Speaking of vocals, this is arguably one \nof Benson's most natural and non-ingratiating performances. Surprisingly, \nguitarist Lee Ritenour also appears on this track and it's hard to discern where \nall of the good riffs come from. Like many of the dance songs of the era, this \ntoo is subtly romantic and mature. Rod Temperton, the song's writer, had also \ndone similar work for Michael Jackson's Off the Wall and Rufus and Chaka's \nMasterjam. Bassist Abraham Labroiel and drummer John Robinson provide the cushy \nrhythm here. &quot;Give Me the Night&quot; is one of those few songs that actually might \nmake a listener feel better for that 4:58. \n\n-------------------------------------------------------------------------------\n\nTURN YOUR LOVE AROUND\n\nSong Review   by Ed Hogan\n\n&quot;Turn Your Love Around&quot; was written for the purpose of adding new tracks to a \ngreatest-hits collection by George Benson. Warner Bros. executives approached \nsongwriter/producer Jay Graydon to write some songs for the multi-record set. \nWith two days before the deadline, Graydon got an idea while having dinner with \nSteve Lukather, who came up with a verse. The bridge and other verses (and the \nfinished record's background vocals) were contributed by Bill Champlin. A couple \nof days later, Graydon met Benson for the first time at Graydon's impressive \nhome studio and found an instant kinship; both were guitar players. The spunky \ntrack featured one of the first Linn drum machines, which was programmed by Jeff \nPorcaro with synth bass played by his Toto bandmate David Paich. Graydon played \nguitar on the song. It also features one of Benson's most aggressive vocals, \nthough it's still in his favored smooth style. &quot;Turn Your Love Around&quot; hit \nnumber one R&amp;B and number five pop in early 1982. \n\n-------------------------------------------------------------------------------\n\nGeorge Benson Biography   by Richard S. Ginell\n\nGeorge Benson is simply one of the greatest guitarists in jazz history, but he \nis also an amazingly versatile musician, and that frustrates to no end critics \nwho would paint him into a narrow bop box. He can play in just about any style \n-- from swing to bop to R&amp;B to pop -- with supreme taste, a beautiful rounded \ntone, terrific speed, a marvelous sense of logic in building solos, and, always, \nan unquenchable urge to swing. His inspirations may have been Charlie Christian \nand Wes Montgomery -- and he can do dead-on impressions of both -- but his style \nis completely his own. Not only can he play lead brilliantly, he is also one of \nthe best rhythm guitarists around, supportive to soloists and a dangerous \nswinger, particularly in a soul-jazz format. Yet Benson can also sing in a lush \nsoulful tenor with mannerisms similar to those of Stevie Wonder and Donny \nHathaway, and it is his voice that has proved to be more marketable to the \npublic than his guitar. Benson is the guitar-playing equivalent of Nat King Cole \n-- a fantastic pianist whose smooth way with a pop vocal eventually eclipsed his \ninstrumental prowess in the marketplace -- but unlike Cole, Benson has been \ngranted enough time after his fling with the pop charts to reaffirm his jazz \nguitar credentials, which he still does at his concerts.\n\nBenson actually started out professionally as a singer, performing in nightclubs \nat eight, recording four sides for RCA's X label in 1954, forming a rock band at \n17 while using a guitar that his stepfather made for him. Exposure to records by \nChristian, Montgomery, and Charlie Parker got him interested in jazz, and by \n1962, the teenaged Benson was playing in Brother Jack McDuff's band. After \nforming his own group in 1965, Benson became another of talent scout John \nHammond's major discoveries, recording two highly regarded albums of soul-jazz \nand hard bop for Columbia and turning up on several records by others, including \nMiles Davis' Miles in the Sky. He switched to Verve in 1967, and, shortly after \nthe death of Montgomery in June 1968, producer Creed Taylor began recording \nBenson with larger ensembles on A&amp;M (1968-1969) and big groups and all-star \ncombos on CTI (1971-1976).\n\nWhile the A&amp;M and CTI albums certainly earned their keep and made Benson a \nguitar star in the jazz world, the mass market didn't catch on until he began to \nemphasize vocals after signing with Warner Bros. in 1976. His first album for \nWarner Bros., Breezin', became a Top Ten hit on the strength of its sole vocal \ntrack, &quot;This Masquerade,&quot; and this led to a string of hit albums in an \nR&amp;B-flavored pop mode, culminating with the Quincy Jones-produced Give Me the \nNight. As the '80s wore on, though, Benson's albums became riddled with \ncommercial formulas and inferior material, with his guitar almost entirely \nrelegated to the background. Perhaps aware of the futility of chasing the charts \n(after all, &quot;This Masquerade&quot; was a lucky accident), Benson reversed his field \nlate in the '80s to record a fine album of standards, Tenderly, and another with \nthe Basie band, his guitar now featured more prominently. His pop-flavored work \nalso improved noticeably in the '90s. Benson retains the ability to spring \nsurprises on his fans and critics, like his dazzlingly idiomatic TV appearance \nand subsequent record date with Benny Goodman in 1975 in honor of John Hammond, \nand his awesome command of the moment at several Playboy Jazz Festivals in the \n1980s. His latter-day recordings include the 1998 effort Standing Together, \n2000's Absolute Benson, 2001's All Blues, and 2004's Irreplaceable. Three songs \nfrom 2006's Givin' It Up, recorded with Al Jarreau, were nominated for Grammy \nAwards in separate categories. \n\n-------------------------------------------------------------------------------\n\nExact Audio Copy V0.99 prebeta 4 from 23. January 2008\n\nEAC extraction logfile from 4. May 2009, 4:47\n\nGeorge Benson / Anthology (CD1)\n\nUsed drive  : TOSHIBA DVD/HD  X807616   Adapter: 5  ID: 0\n\nRead mode               : Secure\nUtilize accurate stream : Yes\nDefeat audio cache      : Yes\nMake use of C2 pointers : No\n\nRead offset correction                      : 697\nOverread into Lead-In and Lead-Out          : No\nFill up missing offset samples with silence : Yes\nDelete leading and trailing silent blocks   : No\nNull samples used in CRC calculations       : Yes\nUsed interface                              : Native Win32 interface for Win NT \n&amp; 2000\nGap handling                                : Appended to previous track\n\nUsed output format              : User Defined Encoder\nSelected bitrate                : 768 kBit/s\nQuality                         : High\nAdd ID3 tag                     : No\nCommand line compressor         : F:Archivos de programaExact Audio \nCopyFLACFLAC.EXE\nAdditional command line options : -6 -V -T &quot;ARTIST=%a&quot; -T &quot;TITLE=%t&quot; -T \n&quot;ALBUM=%g&quot; -T &quot;DATE=%y&quot; -T &quot;TRACKNUMBER=%n&quot; -T &quot;GENRE=%m&quot; -T &quot;COMMENT=%e&quot; %s -o \n%d\n\n\nExact Audio Copy V0.99 prebeta 4 from 23. January 2008\n\nEAC extraction logfile from 4. May 2009, 5:30\n\nGeorge Benson / Anthology (CD2)\n\nUsed drive  : TOSHIBA DVD/HD  X807616   Adapter: 5  ID: 0\n\nRead mode               : Secure\nUtilize accurate stream : Yes\nDefeat audio cache      : Yes\nMake use of C2 pointers : No\n\nRead offset correction                      : 697\nOverread into Lead-In and Lead-Out          : No\nFill up missing offset samples with silence : Yes\nDelete leading and trailing silent blocks   : No\nNull samples used in CRC calculations       : Yes\nUsed interface                              : Native Win32 interface for Win NT \n&amp; 2000\nGap handling                                : Appended to previous track\n\nUsed output format              : User Defined Encoder\nSelected bitrate                : 768 kBit/s\nQuality                         : High\nAdd ID3 tag                     : No\nCommand line compressor         : F:Archivos de programaExact Audio \nCopyFLACFLAC.EXE\nAdditional command line options : -6 -V -T &quot;ARTIST=%a&quot; -T &quot;TITLE=%t&quot; -T \n&quot;ALBUM=%g&quot; -T &quot;DATE=%y&quot; -T &quot;TRACKNUMBER=%n&quot; -T &quot;GENRE=%m&quot; -T &quot;COMMENT=%e&quot; %s -o \n%d\n\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:7b5dc67d5c4a7692548e0d75d65e22b9609d3f87","amp;dn":"George+Benson+-+Anthology+%282CD%29+%5BEAC-FLAC%5D+%5BRePoPo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b5dc67d5c4a7692548e0d75d65e22b9609d3f87","infoHashBuffer":{"type":"Buffer","data":[123,93,198,125,92,74,118,146,84,142,13,117,214,94,34,185,96,157,63,135]},"announce":[],"urlList":[]}}