{"title":"Charalambides - A Vintage Burden","uid":4630339,"size":77188076,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7bc8ad0b012b23a134d04a78e2deba0ecb2cf246&amp;dn=Charalambides+-+A+Vintage+Burden&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dudenas","files":6,"time":1231364213,"description":"Possessed of one of the coolest names around -- actually a Greek surname -- Texas' Charalambides made a number through the '90s and beyond for their many recordings exploring a haunting, psychedelic-informed brand of exploratory electric guitar instrumentals. Husband-and-wife team Tom and Christina Carter -- the former a veteran of the Mike Gunn -- originally formed Charalambides in pre-marriage days with a friend, Kyle Silfer, in 1991 in Houston. Initial recordings at home for self-satisfaction led to both local gigs and a series of recordings; Silfer soon left the group, but the Carters continued on, making their first major splash with 1993's Union on Siltbreeze Records. Jason Bill joined the band after Union and participated with the group live and on record through 1996, after which the Carters once again did things on their own. In that year, Charalambides reached a new level of fame by appearing alongside equally inspired bands as Bardo Pond and Flying Saucer Attack on the tremendous Harmony of the Circles box set. Numerous recordings and the occasional live appearances followed in future years, other players at times joining the Carters, but essentially revolving around the core duo, who had relocated to Austin. 2000 and after brought a new flood of material, including a variety of new compilation appearances and the excellent Home and Sticks collections, followed the next year by a tour recording, Water, and a lathe-cut LP, Branches. Being as It Is appeared in 2002 on Crucial Blast, while 2003's Unknown Spin, 2004's Joy Shapes, and 2006's Vintage Burden all came out on Kranky Records. \n\n[allmusic.com]","torrent":{"xt":"urn:btih:7bc8ad0b012b23a134d04a78e2deba0ecb2cf246","amp;dn":"Charalambides+-+A+Vintage+Burden","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bc8ad0b012b23a134d04a78e2deba0ecb2cf246","infoHashBuffer":{"type":"Buffer","data":[123,200,173,11,1,43,35,161,52,208,74,120,226,222,186,14,203,44,242,70]},"announce":[],"urlList":[]}}