{"title":"Dean John William Burgon Book Collection","uid":11773499,"size":134821849,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c6c70b1bda7c9df19a1baa680658a80ee60916b&amp;dn=Dean+John+William+Burgon+Book+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":7,"time":1427169541,"description":"\nTitles:\nInspiration And Interpretation\nThe First Chapter Of Genesis - A Reply And A Postscript\nThe Holy Gospels, Volume I - The Traditional Text\nThe Holy Gospels, Volume II - The Causes Of Corruption\nThe Last Twelve Verses Of Mark\nThe Revision Revised\nA Guide To The Textual Criticism Of The New Testament\n\n\nAbout the author:\nOver a hundred years ago there was a warrior and fighter for the scriptures. His name was John William Burgon. This champion was from a different time and century from you and me; nevertheless, he was a staunch defender of Bibliology. As you know, this discipline is the bedrock of all theology.\n\nJohn William Burgon (1813-1888) was a man of tremendous intellect and ranks among men such a Lancelot Andrews and Robert Dick Wilson in scholarship. He became the Dean of Chichester and has since been known as &quot;Dean&quot; Burgon. He was an outstanding 19th century Bible scholar.\n\nDr. Burgon was contemporary with Westcott and Hort. He was an advocate of the Textus Receptus and was the nemesis of Westcott and Hort's feeble arguments against it. He believed, unlike Westcott and Hort, in basing all conclusions on the solid foundation of facts rather than the sand of theory. He would leave no stone unturned in his quest for truth and no blow undelivered in his defense of it.\n\nHis serious scholarship, quick wit and acid tongue drove Westcott and Hort and all other Alexandrian scholars from the field of battle. His arguments against the Alexandrian text and in favor of the last 12 verses of Mark and other questioned portions have proven to be as unanswerable by modem scholarship as they were to his contemporaries.\n\nJohn William Burgon was a battler. He applied what he knew, and it cost him something. He did not get promoted. He was not on the English Revised Version committee of 1881. He was not made a professor, canon, or Bishop of his church. Neither was he made the head of a college. Why? Because he &quot;rocked too many boats&quot;! He loved the Book!\n\nToday his name is as synonymous with the defense of the King James Bible as the names of Hills, Fuller and Ruckman. He is not only known as a champion of the Authorized Bible, but his works are an example of what honest, objective and thorough scholarship can produce","torrent":{"xt":"urn:btih:7c6c70b1bda7c9df19a1baa680658a80ee60916b","amp;dn":"Dean+John+William+Burgon+Book+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c6c70b1bda7c9df19a1baa680658a80ee60916b","infoHashBuffer":{"type":"Buffer","data":[124,108,112,177,189,167,201,223,25,161,186,166,128,101,138,128,238,96,145,107]},"announce":[],"urlList":[]}}