{"title":"Red Alert by Peter Bryant ","uid":10080317,"size":791845,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d093902d6406c08a7d1893de66134e4b1808579&amp;dn=Red+Alert+by+Peter+Bryant+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"PirateBook","files":2,"time":1398992422,"description":"\nPeter Bryant's novel Red Alert tells the terrifying tale of just how close to nuclear destruction the world can be. Here, we are faced with the worst possible of all worst-case scenarios in the Cold War; an American general loses his reason and orders a full-scale nuclear attack on the Soviet Union. \n\nAir Force Brigadier General Quinten is a dying man suffering from the paranoid delusion that he can make the world a better place by setting in motion this catastrophic attack with Strategic Air Command bombers armed with nuclear weapons. Once they get wind of it, the President of the United States and his advisors work frantically in all efforts to stop the attack. \n\nThey order the American bombers shot down, and they succeed - all but with one frightening exception - a lone bomber called the &quot;&quot;Alabama Angel&quot;&quot; escapes destruction. The crew of the Angel ignore the President's orders and continue on with their deadly mission. This book was originally published in the U.K. under the title Two Hours to Doom (written by Peter Bryant, the penname of writer Peter George). \n\nThis intricately plotted and well-thought out novel conjures the vision of apocalyptic threat of nuclear war and illustrates just how absurdly easy such an attack can be triggered.\n\nGenre: Mystery | Thriller","torrent":{"xt":"urn:btih:7d093902d6406c08a7d1893de66134e4b1808579","amp;dn":"Red+Alert+by+Peter+Bryant+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d093902d6406c08a7d1893de66134e4b1808579","infoHashBuffer":{"type":"Buffer","data":[125,9,57,2,214,64,108,8,167,209,137,61,230,97,52,228,177,128,133,121]},"announce":[],"urlList":[]}}