{"title":"Shawn Colvin - Sunny Came Home  (2nafish)","uid":5401668,"size":122372100,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7d808fac9c907045290934cd8c0c5368bb8ba789&amp;dn=Shawn+Colvin+-+Sunny+Came+Home++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1267449868,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Sunny Came Home&quot; is a Grammy Award-winning folk-rock song by American musician Shawn Colvin. It is the theme song to her 1996 concept album A Few Small Repairs, and quickly became a hit when it was released as a CD single on June 24, 1997.\n\nThe song tells the story of Sunny, &quot;a frustrated housewife who torches her own home.&quot; (The cover art on the single shows images of a woman and a burning house.)\n\nIt is one of several &quot;story songs&quot; on A Few Small Repairs, a method of songwriting Colvin began experimenting with while writing for the album. The title of the song comes from the opening lyrics.\n\nThe song's calming and upbeat music, fronted by a distinctive mandolin strum, contrasts sharply with the destructive lyrics, particularly the haunting bridge: &quot;Count the years; you always knew it / Strike a match; go on and do it&quot;. The title of the album, A Few Small Repairs, also appears in the third line of the second verse of the song, &quot;It's time for a few small repairs she said.&quot;\n\nAt the end of the song, the lighting of a match can briefly be heard, followed by a quick breath to presumably put the flame out. The version that played on most radio stations was edited, removing approximately 30 seconds of instrumental music, mostly at the end of the song.\n\n&quot;Sunny Came Home&quot; is Colvin's most successful single to date. In the 1998 Grammy Awards, it was named Song of the Year and Record of the Year. It peaked at #7 on the Billboard Hot 100 in the US, and likely would have achieved a higher peak had it been released commercially sooner to correspond with the song's airplay maximum: it was #1 on the Hot 100 Airplay chart for four weeks and also #1 on the Adult Contemporary chart for four weeks. On the Hot 100 Single Sales chart, however, it peaked at #29. Colvin's record label did not plan to release the track as a retail single until it became an airplay favorite on CHR as well as AC and Adult Alternative radio stations and the label deduced that the song appealed to a younger audience who might be willing to buy the single.\n\nThe Grammy Awards presentation was the occasion for an interruption by rapper Ol' Dirty Bastard stating that his group, Wu-Tang Clan, is for the children, while Colvin was about to receive her award. \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:7d808fac9c907045290934cd8c0c5368bb8ba789","amp;dn":"Shawn+Colvin+-+Sunny+Came+Home++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d808fac9c907045290934cd8c0c5368bb8ba789","infoHashBuffer":{"type":"Buffer","data":[125,128,143,172,156,144,112,69,41,9,52,205,140,12,83,104,187,139,167,137]},"announce":[],"urlList":[]}}