{"title":"Sexually Broken--Petite Gabriella Paltrova extrem deepthroat iPo","uid":9507396,"size":206870491,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:7e27aadc5818d12e1aa284571b48773144fe7b13&amp;dn=Sexually+Broken--Petite+Gabriella+Paltrova+extrem+deepthroat+iPo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1390340816,"description":"\nPetite Gabriella Paltrova suffers extreme deepthroating, brutal fucking Squirting Orgasms, Cum Drunk | Gabriella Paltrova | Matt Williams\n\nJanuary 20, 2014\n\n\niPod MP4 only for now.\n\n\nPetite 4'11 Gabriella Paltrova is back on the pages of Sexually Broken. This tiny girl can handle the cock and today she will be tested, both sexually and mentally. Sexually Broken is serious about fucking girls up with cock and orgasms, today Gabriella is overloaded so far she calls RED to stop us from making her cum anymore. We broke a porn star with too many orgasms.\n\nBound on a custom metal bondage device, with leather cuffs, Gabriella's pussy and face are at perfect cock height. Very soon each hole is going to be jammed with cock, filling both throat and tiny pussy with hard brutal cock. There is nothing our helpless nubile unit can do, well except cum and gag a lot.\n\nWe start out with Gabriella's throat. The cock slides into her facehole and pushes deep until all air is cut off. Then we push deeper. Spit, drool and snot all combine to brutally face fuck our helpless slut. A look into her eyes tells us it's time to fuck that wet pussy of hers so we move around to the front and slide the hard cock balls deep with one hard thrust. It takes seconds for our tiny bondage whore to cum, just seconds. \n\nWe pound on the pussy, Gabriella is locked into place and is reduced to moaning, screaming and cumming. We move around and give her throat another round of extreme deepthroating. Then it's back and forth, brutal pussy fucking and catastrophic skull sex, over and over. Gabriella's face is now covered in throat gunk, her pussy dripping girl cum and she seems to have a hard time seeing straight. We bring in the fingers and vibrator. We fingerblast an intense squirting orgasm out of sex dazed slut, then apply the vibrator to her sensitive clit. She cums, then cums again. she is struggling begging for us to stop and we keep on making her cum. So brutal are the orgasms, so intense, she uses her safe word for cumming to hard! Well that's a first, we broke a porn star with orgasms...  \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/01_20gpaltrova2/SexuallyBroken-Gabriella-Paltrova-Matt-Williams-Petite-Gabriella-Paltrova-suffers-extreme-deepthroating-brutal-fucking-Squirting-Orgasms-Cum-Drunk.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/01_20gpaltrova2/SexuallyBroken-Gabriella-Paltrova-Matt-Williams-Petite-Gabriella-Paltrova-suffers-extreme-deepthroating-brutal-fucking-Squirting-Orgasms-Cum-Drunk.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:7e27aadc5818d12e1aa284571b48773144fe7b13","amp;dn":"Sexually+Broken--Petite+Gabriella+Paltrova+extrem+deepthroat+iPo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e27aadc5818d12e1aa284571b48773144fe7b13","infoHashBuffer":{"type":"Buffer","data":[126,39,170,220,88,24,209,46,26,162,132,87,27,72,119,49,68,254,123,19]},"announce":[],"urlList":[]}}