{"title":"Requiem 1.8.6 (iTunes 8.1, Windows + Mac)","uid":4775230,"size":877745,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:7f5368db5cc45ebe88b0f0c9a3f2ab37a7697867&amp;dn=Requiem+1.8.6+%28iTunes+8.1%2C+Windows+%2B+Mac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OompahLoompah108","files":1,"time":1237190296,"description":"* Thank you Brahms for your continued support in making Requiem! *\n\n- Changes since last version -\n\n1.8.5 -&gt; 1.8.6:\n* handle 8.1 on Mac (Intel only, sorry) and Windows.\n* another &gt;2GB file fix (hopefully the last).\n\nRequiem is an open source program that will strip the DRM from your iTunes music and video files. While people have found other ways around the DRM, such as burning their music and ripping it, that will lose sound quality. That's where this program comes in - it not only removes the DRM from music AND videos, it does so losslessly.\n\nJust double click on the Requiem.jar file and the GUI will come up. \n(However, for Mac users, I would recommend the RequiemDroplet.app because of the Drag &amp; Drop feature.)\n\n- Requirements -\n\n* iTunes 8.1\n* Quicktime 7.6\n* You'll need to install Java (http://www.java.com/getjava/) if you want to use the Java GUI that is included that can be used on both Windows and Mac platforms.\n\nDISCLAIMER\n* Backup your protected purchases (or make absolutely sure your content is successful by manually listening/watching the content).\n* Do not expect Requiem to decrypt video rentals.  This was only intended for purchases, but even if you attempted to, don't expect it to work.\n=================================================================================\n\nThree last notes to end on:\n\n1. I do not deserve any credit for Requiem. Any thanks should be directed to Brahms, the creator of Requiem. I am happily sharing it here on the Pirate Bay.\n\n2. Do NOT share your de-DRM'd iTunes purchases on a file-sharing network. Why? Apple has personal information in your purchased content.  Requiem does not remove the personal information from your files. Your identity is at stake and Apple could ban your account (at the very least) if caught. (I, OompahLoompah108, have no control of this feature in Requiem, I am just the uploader, not the developer.)\n\n3. Please obey the Golden Rule of File-Sharing, &quot;Share with others, as you would want others to share with you.&quot;  Okay, I made up that quote - but please, share as long as you can, even a week is much appreciated.  Thanks in advance.\n\nCheers! :)","torrent":{"xt":"urn:btih:7f5368db5cc45ebe88b0f0c9a3f2ab37a7697867","amp;dn":"Requiem+1.8.6+%28iTunes+8.1%2C+Windows+%2B+Mac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f5368db5cc45ebe88b0f0c9a3f2ab37a7697867","infoHashBuffer":{"type":"Buffer","data":[127,83,104,219,92,196,94,190,136,176,240,201,163,242,171,55,167,105,120,103]},"announce":[],"urlList":[]}}