{"title":"Stimulating Concepts in Chemistry","uid":11995198,"size":17034723,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7fb7fe0e069ab6a1452713e7e2094697a52fdbbc&amp;dn=Stimulating+Concepts+in+Chemistry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1433610099,"description":"ISBN 3527299785\n\n\nFresh ideas have always been a necessary ingredient for progress in chemistry. Without a continuous supply of stimulating ideas from creative researchers, there would be no new insights into the subject. But what are some of the ideas that pervade modern chemistry? The answer to this question is to be found in &quot;Stimulating Concepts in Chemistry&quot;. In a collection of 24 essays, a group of leading researchers provides an overview of the most recent developments in their fields.\n\nReaders can find out about modern concepts in chemistry such as self-assembly, nanochemistry, and molecular machines. Moreover, many spectacular advances have been achieved from the fusion of chemistry with life and materials science - a development which is illustrated by contributions on enzyme mimics, molecular wires, and chemical sensors. Further, the essayists write about new nanomaterials, efficient methods in synthesis, and big biomolecules - indeed, many of the topics that have dominated some of the recent discussions in chemistry.\n\nThis outstanding text makes use of a special layout to reflect the editors' aim of presenting concepts in the form of essays. Thus, the book is not merely another source of knowledge but is intended to stimulate readers to develop their own ideas and concepts.\n\nThis format should help to make the book interesting to a wide range of scientists. Students of chemistry will benefit from the different style of presentation of their subject, while researchers in industry and academia will welcome the exciting way in which some of the most challenging concepts in modern chemistry are presented","torrent":{"xt":"urn:btih:7fb7fe0e069ab6a1452713e7e2094697a52fdbbc","amp;dn":"Stimulating+Concepts+in+Chemistry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fb7fe0e069ab6a1452713e7e2094697a52fdbbc","infoHashBuffer":{"type":"Buffer","data":[127,183,254,14,6,154,182,161,69,39,19,231,226,9,70,151,165,47,219,188]},"announce":[],"urlList":[]}}