{"title":"Pernice Brothers - Discover a Lovelier You [2005] [EAC,log,cue. ","uid":8765755,"size":282799262,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:80427be2f8810ed9d88d755eac211e0268772582&amp;dn=Pernice+Brothers+-+Discover+a+Lovelier+You+%5B2005%5D+%5BEAC%2Clog%2Ccue.+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":16,"time":1375329095,"description":"Artist: Pernice Brothers\nRelease: Discover a Lovelier You\nReleased: 2005\nLabel: One Little Indian\nCatalog#: TPLP 439CD\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: indie pop rock\n\n\n1\t There Goes the Sun 3:36 \n2\t Saddest Quo 3:32 \n3\t Snow 3:09 \n4\t Sell Your Hair 3:16 \n5\t My So-Called Celibate Life 3:36 \n6\t Dumb It Down 2:23 \n7\t Discover a Lovelier You 3:54 \n8\t Say Goodnight to the Lady 2:41 \n9\t Amazing Glow 3:05 \n10\t Subject Drop 2:47 \n11\t Pisshole in the Snow 3:17 \n12\t Red Desert 4:19 \n13\t Amazing Glimmer 0:26 \n\n\n\n\n\nThe name Pernice Brothers on an album conjures up certain things in your mind: clever and heartfelt lyrics, Joe Pernice's whispered croon (the best since Colin Blunstone), sugar-sweet and direct melodies, as well as sophisticated arrangements and production. Along with the near-breathless anticipation that comes with the release of a new Pernice Brothers record, there's also a slight sensation of fear: you have to wonder a little -- can they keep it up? Let there be no doubts with their fifth album, because Discover a Lovelier You is near-perfect Pernice Brothers and is therefore near-perfect guitar pop. The album is less polished and slick than Yours, Mine &amp; Ours but is more produced, with loads of care given to the sound of each song. Some new aspects to the sound pop up here and there: the new wave synths on &quot;There Goes the Sun,&quot; the Western soundtrack harmonica on &quot;Saddest Quo,&quot; the dueling backwards guitars at the end of &quot;Snow&quot; that break into the toughest-sounding guitar solo on a Brothers record. That's only the first three songs, and it continues throughout the entire record with all the sonic surprises used perfectly and adding up to perhaps their best-sounding album yet. Perhaps it is because the album was recorded in various locales around North America, but the album has the feel of variety that has been missing from previous efforts, with songs as diverse as the strummy and near bubblegummy &quot;Dumb It Down,&quot; the austere but beautiful Hollywood ballad &quot;My So-Called Celibate Life,&quot; the electric folk-rock of &quot;Say Goodnight to the Lady,&quot; and the sparse electronic folk of &quot;Pisshole in the Snow,&quot; mixed in with wonderful traditionally Pernice-sounding songs like the moody &quot;Red Desert&quot; and the shimmering &quot;Amazing Glow&quot; (a duet between Pernice and Blake Hazard). Even the instrumental title track feels like a revelation, that even without Pernice's vocals the band is almost achingly perfect. On Discover a Lovelier You, the group is at the very peak of its game. At just the right time, too, since it almost felt like the group was in danger of becoming somewhat complacent after the last record, perhaps even predictable. This record puts those concerns to rest and, between the perfect production and the genius batch of songs, makes a case for the Pernice Brothers as the best pop band on the planet. At the very least, you will be hard-pressed to discover a lovelier group, or record, in 2005.","torrent":{"xt":"urn:btih:80427be2f8810ed9d88d755eac211e0268772582","amp;dn":"Pernice+Brothers+-+Discover+a+Lovelier+You+%5B2005%5D+%5BEAC%2Clog%2Ccue.+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80427be2f8810ed9d88d755eac211e0268772582","infoHashBuffer":{"type":"Buffer","data":[128,66,123,226,248,129,14,217,216,141,117,94,172,33,30,2,104,119,37,130]},"announce":[],"urlList":[]}}