{"title":"Focus Photoeditor v6.5.3 with Key [TorDigger]","uid":8372287,"size":39061885,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8292f614c1543149369fb9dd7cc0df33449aa7a8&amp;dn=Focus+Photoeditor+v6.5.3+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":9,"time":1365953123,"description":"Focus Photoeditor\n\nWith Focus Photoeditor no More Guessing in your daily image editing ! With this professional yet easy to use tool you will be able to turn any picture into a masterpiece and design creative projects.\n\nIt is the right tools for both beginners and advanced users.\nThe very gem of Focus Photoeditor, is the &quot;Quick-Fix&quot; algorithm. \nIt allows anyone, even the beginner, to correct their photos with asingle click. But our image editor is much more than just automatic fixing, it has any tool you may ever need, it includes also layers and a huge selection of filters and selection modes.\n\nWhat makes Focus Photoeditor Really GREAT!\n\n-Loads Fast, Start Editing your pictures Immediately!\n-Very Easy to use once you familiarize with its interface. Gives you professional results.\n-Supports over 100 digital camera RAW formats. (Click here for the list)\n-Has the best set of Automatic Photo Corrections you could ask for.\n-Uses High Quality- finely pre-tuned photo correction algorithms.\n-Has a Batch Processor with the luxury of Undo Capabilities!\n-Supports Layers and Selections\n-Hundreds of quality filters and thousands of options\n-Provides many options to save and export files (optimized size and preview for all formats)\n-Offers a very comfortable picture browser with extended capabilities.\n-Offers many extras, like a web-album builder\n\nNew Version\n\nWith so many new features and improvements, this version comes as a actual milestone, it is almost a major update. But we decided that our faithful customers shall have it for free, that's why it is still offered as minor update.\n\nVersion 6.5 solves some issue with the graphic tablet pressure sensitivity, and with some photoshop plugins (such as Topaz-Labs plugins), and it is faster and much more powerful and creative.\nWe added dozens new filters and also new automatic and manual corrections.\n\nSystem Requirements:\n\nMicrosoft Windows 7 (32-bit or 64-bit editions), Vista, XP, or 98\n1 GHz processor or better\n640 Mb of RAM\n1 GB of free disk space\nMinimum screen resolution: 800 x 600 (highly recommended higher resolution)\n\nHomepage: http://www.nwspro.com/\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given name/key.\n- Done, Enjoy. \n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:8292f614c1543149369fb9dd7cc0df33449aa7a8","amp;dn":"Focus+Photoeditor+v6.5.3+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8292f614c1543149369fb9dd7cc0df33449aa7a8","infoHashBuffer":{"type":"Buffer","data":[130,146,246,20,193,84,49,73,54,159,185,221,124,192,223,51,68,154,167,168]},"announce":[],"urlList":[]}}