{"title":"Discovery Times - Ruby Ridge (2000)","uid":3724860,"size":384343937,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:82b09a6fff07a8916bda7627ef5a95e323c2b19f&amp;dn=Discovery+Times+-+Ruby+Ridge+%282000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"grinreaper_CCE","files":2,"time":1182878740,"description":"Weaver&amp;#039;s Last StandThe Discovery Times Channel investigates Ruby Ridge.\nBy Virginia Heffernan\nPosted Thursday, April 24, 2003, at 8:18 PM ET\n\nEight minutes into Ruby Ridge: Anatomy of a Tragedy (Discovery Times Channel), the voice-over explains why Randall Weaver, who was charged with manufacturing, possessing, and selling illegal firearms in 1990, decided, with Vicki, his wife, to skip his court date. &quot;With their paranoid fears now seemingly proving true,&quot; the narrator says, &quot;the Weavers decide that rather than facing their destiny in court, their only option is to stay on the mountain.&quot;\n\nThe split-the-difference phrase &quot;paranoid fears now seemingly proving true&quot; is the documentary&amp;#039;s way of sidestepping the most incendiary themes associated with the 1992 stakeout and killings at Ruby Ridge, a bluff near Naples, Idaho. These themes are left out in favor of a well-rendered and fairly strict?though perhaps not universally accepted?chronology of events. But if you&amp;#039;re wondering whether right-wing survivalists are paranoid or if the government is out to get them, you won&amp;#039;t find an answer here. Both are true, timorously concludes Ruby Ridge?at least in this one appalling case.\n\nIt&amp;#039;s true that Weaver, who moved his family from Iowa to Idaho so they could home-school the children, opposed a &quot;New World Order&quot;?along with desegregation and what he called the &quot;Babylonian Occupied Government&quot;?but there&amp;#039;s nothing illegal in that. The real problem at Ruby Ridge was that, in the &amp;#039;80s and early &amp;#039;90s, the feds were themselves on high alert, if not paranoid, about domestic terrorism by white-power groups in the Northwest. In an effort to infiltrate the groups, they sent a paid informant to pose as a biker at Aryan Nations meetings. The informant courted Weaver for four years and ultimately induced him to saw off the barrels from two shotguns?cutting precisely where he indicated?and then sell him the non-standard guns.\n\nThe Bureau of Alcohol, Tobacco, and Firearms quickly descended, offering not to prosecute Weaver on the firearm charges if he would agree to act as a snitch. When he declined, he was indicted. Two officers posed as tourists with a stalled car; when Weaver went to help them, they arrested him. Once he was out on bond, a part-time federal magistrate &quot;mistakenly&quot; told Weaver that they&amp;#039;d take his family&amp;#039;s house if he was found guilty. Under that threat, and after years of trickery by the institutions he least trusted, Weaver found his paranoid fears now seemingly proving true.\n\nFor a year, the Weavers holed up on the hill, where they were left to themselves; Vicki Weaver, who had three children, even gave birth to a fourth child. Then, in 1992, prompted by a newspaper story that made the bail-jumping Weaver seem like a folk hero, the U.S. Marshals Service got back on the case. They launched &quot;Operation Northern Exposure,&quot; an overblown surveillance operation using solar-powered cameras. All of the Weavers then began to carry shotguns for protection.\n\nFinally, on Aug. 21, 1992, six armed marshals hiked up the Weavers&amp;#039; hill, scouting for reasons to arrest Weaver. They watched the house for eight hours, until the Weavers&amp;#039; dog barked at a rustle in the trees. Thinking they had a mountain lion or bear, Randy dispatched his 14-year-old son, Sam, along with a family friend, Kevin Harris, to follow the dog. Sam and Harris, however, soon encountered the marshals and, in an ensuing shootout, a marshal was killed and so was Sam Weaver. One of the other marshals got to a telephone and dialed 911. On the phone, he claimed erroneously that three officers were &quot;pinned down&quot; by gunfire, when in fact they were free and off the mountain.\n\nAt this, word went to Washington, where the FBI sent in their snipers, the Hostage Rescue Team. On the plane to Idaho, the federal agents took the unprecedented step of drafting their own rules of engagement, instructing the snipers that they &quot;can and should&quot; use deadly force against any adult male with a weapon (usually an officer has to be in immediate danger before deadly force is allowed). Tanks rolled in to Naples. The residents were enraged. &quot;Whatever it is,&quot; one said at the time, &quot;both sides are wrong. This is crazy. Come on, get a grip, people!&quot;\n\nThough no shots had been fired on the mountain for 24 hours, the improvised (and unconstitutional) rules of engagement were unaccountably left in place. Snipers encircled the Weavers&amp;#039; cabin, going so far as to station a clawed robot with a shotgun not far from the Weavers&amp;#039; door (&quot;an oversight,&quot; says Gene Glenn, the FBI special agent in charge at the time). When Weaver and Harris came out of the house, one of the snipers shot Weaver in the arm. As Harris ran back to the cabin, another shot Vicki, who had her new baby in her arms, dead; the bullet passed through her and injured Harris as well. &quot;We were dead meat. They were just murdering us now,&quot; Weaver says. Weaver made it back to the cabin, and the hostage team started threatening: Come out or we&amp;#039;ll mow your house down.\n\nAbout a week into the siege, the marshals discovered both Sam&amp;#039;s body and the suspicious absence of evidence of a &quot;pin down.&quot; Chagrined, they enlisted Bo Gritz, a right-wing retired Army colonel and MIA activist, to approach Weaver. Gritz spoke to Weaver and returned to the town, informing news reporters of Vicki&amp;#039;s death. In curious phrasing, former FBI agent Glenn now says, &quot;It never crossed my mind that she was anything but an active person in the cabin up there.&quot;\n\nAfter a few more days of negotiation, the removal of the bodies, and the surrender of Harris, who was suffering with a bad bullet wound, the remaining Weavers surrendered. The siege had lasted 11 days. Weaver was taken to jail in Boise; after a three-month trial he was found guilty of nothing but the original failure-to-appear charge, for which he served an additional six months. In 1994, the Weavers filed a civil suit against the U.S. government, which the government settled for $3.1 million.\n\nThough Ruby Ridge relies on standard documentary scare gimmicks?music like a heartbeat, eerie shots of props, like a rocking chair?the Discovery Times Channel pulls off its treatment of the highly charged event, the significance of which many news outlets underestimated at the time. They do well to rehearse the bare facts of the case at this remove; for years, legends have been growing around the case, and Ruby Ridge is an attempt to set the record straight.\n\nThe documentary&amp;#039;s chief asset is its long interviews at Ruby Ridge with Weaver and his daughter Rachel. Weaver is no longer the skinny, defiant convict of 1992 newsreels; he&amp;#039;s now a silver-haired widower who looks a little like a clean-shaven Charles Bronson. Rachel Weaver is a sweet-looking and well-spoken teenage girl who remembers both her late brother and her early childhood with fondness. In explanation of the 1992 hold-out, Rachel says, &quot;It wasn&amp;#039;t just Dad. It was our whole family. And we didn&amp;#039;t want to go down because we figured they&amp;#039;d put him in jail for, you know, sawn-off shotguns and we&amp;#039;d rather, you know, stay on the mountain and live with our family, you know, happily than have it be torn apart. I guess that backfired.&quot;\n &lt;a href=&quot;\nhttp://www.slate.com/id/2082028/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.slate.com/id/2082028/&lt;/a&gt;\n\nTech Specs:\n\nGeneral #0 \nFileSize/String : 367 MiB \nFormat/String : DivX \nOveralBitRate/String : 1139 Kbps \nPlayTime/String : 44mn 58s \n\nVideo #0 \nCodec/String : DivX 5 \nCodec/Info : DivX 5.0 \nBitRate/String : 998 Kbps \nWidth : 640 \nHeight : 480 \nAspectRatio/String : 4/3 \nFrameRate/String : 30 fps \nBits/(Pixel*Frame) : 0.108 \n\nAudio #0 \nCodec/String : MPEG1/2 L3 \nCodec/Info : MPEG1 or 2 Audio Layer 3 \nBitRate/String : 128 Kbps \nChannel(s)/String : 2 channels \nSamplingRate/String : 44 KHz \n\n===============================================================================\nLearn the true nature of the world, come visit our huge dedicated e-library and forums @ &lt;a href=&quot;\nhttp://conspiracycentral.net:6969/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.net:6969/index.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://conspiracycentral.info/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.info/index.php&lt;/a&gt;\n===============================================================================","torrent":{"xt":"urn:btih:82b09a6fff07a8916bda7627ef5a95e323c2b19f","amp;dn":"Discovery+Times+-+Ruby+Ridge+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82b09a6fff07a8916bda7627ef5a95e323c2b19f","infoHashBuffer":{"type":"Buffer","data":[130,176,154,111,255,7,168,145,107,218,118,39,239,90,149,227,35,194,177,159]},"announce":[],"urlList":[]}}