{"title":"The Awakening (1998) XXX Classic DVDRip","uid":11826242,"size":653856777,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:82f678618363e37705ab7ba763a4d138cb26abc1&amp;dn=The+Awakening+%281998%29+XXX+Classic+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"B01010000","files":2,"time":1429506307,"description":"        ...::TORRENT NAME::...\nThe Awakening (1998) XXX Classic DVDRip\n\n         ...::POSTER::... &lt;a href=&quot;\nhttp://adsreserve.com/?v=kMZm5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://adsreserve.com/?v=kMZm5.jpg&lt;/a&gt;\n\n       ...::SCREENSHOTS::... &lt;a href=&quot;\nhttp://adsreserve.com/?v=2VUDG.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://adsreserve.com/?v=2VUDG.jpg&lt;/a&gt;\n\n        ...::DESCRIPTION::...\nStudio: Vivid\nDirector: Paul Thomas\nApproximate Running Time: 01:40:20\nReleased: 1998\n\n\ncast\n\nKimberlee, Ginger Paige, Bobbie Barren, Inari Vachs, Kobe Tai, Lola, Taylor St. Claire, Wendy Divine, Renee LaRue, Dasha, Chennin Blanc, Regan Starr, Tex, Chris Cannon, Evan Stone, Michael J. Cox, Julian, Bobby Vitale, Tyce Bune, Ted Shred and Ava Steele.\n\n   She was a porn star and then she wasn't. She was a dancer and then she wasn't. She was a celibate and then she wasn't. Paul Thomas presents a true story of the fragility of sexuality, and how one woman found herself under the bright lights of blue cinema. Awaken to the Awakening!\n\n   This is a modern masterpiece, and has been cited as such by AVN with a pair of perfect 10 ratings. Based on the true story of a porn starlet who turned to new age religion before eventually committing suicide, Awakening stars Inari Vachs in the role of her career as the starlet whose inner demons drive her to the depths of despair and beyond. Kobe Tai is also breathtaking as her ex-junkie musician friend. Bobby Vitale is the tie that binds them. The sex throughout this Paul Thomas insta-classic is phenomenal and thoroughly nasty on all counts.\n\n\n\nThe action is very basic in this film, most scenes feature one guy fucking a girl (oral, vaginal and anal sex in various positions). One scene features a foursome with three girls and one guy, one of the girls gets fucked by a strapon). One scene features lesbian action between to girls, including anal. There is also a scene where a girl gets fucked by a guy in front of a group of other people. One scene has a girl sucking off a guy to completion just to fuck another straight afterwards. Ohh, and lets not forget the scene where a guy fucks a girl anally in doggy style while she has her head down a toilet","torrent":{"xt":"urn:btih:82f678618363e37705ab7ba763a4d138cb26abc1","amp;dn":"The+Awakening+%281998%29+XXX+Classic+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82f678618363e37705ab7ba763a4d138cb26abc1","infoHashBuffer":{"type":"Buffer","data":[130,246,120,97,131,99,227,119,5,171,123,167,99,164,209,56,203,38,171,193]},"announce":[],"urlList":[]}}