{"title":"EnigmaT Set Rips { Cuts } - November 15th, 2013","uid":9197376,"size":429030568,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:834aaeec50dd18845c53ce1f5cea1242b8b82ce2&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+November+15th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":54,"time":1384515650,"description":"A.R.D.I. &amp; Allam - Supernatural (Original Mix) (Cut From Romel Set)-enTc.mp3\nAlexandre Bergheau - Call Me Up (ASOT 639 Rip)-enTc.mp3\nArmin van Buuren - Save My Night (ASOT 639 Rip)-enTc.mp3\nArmin van Buuren feat. Aruna - Won't Let You Go (Ian Standerwick Remix) (ASOT 639 Rip)-enTc.mp3\nArmin van Buuren feat. Cindy Alma - Don't Want To Fight Love Away (ASOT 639 Rip)-enTc.mp3\nArmin van Buuren feat. Richard Bedford - Love Never Came (The Blizzard Remix) (ASOT 639 Rip)-enTc.mp3\nAura Qualic - Sunset of Y'sdeni (Original Mix) (Cut From Romel Set)-enTc.mp3\nAustin Leeds - My Fkn Name (Cut From Wizz Set)-enTc.mp3\nAYDA - Resurrection (ASOT 639 Rip)-enTc.mp3\nBrutal Kids feat. Aline Fly - Stones (Biotones Remix) (Cut From Ruben Set)-enTc.mp3\nBurak &amp; Emre - Tonight (Original Mix) (Cut From Misja Set)-enTc.mp3\nCiro Visone - Outworld (Original Mix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nDada Life - Higher State Of Dada Land (Cut From Claessen Set)-enTc.mp3\nDousk - Look Good Tonight (Soulwork Remix) (Cut From Ruben Set)-enTc.mp3\nEminence &amp; Johann Stone - Volcano (ASOT 639 Rip)-enTc.mp3\nEstigma - Nymeria (Ion Blue Remix) (Cut From Jerom Set)-enTc.mp3\nEximinds - Good Morning (-Short- ASOT 639 Rip)-enTc.mp3\nFaruk Sabanci - Nevada (Jordan Suckley Dub) (Cut From PvD Set)-enTc.mp3\nFawn vs. Digital Sixable - Where Has Your Love Gone (Blood Groove &amp; Kikis Remix) (-Short- Cut From Ruben Set)-enTc.mp3\nFerry Corsten feat. Jenny Wahlstrom - Many Ways (Will Atkinson Remix) (ASOT 639 Rip)-enTc.mp3\nFoster The People - Call It What You Want (East &amp; Young Bootleg) (Cut From Claessen Set)-enTc.mp3\nFuzzy &amp; Simon Moon - Lost (Cosmic Heaven Remix) (Cut From Above Clouds Set)-enTc.mp3\nGregory Esayan - Evening Flight (James Woods Remix) (Cut From Ruben Set)-enTc.mp3\nGrooveyard - Mary Go Wild (Roul and Doors Bootleg) (Cut From Claessen Set)-enTc.mp3\nGTA - Back To The Megatroll (GTA &amp; Astronomar Edit) (Cut From Claessen Set)-enTc.mp3\nIchikai - Rebellion (tranzLift Remix) (Cut From Above Clouds Set)-enTc.mp3\nIkerya Project - Lovely November (Original Mix) (Cut From Romel Set)-enTc.mp3\nJohn Newman - Love Me Again (Art Inc Bootleg) (Cut From Claessen Set)-enTc.mp3\nKarl Smith - Peaktime (McRae Remix) (Cut From Above Clouds Set)-enTc.mp3\nLange &amp; Betsie Larkin - Insatiable (Album Mix) (Cut From Lange Set)-enTc.mp3\nLange &amp; Cate Kanell - Fireflies (Under The Moon Mix) (Cut From Lange Set)-enTc.mp3\nLange &amp; Shannon Hurley - Superstars (Album Mix) (Cut From Lange Set)-enTc.mp3\nLange - A Different Shade Of Crazy (We Are All Mix) (Cut From Lange Set)-enTc.mp3\nLange featuring Ilseviolin - Violin's Revenge (Light Mix) (GDJB Rip)-enTc.mp3\nLee Miller - Atlantic Island (ASOT 639 Rip)-enTc.mp3\nMajai - Code (Cut From Ruben Set)-enTc.mp3\nMarkus Schulz featuring Jaren - Carry On (Solis &amp; Sean Truby Remix) (GDJB Rip)-enTc.mp3\nMichael Flint - Come Together (Alexandre Bergheau Remix) (Cut From Misja Set)-enTc.mp3\nMike Lockin &amp; Mart De Schmidt - Epicode (Original Mix) (Cut From PvD Set)-enTc.mp3\nMiley Cyrus - Wrecking Ball (Halfway House Reset) (Cut From Claessen Set)-enTc.mp3\nMimax - Liberty Heights (Cut From Ruben Set)-enTc.mp3\nMistol Team - Dynamo Love (Ivan Lu Remix) (GDJB Rip)-enTc.mp3\nMylo - Drop The Pressure (Dada Life Guerilla Fart #13) (Cut From Claessen Set)-enTc.mp3\nOrbion - Once In A Lifetime (Original Mix) (Cut From Misja Set)-enTc.mp3\nPhase Difference - Utopia (Meridian Remix) (GDJB Rip)-enTc.mp3\nProgresia feat. Linnea Schossow - Fire Fire Fire (Juventa Remix) (Cut From Schossow Set)-enTc.mp3\nProject 8 - Enigma (James Williams Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nSean Matthews - Crossroads (ASOT 639 Rip)-enTc.mp3\nSean Tyas - Now You See (ASOT 639 Rip)-enTc.mp3\nSharam &amp; Anousheh - On &amp; On (Cash Cash &amp; Gazzo Dub) (Cut From Wizz Set)-enTc.mp3\nSunset &amp; Alpha Force feat. Robin Vane - With You (ASOT 639 Rip)-enTc.mp3\nTakaki Matsuda - Blackhole (Cut From Ruben Set)-enTc.mp3\nTritonal feat. Phoebe Ryan - Now or Never (Pierce Fulton Remix) (Cut From Schossow Set)-enTc.mp3\nVirtue - Outer Reaches (Moxa Remix) (Cut From Jerom Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:834aaeec50dd18845c53ce1f5cea1242b8b82ce2","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+November+15th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"834aaeec50dd18845c53ce1f5cea1242b8b82ce2","infoHashBuffer":{"type":"Buffer","data":[131,74,174,236,80,221,24,132,92,83,206,31,92,234,18,66,184,184,44,226]},"announce":[],"urlList":[]}}