{"title":"Story of a Soul: The Autobiography of St. Therese of Lisieux","uid":15616836,"size":202955365,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:84a38feb085319db220dff62f61f506f59ecbd16&amp;dn=Story+of+a+Soul%3A+The+Autobiography+of+St.+Therese+of+Lisieux&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"catholicstuff","files":7,"time":1471835604,"description":"Story of a Soul: The Autobiography of St. Thérèse of Lisieux [unabridged audiobook + ebook]\r\n\r\n\r\nTwo and a half years before her death in 1897 at the age of 24, as Thérèse Martin began writing down her childhood memories at the request of her blood sisters in the Lisieux Carmel, few could have guessed the eventual outcome. Yet this Story of my soul, first published in 1898 in a highly edited version, quickly became a modern spiritual classic, read by millions and translated into dozens of languages around the world.\r\n\r\nDecades later, in response to growing requests from scholars and devotees of the Saint, a facsimile edition of the manuscripts appeared, along with more popular French editions of what the Saint had actually written. Here, expressed with all of Thérèse's original spontaneity and fervor, we rediscover the great themes of her spirituality: confidence and love, the little way, abandonment to God's merciful love, and her mission in the church and world today.\r\n\r\nFather John Clarke's acclaimed translation, first published in 1975 and now accepted as the standard throughout the English-speaking world, is a faithful and unaffected rendering of Thérèse's own words, from the original manuscripts. This new edition, prepared for the centenary of the Saint's death, includes a select bibliography of recent works in English on Thérèse, along with a new referencing system now widely used in studies of her doctrine.\r\n\r\n\r\nPlease seed!\r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.se/user/catholicstuff/\r\n\r\n\r\nIf you enjoy this media, please purchase a physical copy to support the producers and share with family and friends","torrent":{"xt":"urn:btih:84a38feb085319db220dff62f61f506f59ecbd16","amp;dn":"Story+of+a+Soul%3A+The+Autobiography+of+St.+Therese+of+Lisieux","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84a38feb085319db220dff62f61f506f59ecbd16","infoHashBuffer":{"type":"Buffer","data":[132,163,143,235,8,83,25,219,34,13,255,98,246,31,80,111,89,236,189,22]},"announce":[],"urlList":[]}}