{"title":"BitComet 1.36 Latest Stable Release","uid":8492860,"size":9499280,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:84f36d63b5e9f47a09627e23d7338ade4cbe58b9&amp;dn=BitComet+1.36+Latest+Stable+Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KurdTM","files":-1,"time":1369050943,"description":"\n\n\nWHY CHOOSE BITCOMET?\nBitTorrent Download\nfast and powerful\nLong-Term Seeding: Speed up downloading and revive dead torrents\nTorrent Share: Exchange torrent while downloading\nMagnet URI: Start BitTorrent download without .torrent file any more, using DHT network.\nPreview while Downloading: Preview of .avi .rmvb .wmv and other video files is available during downloading process.\nCross Protocol Downloading: Benefit from HTTP/FTP/eMule download sources while BitTorrent downloading.\nAlign File to Piece Boundary: Better for making torrent, fully compatible with old versions.\nIntelligent Connection Optimization: Configuration is automatically set to match your connection type.\nIntelligent Disk Cache: Memory cache is used to reduce the read/write frequency of your hard drive, increasing device life.\nIntelligent Disk Allocation: Reduce disk fragmentation.\nDHT network: Start BitTorrent download without connecting to any tracker.\nAuto Config ICF (Internet Connection Firewall) and ICS (Internet Connection Sharing) in Windows.\nAuto Config UPNP port mapping in router (UPnP support is required in router).\nDisabling or Setting Priority of files in torrent: Files can be skipped for downloading, or set to higher / lower priority, allowing you to select which file finish first.\nAlso support Multi-tracker, DHT, utf-8 extension, and UDP tracker Protocol v2.\nHTTP/FTP Download\nInnovative P2P Technology\nP2P downloading: BitTorrent technology is integrated into HTTP/FTP download, with which BitComet automatically finds other clients and gets data from them to increase your download speedï¼Œwithout additional bandwidth usage of the HTTP server.\nIntelligent File Rename: Automatic choose the best name for your download file.\nPreview while Downloading: Preview of avi, rmvb, wmv and other video files is available during downloading process.\nQuick Resume: Stopped download tasks can be resumed from where they left off from both HTTP and FTP servers.\nMulti-Mirror download: Mirror servers are automatically found for the file being downloaded. Data from these servers are downloaded at the same time to increase download speed 300% or more.\nMulti-Section download: Files are split into several sections which are downloaded at the same time to increase the download speed up to 500% or more.\nMulti-Language Support: Multi-language web pages and encoded URLs can be correctly handled.\nDownload Management\nCustomization Available\nGlobal and Per-Task Speed Limit, for Both Upload and Download.\nAdd tags to task, categorize tasks on the fly.\nBandwidth Scheduler and Automatic Shutdown.\nEasy to Use and Free!\nUser-friendly and very easy-to-use, we try to hide every complicated terms behind the interface\nBitComet does not contain any adware or spyware.\nHow to support us?\nSupport\nHelp Wiki: &lt;a href=&quot;\nhttp://wiki.bitcomet.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wiki.bitcomet.com/&lt;/a&gt;\nSupport Forum: &lt;a href=&quot;\nhttp://www.cometforums.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cometforums.com/&lt;/a&gt;\n\n\n\n\n\nv1.36 2013.5.2\nGUI Bugfix: program crash occasionally when delete task\nCore Improve: support Firefox 20","torrent":{"xt":"urn:btih:84f36d63b5e9f47a09627e23d7338ade4cbe58b9","amp;dn":"BitComet+1.36+Latest+Stable+Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84f36d63b5e9f47a09627e23d7338ade4cbe58b9","infoHashBuffer":{"type":"Buffer","data":[132,243,109,99,181,233,244,122,9,98,126,35,215,51,138,222,76,190,88,185]},"announce":[],"urlList":[]}}