{"title":"Napoleon XIV - They're coming to take me away Ha-Haaa! (1966)","uid":4709694,"size":25543069,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8528f7b7333a3f5a3440da2d1a01be34312a2768&amp;dn=Napoleon+XIV+-+They%5C%27re+coming+to+take+me+away+Ha-Haaa%21+%281966%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":15,"time":1233969514,"description":"Napoleon XIV - They're coming to take me away Ha-Haaa! (1966)\nMP3 128 kbit/s\n\nNapoleon XIV was the pseudonym of American singer-songwriter and record producer Jerry Samuels (born 1938, New York), who achieved one-hit wonder status with the Top 5 hit novelty song &quot;They're Coming to Take Me Away Ha-Haaa!&quot; in 1966.\n\nIn 1966, Samuels concocted &quot;They're Coming to Take Me Away Ha-Haaa!&quot;. The public found out the true identity when Cousin Brucie of WABC in New York outed him.The record quickly climbed the charts, reaching #1 nationally just one week after its release but fell from the charts almost as quickly after stations stopped playing it in the wake of protests from advocacy groups for the mentally ill.Napoleon XIV continued to release music after the success of his one hit, including a Warner Bros. album of the same name in 1966 (reissued by Rhino in 1985), most of which continued with the mental illness theme (for example: &quot;Bats In My Belfry&quot;; and &quot;Split Level Head,&quot; which features different vocal parts in each stereo speaker). While he did not achieve any further mainstream success, based upon the relatively recent cover versions of his hit song (see:&quot;They're Coming To Take Me Away, Ha-Haaa!&quot;), Napoleon XIV has remained a cult favorite to this day.\n\nReleased on Warner Bros. Records, the bizarre depiction of mental illness became an instant hit in the United States that summer, reaching number 3 on the Billboard Hot 100 pop singles chart.However, it was highly controversial at the time. Some groups protested the apparent mockery of mental illness, while other groups attacked the apparent comparison of Napoleon's wife to a &quot;mangy mutt&quot;. The protesters put pressure both on radio stations directly and on the stations' advertisers. This was especially felt in New York City, where Top 40 stalwarts WABC and WMCA soon dropped the record from airplay and skipped it during their countdown shows, much to the confusion of the young teens who made up a large part of those broadcasters' audience. The record was soon banned from airplay as BMI took the unprecedented step of withdrawing its certification. By the time it had been recertified by SESAC, it had all but disappeared from the Billboard Top 40 playlist.The record was also a success in United Kingdom, reaching number 4 on the UK Singles Chart\n\nTracklist:\n01_I'm in Love With My Little Red Tricycle\n02_Photogenic, Schizophrenic You\n03_Marching off to Bedlam\n04_Doin' the Napoleon\n05_Let's Cuddle up in My Security Blanket\n06_They're Coming to Take Me Away, Ha-Haaa!\n07_Bats in My Belfry\n08_Dr. Psyche, the Cut-Rate Head-Shrinker\n09_I Live in a Split Level Head\n10_Nuts on My Family Tree\n11_Place Where the Nuts Hung the Squirrels\n12_I'm Happy They Took You Away, Ha-Haaa! (By Josephine XV) \nRunning time: 25:18 min\n","torrent":{"xt":"urn:btih:8528f7b7333a3f5a3440da2d1a01be34312a2768","amp;dn":"Napoleon+XIV+-+They%5C%27re+coming+to+take+me+away+Ha-Haaa%21+%281966%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8528f7b7333a3f5a3440da2d1a01be34312a2768","infoHashBuffer":{"type":"Buffer","data":[133,40,247,183,51,58,63,90,52,64,218,45,26,1,190,52,49,42,39,104]},"announce":[],"urlList":[]}}