{"title":"The Grand Illusion Love, Lies, and My Life with Styx - Chuck Pan","uid":8749886,"size":774689,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:869b4bc9395a79aecd5ea4472b32172db45f78d3&amp;dn=The+Grand+Illusion+Love%2C+Lies%2C+and+My+Life+with+Styx+-+Chuck+Pan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Enkhsaikhan","files":-1,"time":1375004853,"description":"They are still one of the biggest rock bands of the last three decades. With four consecutive triple-platinum albums and 54 million records sold, their tours continue to sell out and classic songs like 'Lady,' 'Renegade,' 'Come Sail Away,' and 'The Grand Illusion' have earned them a whole new generation of fans. At the height of their fame, they were living the ultimate rock 'n' roll fantasy - an odyssey of groupies, drugs, and music that most musicians only dream of. As a band, Styx seemed invincible. But their founding member and bass player, Chuck Panozzo, was about to hit rock bottom. His seemingly debauched life as the ultimate rocker was a lie - and the truth was about to catch up with him.&quot;The Grand Illusion&quot; is a no-holds-barred, backstage pass to the journey of one of the world's most revered bands, and the true story of Chuck Panozzo's 50-year struggle to reconcile his public life as a rock star with his private life as a gay man. Beginning with the birth of Styx in Chicago and their meteoric rise, &quot;The Grand Illusion&quot; is a revealing look at the triumphs and tragedies that surrounded Panozzo's life. He chronicles life on the road, the break-up of the band, his struggle to help his twin brother and bandmate John Panozzo battle addiction, as well as his split with Dennis De Young, and finally coming to terms with his HIV positive status. Illuminating and unflinching, &quot;The Grand Illusion&quot; will captivate the band's legions of devoted fans, as well as music lovers everywhere. ","torrent":{"xt":"urn:btih:869b4bc9395a79aecd5ea4472b32172db45f78d3","amp;dn":"The+Grand+Illusion+Love%2C+Lies%2C+and+My+Life+with+Styx+-+Chuck+Pan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"869b4bc9395a79aecd5ea4472b32172db45f78d3","infoHashBuffer":{"type":"Buffer","data":[134,155,75,201,57,90,121,174,205,94,164,71,43,50,23,45,180,95,120,211]},"announce":[],"urlList":[]}}