{"title":"Ted Dekker - Adem - Blink of an Eye, Epub, Mobi, KK","uid":7204160,"size":4284299,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:87937bd17d1bb509748df1b4e9e8642cc0000f5f&amp;dn=Ted+Dekker+-+Adem+-+Blink+of+an+Eye%2C+Epub%2C+Mobi%2C+KK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"karaokeking123","files":-1,"time":1335037666,"description":"Ted Dekker - Adam - Blink of an Eye\n\n\nNew York Times best-selling author Ted Dekker unleashes his most riveting novel yet . . . an elusive serial killer whose victims die of unknown causes and the psychologist obsessed with catching him.\n \nFBI behavioral psychologist Daniel Clark has been made famous by his arguments that religion is one of society's greatest antagonists. What Daniel doesn't know is that his obsessive pursuit of a serial killer known only as &quot;Eve&quot; will end in his own death at Eve's hand. Twenty minutes later Daniel is resuscitated, only to be haunted by those twenty missing minutes of life.\n \nIt soon becomes painfully clear that the only way to stop Eve is to recover those missing minutes by dying . . . again. What isn't nearly as clear is just how many times he will have to die to discover the truth, not only about Eve, but about himself. Daniel will have to face haunting realities about demon possession in the modern world-and reevaluate his prejudice against religion-to stop Eve.\n \n&quot;As always with a Ted Dekker thriller, the detail is stunning, pointing to meticulous research in a raft of areas: police and FBI methods, forensic medicine, psychological profiling-in short, all that accompanies a Federal hunt for a serial killer. But Dekker fully reveals his magic in the latter part of the book, when he subtly introduces his darker and more frightening theme. It's all too creepily convincing. We have to keep telling ourselves that this is fiction. At the same time, we can't help thinking that not only could it happen, but that it will happen if we're not careful.&quot; \n\n\nTed Dekker-Blink of an Eye\n\n\nSeth Borders has one of the world's highest IQs. Now he's suddenly struck by an incredible power, the ability to see multiple potential futures. Then Seth stumbles upon Miriam, a beautiful Saudi Arabian princess who has fled her veiled existence to escape a forced marriage. Cultures collide as Seth and Miriam are thrown together and forced to run from forces determined to kidnap or kill Miriam. An intoxicating tale set amidst the shifting sands of the Middle East and the back roads of America, Blink engages issues as ancient as the earth itself . . . and as current as today's headlines.\n \n\n\nEnjoy!","torrent":{"xt":"urn:btih:87937bd17d1bb509748df1b4e9e8642cc0000f5f","amp;dn":"Ted+Dekker+-+Adem+-+Blink+of+an+Eye%2C+Epub%2C+Mobi%2C+KK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87937bd17d1bb509748df1b4e9e8642cc0000f5f","infoHashBuffer":{"type":"Buffer","data":[135,147,123,209,125,27,181,9,116,141,241,180,233,232,100,44,192,0,15,95]},"announce":[],"urlList":[]}}