{"title":"Darwin's Ghost - The Origin of the Species Updated - Steve Jones","uid":14265408,"size":4148304,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8799235d2b0f11f29436c04f2aa6c08acbed5193&amp;dn=Darwin%27s+Ghost+-+The+Origin+of+the+Species+Updated+-+Steve+Jones&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pahly","files":1,"time":1460255002,"description":"&quot;There are few better or more entertaining accounts of the evolutionary process in print today than Darwin's Ghost.&quot;\r\n—The New York Times Book Review\r\n\r\nCharles Darwin's The Origin of Species is probably the best-known, least-read book. One of the most important achievements of the past millennium, it did for biology what Galileo did for astronomy: made it into a single science rather than a collection of unrelated facts. Important though Origin remains, its examples and intricate Victorian prose are now a century and a half old. They are ripe for renewal and reaffirmation. Writing as &quot;Darwin's ghost,&quot; eminent geneticist Steve Jones updates this seminal work—and restates evolution's case for the 21st century.\r\n\r\nJones is a writer of engaging wit and dazzling erudition and has been called &quot;the British Carl Sagan.&quot; Using modern examples—the AIDS virus, the puzzles of sexual selection, the physiology and psychology of pets, and the unparalleled genetic success of our own species—he shows the power and immediacy of Darwin's great argument and makes us appreciate how it makes life make sense. Eye-opening and entertaining, filled with astonishing facts, amusing anecdotes, and the very latest research, Darwin's Ghost is contemporary science writing at its very best","torrent":{"xt":"urn:btih:8799235d2b0f11f29436c04f2aa6c08acbed5193","amp;dn":"Darwin%27s+Ghost+-+The+Origin+of+the+Species+Updated+-+Steve+Jones","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8799235d2b0f11f29436c04f2aa6c08acbed5193","infoHashBuffer":{"type":"Buffer","data":[135,153,35,93,43,15,17,242,148,54,192,79,42,166,192,138,203,237,81,147]},"announce":[],"urlList":[]}}