{"title":"Morecambe &amp; Wise - Audio Comedy - MP3 - Slimoo","uid":5534012,"size":307698616,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:87cf46c178d3f23cb027625655c13b0f72f49311&amp;dn=Morecambe+%26+Wise+-+Audio+Comedy+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Slimoo_","files":10,"time":1273010154,"description":"Morecambe and Wise: The Garage Tapes - Audio Comedy - BBC7 via DVB-T\n1 x 45 minutes - 128Kbps - Mp3 - Slimoo\n\n\nJon Culshaw uncovers an extraordinary audio archive of early Morecambe and Wise material, including a number of long lost tapes.\n\nThis is a genuine archive find of real importance. A few years ago, Doreen Wise, widow of Ernie, cleared the old family garage of piles of tapes and 78 recordings.\n\nAt the end of last year, Independent radio company Whistledown were contacted by Eric and Ernie's agents, and producer David Prest offered to look at the material.\n\n&quot;It was an extraordinary sight - a couple of old fruit boxes full of reel to reel tapes and a musty old red suitcase brimming with 78 records,&quot; says producer David Prest.\n\nThe most important finds are a number of long-lost episodes of Eric and Ernie's first radio show, &quot;You're Only Young Once&quot; which was made for the BBC between November 1953 and June 1954.\n\nThese feature songs, sketches, their trade mark banter and guest cameo appearances from other well-known perfomers including Bob Monkhouse.\n\nThe tapes in Ernie's garage are believed to be &quot;run off&quot; copies recorded at 33/4 ips by studio engineers immediately after the recordings, and probably never played since, as well as acetate copies which Doreen paid the studio engineer a few shillings for.\n\n&quot;Much of the value of the material is in what it shows about their comedy development. The early radio series are very naturalistic, and feature historical sketches and songs which precede the 1970s BBC TV shows by almost 15 years&quot;, says David.\n\nOther treats include: Andre Previn's speech to Eric and Ernie at a Variety Club lunch in 1974, rare recordings of their Great Yarmouth and Blackpool shows from the mid-late sixties.\n\nAlso included are many original master tapes of songs, written for the duo, which show their skill in the recording studio.\n\n\nMorecambe and Wise: The Garage Tapes\n\n\n++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\nThe Eric Morecambe And Ernie Wise Show - Audio Comedy - BBC7 via DVB-T\n8 x 30 minutes &amp; 1 x 60 minutes - 128Kbps - Mp3 - Slimoo\n\n\nThis is a BBC radio comedy from the 1970s, featuring sketch-based humour from Morecambe and Wise, in a variety format: i.e. including a guest singer.\n\nMost editions also feature one or more actors or show business personalities in the sketches, as the main guest star.\n\n\nHow sad that the 2 biggest stars the BBC have ever had and the BBC have lost most of these radio shows.\n\n\n\n\nCast:\nEric Morecambe\nErnie Wise\nDes O'Connor\nVince Hill\nAnn Hamilton\nMarion Montgomery\nElaine Del Mar\nAnita Harris\nClodagh Rogers\nVincent Zara\n\n\nThe Eric Morecambe And Ernie Wise Show - Christmas Special\n\nThe Eric Morecambe And Ernie Wise Show - S01 - E02 - Selena Jones\n\n \nThe Eric Morecambe And Ernie Wise Show - S02 - E03 - Clodagh Rogers\nThe Eric Morecambe And Ernie Wise Show - S02 - E05 - Nicola Pagett\n\nThe Eric Morecambe And Ernie Wise Show - S03 - E01 - Anita Harris\nThe Eric Morecambe And Ernie Wise Show - S03 - E02 - Des O'Connor\nThe Eric Morecambe And Ernie Wise Show - S03 - E03 - Marion Montgomery\nThe Eric Morecambe And Ernie Wise Show - S03 - E04 - Vince Hill\nThe Eric Morecambe And Ernie Wise Show - S03 - E05 - Penelope Keith\n\n\nAudio Format : MP3\nDuration Approx : 27mn 54s\nBit rate mode : Constant\nBit rate : 128 Kbps \nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\n\n\n\n\n\n\n\n\n[b]\nA number of people are posting my torrents on other trackers.\nI have no problem with that - (Not much need as I already do this) - But a name check would be nice\nI was the one who spent weeks,months,years recording them.\n\nThere is little point in downloading a &quot;Torrent&quot; and then recreating a &quot;Torrent&quot; using the same files.\n\nThe fact there was a torrent for you to download is clear you don't need to use the files to make another exactly the same version,\n\nAll you will do is split seeders over 2 torrents with the &quot;same&quot; files and make both have less seeders.\n\n\n[/b]\n\n.","torrent":{"xt":"urn:btih:87cf46c178d3f23cb027625655c13b0f72f49311","amp;dn":"Morecambe+%26+Wise+-+Audio+Comedy+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87cf46c178d3f23cb027625655c13b0f72f49311","infoHashBuffer":{"type":"Buffer","data":[135,207,70,193,120,211,242,60,176,39,98,86,85,193,59,15,114,244,147,17]},"announce":[],"urlList":[]}}