{"title":"O'Reilly - Mark Bates on Go Core Techniques and Tools","uid":12485948,"size":1392519599,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:88322b5e0e9406420189f4f397f20e427c89df05&amp;dn=O%27Reilly+-+Mark+Bates+on+Go+Core+Techniques+and+Tools&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NepsterJay","files":20,"time":1443103154,"description":"Take the Go programming language for a test drive with this example-driven video course from software architect Mark Bates. You get a detailed introduction to several tools and techniques that lie at the core of this relatively new Google language, including concurrent programming with &quot;go&quot; routines. Mark also demonstrates how to build a command line application, using test-driven development.\r\n\r\nStatically typed with syntax derived from C, this easy-to-learn language includes garbage collection, type safety, and some dynamic-typing capabilities. If you’re an experienced programmer, you’ll have an exciting new language in your toolkit once you complete this video.\r\n\r\n* Learn Go basics such as functions, variables, and loops\r\n* Use the &quot;testing&quot; package in the test-driven development of Go applications\r\n* Manage multiple &quot;go&quot; routines and coordinate the control of a concurrent Go program\r\n* Understand how packages in Go applications are organized\r\n* Build binaries for platforms other than the one you develop with\r\n* Explore error handling, including how to gracefully recover from specific errors\r\n* Use the &quot;expvar&quot; package to expose metrics about Go applications\r\n* Manage dependency versions for your applications with the Godep tool\r\n\r\nMark Bates is the founder and chief architect of the Boston-based consulting company, Meta42 Labs. He's written web applications since 1996; he now spends his days focusing on new application development and consulting for his clients","torrent":{"xt":"urn:btih:88322b5e0e9406420189f4f397f20e427c89df05","amp;dn":"O%27Reilly+-+Mark+Bates+on+Go+Core+Techniques+and+Tools","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88322b5e0e9406420189f4f397f20e427c89df05","infoHashBuffer":{"type":"Buffer","data":[136,50,43,94,14,148,6,66,1,137,244,243,151,242,14,66,124,137,223,5]},"announce":[],"urlList":[]}}