{"title":"The Only Pirate at the Party (2016) by Lindsey Stirling","uid":14471743,"size":33528323,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:883e9db69c72801f8d1bb398d6a73036243ac7b9&amp;dn=The+Only+Pirate+at+the+Party+%282016%29+by+Lindsey+Stirling&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dr.Soc","files":1,"time":1461897442,"description":"The Only Pirate at the Party by Lindsey Stirling &amp; Brooke S. Passey\r\nJanuary 12, 2016 | English | Hardcover: 272 pages | ISBN-10: 1501119109\r\n\r\nDancing electronic violinist Lindsey Stirling shares her unconventional journey in an inspiring memoir filled with the energy, persistence, and humor that have helped her successfully pursue a passion outside the box.\r\n\r\nA classically trained musician gone rogue, Lindsey Stirling is the epitome of independent, millennial-defined success: after being voted off the set of America’s Got Talent, she went on to amass more than ten million social media fans, record two full-length albums, release multiple hits with billions of YouTube views, and to tour sold-out venues across the world.\r\n\r\nLindsey is not afraid to be herself. In fact, it’s her confidence and individuality that have propelled her into the spotlight. But the road hasn’t been easy. After being rejected by talent scouts, music reps, and eventually on national television, Lindsey forged her own path, step by step. Detailing every trial and triumph she has faced until now, Lindsey shares stories of her humble yet charmed childhood, humorous adolescence, life as a struggling musician, personal struggles with anorexia, and finally, success as a world-class entertainer. Lindsey’s magnetizing story—at once remarkable and universal—is a testimony that there is no singular recipe for success, and despite what people may say, sometimes it’s okay to be The Only Pirate at the Party","torrent":{"xt":"urn:btih:883e9db69c72801f8d1bb398d6a73036243ac7b9","amp;dn":"The+Only+Pirate+at+the+Party+%282016%29+by+Lindsey+Stirling","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"883e9db69c72801f8d1bb398d6a73036243ac7b9","infoHashBuffer":{"type":"Buffer","data":[136,62,157,182,156,114,128,31,141,27,179,152,214,167,48,54,36,58,199,185]},"announce":[],"urlList":[]}}