{"title":"Coast to Coast AM January 31 2013","uid":8091709,"size":56792060,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8868106091aa8e5851ec4cb993fafa0dd69c3eca&amp;dn=Coast+to+Coast+AM+January+31+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1359736231,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t01-31-13\nHost: \tGeorge Noory\nGuests: \tLinda Moulton Howe, Misha Glenny\n\nInvestigative reporter Linda Moulton Howe returned to discuss unexplained lights and loud booms that have puzzled residents and authorities all over the US, 'scientific delusions' &amp; morphogenic fields, and how the CIA and intelligence agencies may influence Hollywood films about UFOs and aliens such as Hangar 18.\n\nSince October, strange booms and flashes of light have been witnessed in Warwick and Providence, Rhode Island and Somerset, Massachusetts. By January 9, 2013, a dozen regions across the United States had reported the same phenomenon including booms on January 7-8th in Warrick and Vanderburgh Counties, Indiana. Then on January 8-9th there were repeating booms and extremely bright flashes of light on a clear night in Cedar Hill, Utah, near Provo. One week before, two Cedar Hill residents saw an eerie, silent triangle pattern of pumpkin-orange lights in the night sky near their home. Linda interviewed Cedar Hill witness James Brown and his wife Amy, who described the craft they saw on two occasions, and the loud unexplained rumblings and booms, which sounded as if they were in a war zone at times. More here.\n\nIn her second report, Linda spoke with U.K. biologist and biochemist Rupert Sheldrake, who's concluded that the notion of 'dark matter' is a kind of scientific delusion that's used to try and explain the way that galaxies hang together. Sheldrake is known for his theory of morphic resonance in which the shapes of organisms through time and space evolve under the influence of previous similar organisms in morphic resonance with each other, and he believes this way of thinking could explain the formation of galaxies. He also thinks morphogenic fields and morphic resonance explain telepathic communication between animals and closely bonded humans. Sheldrake is currently overseeing telepathic research in which people can participate by mobile phones. More.\n\nIn July 1980, a Hollywood production company called Sunn Classic Pictures released a movie entitled Hangar 18. The plot involves a UFO cover-up by the US government after an unidentified object attacks a NASA orbiting shuttle as astronauts try to launch a satellite. An alien spacecraft is discovered in Arizona, and other evidence convinces investigators that the ETs that closely resemble modern humankind genetically created Homo sapiens and are planning to return to Earth. That threatens the US government, which conspires to destroy all such evidence under a strict policy of denial. Now in 2013, the American intelligence and counterintelligence link behind the corporate creation of Sunn Classic Pictures and Hangar 18 is being explored by Robbie Graham, producer of the UK's SilverScreenSaucers.com. In a two-part conversation with Linda, he outlined the paper trail of Patrick J. Frawley, Jr., who was not only the head of Sunn, but also created the powerful American Security Council, and had ties with CIA notables. Further details.\nCyber Crime\n\nFirst hour guest, journalist Misha Glenny (book link) reported on the increase in cyber crime and warfare. For the past 10 years, he noted, the most common type of cyber crime has been credit and debit card fraud, but now criminals/hackers are going after higher targets such as businesses, and corporations (the NY Times was recently infiltrated). Cyber crime has also become more organized with groups operating out of multiple countries, so they are harder to track and go after. There was recently a series of coordinated attacks on US banks that seemed to come from Iran. This may have been a retaliation to a US/Israeli cyber attack on Iran, he said, adding that you sometimes don't know if you're dealing with crime, espionage, or some new form of warfare.\n\nNews segment guests: Douglas Hagmann, Peter Davenport\nWebsite(s):\n\n    earthfiles.com\n\nBook(s):\n\n    Glimpses of Other Realities, Volume 2\n    Mysterious Lights and Crop Circles\n    Dark Market\n    McMafia: A Journey Through the Global Criminal Underworld\n\n","torrent":{"xt":"urn:btih:8868106091aa8e5851ec4cb993fafa0dd69c3eca","amp;dn":"Coast+to+Coast+AM+January+31+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8868106091aa8e5851ec4cb993fafa0dd69c3eca","infoHashBuffer":{"type":"Buffer","data":[136,104,16,96,145,170,142,88,81,236,76,185,147,250,250,13,214,156,62,202]},"announce":[],"urlList":[]}}