{"title":"PSX-PSP Mega Man Legends 1 &amp; 2 converted properly by KloWn","uid":4461631,"size":502573845,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:890b4e62ade7d76d09ceb474f8ab2a49d60e2135&amp;dn=PSX-PSP+Mega+Man+Legends+1+%26+2+converted+properly+by+KloWn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"toxicjuggalo","files":4,"time":1224728734,"description":"MEGA MAN LEGENDS 1:\n\nMega Man is back, and this time, he&amp;#039;s in 3D! That&amp;#039;s right, explore 3D landscapes in search of Mother Lode, the grandest treasure of all, as you battle fierce creatures and HUGE bosses with a variety of deadly weapons...\n\n\nMEGA MAN LEGENDS 2:\n\nMega Man returns in this his second 3D outing on the Playstation. The Blue bomber and his team mate Roll must journey to a distant island to recover the The Mother Lode, an item that no-one really understands, but they all believe that it may hold the key to make their dreams come true, so everyone is after it.\n\n\nI have also included the latest popsplugin and ALL sony prx which are required to play psx-psp conversions on custom firmware&amp;#039;s... To install the pops simply copy the seplugins folder to the root of your memory stick, turn off your psp, hold down the right trigger button while turning the psp back on to go into recovery mode..Select the plugins option and enable the pops...Everytime you start a new psx game it will ask you which pops you wish to use I recommend using 3.40 pops as I have personally have had no problems with ANY psx game so far.....Drag and drop the folder of the game you wish to play to the PSP--&gt;GAME folder on your memory stick and away you go..ENJOY and don&amp;#039;t forget to say thanx.....\n\nI also suggest changing the control configuration since the PSP does not have R2 &amp; L2 buttons  and R2 is used to target enemies... To do this, push the HOME button and go to CONTROL SETTINGS....","torrent":{"xt":"urn:btih:890b4e62ade7d76d09ceb474f8ab2a49d60e2135","amp;dn":"PSX-PSP+Mega+Man+Legends+1+%26+2+converted+properly+by+KloWn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"890b4e62ade7d76d09ceb474f8ab2a49d60e2135","infoHashBuffer":{"type":"Buffer","data":[137,11,78,98,173,231,215,109,9,206,180,116,248,171,42,73,214,14,33,53]},"announce":[],"urlList":[]}}