{"title":"Guided By Voices - The Bears for Lunch (2012) [FLAC]","uid":8052539,"size":291454387,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:893519efd54bd891bb8efe932a2551bd3aeeee0e&amp;dn=Guided+By+Voices+-+The+Bears+for+Lunch+%282012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1358885998,"description":"  \n  Guided By Voices - The Bears for Lunch (2012) [FLAC]\n\n  Released: Dec 13, 2012\n  Duration: 42:52\n  Genre: Pop/Rock\n  Style: Indie Rock, Alternative\n  Codec: FLAC\n  Bit Rate: ~ 800 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  Cover: Front\n\n  01 King Arthur The Red\n  02 The Corners Are Glowing\n  03 Have A Jug\n  04 Hangover Child\n  05 Dome Rus\n  06 Finger Gang\n  07 The Challenge Is Much More\n  08 Waving At Airplanes\n  09 The Military School Dance Dismissal\n  10 White Flag\n  11 Skin To Skin Combat\n  12 She Lives In An Airport\n  13 Tree Fly Jet\n  14 Walking Up The Stairs\n  15 Up Instead Of Running\n  16 Smoggy Boy\n  17 Amorphous Surprise\n  18 You Can Fly Anything Right\n  19 Everywhere Is Miles From Everywhere\n\n  The Bears for Lunch rounds out a ridiculously busy year in the history of Ohio lo-fi pioneers Guided by Voices as their third full-length album released in 2012. Back with a vengeance from an eight-year hiatus, the GbV brand is recalibrated for this trio of new albums with the classic 1993-1996 lineup of the band that produced its most adored records like Alien Lanes and Bee Thousand. The drive to create is audible, with all three of these collections (as well as two solo albums released in 2012 by GbV frontman Robert Pollard) stuffed with frantic amounts of song ideas, from off-the-cuff free-associative ranting to fully formed jangling power pop. Almost 20 years since those early albums of hissy four-track recordings, a couple of things have changed. \n\n  In the 2010s the band has taken to mixing its infectious pop with slight hints of prog rock, as on the relatively epic album opener &quot;King Arthur the Red&quot; and the spacy paranoia of &quot;Amorphous Surprise.&quot; While there are still some nods to home-recorded experiments like the charmingly off-key multi-tracked vocals of the Beatles-folky &quot;Waking Up the Stars&quot; and the lo-fi piano ballad &quot;The Military School Dance Dismissal,&quot; these songs are mostly studio-recorded rock, with clear drums, loud guitars, and coherent vocals. The dusty charm of the band's early work is still intrinsic to the songwriting, however. Hooky slices of sad pop magic like &quot;White Flag,&quot; &quot;Waving at Airplanes,&quot; and the R.E.M.-styled bounce of &quot;Everywhere Is Miles from Everywhere&quot; sound like new chapters in the band's history of incredibly catchy songs rather than rewrites of former glories. However, also true to GbV style, there's a good amount of frustrating filler like the half-baked and drunk-sounding jam &quot;Dome Rust&quot; and the tedious &quot;Tree Fly Jet.&quot; \n\n  The truly curious part of the equation is the band's choice to release three albums of almost interchangeably average quality in the space of one year instead of offering up one collection of standouts. The Bears for Lunch may be the strongest of the three 2012 albums by a small margin, but regardless of whether your preferences fall to the side of pop or snotty noise, a far better album-length &quot;best-of&quot; playlist could be culled from the three records than any of them standing on its own. As an entity unto itself, The Bears for Lunch is much like Let's Go Eat the Factory and Class Clown Spots a UFO before it: completely respectable collections of tunes from a well-oiled machine, but falling short of the almost accidental brilliance of their best work.","torrent":{"xt":"urn:btih:893519efd54bd891bb8efe932a2551bd3aeeee0e","amp;dn":"Guided+By+Voices+-+The+Bears+for+Lunch+%282012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"893519efd54bd891bb8efe932a2551bd3aeeee0e","infoHashBuffer":{"type":"Buffer","data":[137,53,25,239,213,75,216,145,187,142,254,147,42,37,81,189,58,238,238,14]},"announce":[],"urlList":[]}}