{"title":"Charlotte Church - Charlotte Church [128]","uid":7639611,"size":49648078,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8973394bed7a264ac64ebb9b2de2cff23b53a4f8&amp;dn=Charlotte+Church+-+Charlotte+Church+%5B128%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1347742901,"description":"Charlotte Maria Church (born Charlotte Maria Reed; 21 February 1986) is a Welsh[1] singer-songwriter, actress and television presenter. She rose to fame in childhood as a classical singer before branching into pop music in 2005. By 2007, she had sold more than 10 million records worldwide[2] including over 5 million in the United States.[3] In 2010 she was reported to be worth as much as Â£11m[4] (though one 2003 report quoted her worth at Â£25m[5]). She hosted a Channel 4 chat show titled The Charlotte Church Show. Church released her first album in five years, titled Back To Scratch, on 17 October 2010. She is also mentioned as one of the Bohemians in Ben Elton's musical We Will Rock You.\n\nEditorial Reviews\nAmazon.com\nTo judge by the impassioned responses to her debut album Voice of an Angel, Charlotte Church has already set extraordinary expectations for any follow-up. After all, the vocal phenomenon from Cardiff, Wales, took up a place in The Guinness Book of Records as the youngest artist ever--at the tender age of 12--to have an album attaining No. 1 status on the classical charts. This self-titled second release will continue to delight the highly gifted singer's legions of fans, and also contains some surprises for them. Church here tries out classical repertory with Puccini's &quot;O mio babbino caro&quot; and the &quot;Jewel Song&quot;--her pure and high-flying voice showing an amazing agility. There is great warmth in a couple of sacred songs, as well as the traditional Irish &quot;She Moved Through the Fair.&quot; Church's vocal color--almost like a boy soprano at times--brings something unique to Gershwin's &quot;Summertime,&quot; while the first track--Danny Beckerman's Hallmark-ish &quot;Just Wave Hello&quot;--seems destined to become part of the music you can't avoid associating with the turn of the millennium. --Sarah Chin\n\n01 - Beckerman Just Wave Hello\n02 - La Pastorella\n03 - Barcarolle\n04 - O Mio Babbino Caro\n05 - Lascia Ch'io Pianga\n06 - Guide Me, O Thou Great Redeemer\n07 - The Holy City\n08 - Plaisir D'amour\n09 - Summertime\n10 - The Jewel Song\n11 - Voi Che Sapete\n12 - She Moved Through The Fair\n13 - Songs My Mother Taught Me\n14 - If Thou Art Near\n15 - The Last Rose Of Summer\n16 - Men Of Harlech\n17 - Lullaby","torrent":{"xt":"urn:btih:8973394bed7a264ac64ebb9b2de2cff23b53a4f8","amp;dn":"Charlotte+Church+-+Charlotte+Church+%5B128%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8973394bed7a264ac64ebb9b2de2cff23b53a4f8","infoHashBuffer":{"type":"Buffer","data":[137,115,57,75,237,122,38,74,198,78,187,155,45,226,207,242,59,83,164,248]},"announce":[],"urlList":[]}}