{"title":"Coast to Coast AM 2012.02.17 Dreams &amp; Nightmares, Open Lines","uid":7074881,"size":53808210,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8975d270f399d558f8de2dd055ac66dc6faf5139&amp;dn=Coast+to+Coast+AM+2012.02.17+Dreams+%26amp%3B+Nightmares%2C+Open+Lines&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ViViDSOL","files":5,"time":1330800794,"description":"Coast to Coast AM 2012.02.17 Dreams &amp; Nightmares, Open Lines\n\nHost:\tGeorge Noory\nGuests:\tNicole Sebastian, Open Lines\n\nIn the first half, George Noory welcomed dream expert Nicole Sebastian for a discussion on dreams and nightmares. A nightmare is a strong message about something that is occurring in one's life, Sebastian explained, noting that once decoded a nightmare never returns. &quot;The more we're in alignment with our true purpose... the nightmares naturally dissipate,&quot; she said. Sebastian cited a client plagued by nightmares about her spouse cheating on her, and discovered a few weeks later that he had been. Sebastian believes that dreams, along with intuition and signs, provide a way to know something with 100% certainty.\n\nAbout ninety percent of dreams are prophetic and most often they will directly pertain to the dreamer's own life, she revealed. Sebastian recommended tracking dreams in a journal and reviewing for prophetic content every few months. As an example, she recalled a dream she had written down about a woman with short dark hair moving to Detroit. Sebastian said she initially dismissed the dream, until several months later, when she pulled into the Motor City sporting a new short hair style and color, and discovered the dream had been about her.\n\nSebastian provided tips for remembering dreams. Everyone dreams four to six times a night, she said. Merely intending to remember a dream before going to bed will greatly assist recall, as well as making a 'hue' sound, and keeping your eyes closed upon waking up, Sebastian continued. The latter allows one to remain connected to the places that were visited in the dream, she added. Sebastian also spoke about the power of dreams to provide answers to life's problems, how to re-script a nightmare, and the way to overcome demonic dreams with spiritual insulation provided by the 'hue' technique.\n\n-------------------------------------------------\n\nDuring Open Lines, Thomas in Marina Del Rey, California, recalled seeing a shadow figure in his dreams after his mother passed away from stage IV cancer. At first, Thomas said he was nervous about his encounter with the dark being, until one night a calm washed over him and he realized the shadowy presence was his deceased mom. &quot;I knew it was her in the dreams because I would see the shadow of her hat,&quot; he said. Barry from Rock Hill, South Carolina, told George that he used to live in Homestead, Florida-home of Edward Leedskalnin's Coral Castle. While there Barry met a man who had occasionally assisted Leedskalnin in the construction of his megalithic wonder. According to him, Coral Castle was built, at least in part, with the &quot;extra special help&quot; of extraterrestrials. At the end of the program, George played a recording of him singing Elvis' hit song, Can't Help Falling In Love.\n\nNews segment guests: Jerome Corsi / John Lott\n\nWebsite(s):\n &lt;a href=&quot;\nhttp://theancientwayofknowing.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://theancientwayofknowing.com&lt;/a&gt; &lt;a href=&quot;\nhttp://1magicword.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://1magicword.com&lt;/a&gt; &lt;a href=&quot;\nhttp://trustyourselfsystem.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://trustyourselfsystem.com&lt;/a&gt; &lt;a href=&quot;\nhttp://divineguidanceinstitute.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://divineguidanceinstitute.org&lt;/a&gt;\n\nBook(s):\n\nTrust Yourself: Master Your Dreams, Master Your Destiny &lt;a href=&quot;\nhttp://amzn.to/wykcIt&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/wykcIt&lt;/a&gt;\n\nJust Say Hu &lt;a href=&quot;\nhttp://amzn.to/wZlIvp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/wZlIvp&lt;/a&gt;\n\nSociology of Soul &lt;a href=&quot;\nhttp://amzn.to/yne9Vg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/yne9Vg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:8975d270f399d558f8de2dd055ac66dc6faf5139","amp;dn":"Coast+to+Coast+AM+2012.02.17+Dreams+%26amp%3B+Nightmares%2C+Open+Lines","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8975d270f399d558f8de2dd055ac66dc6faf5139","infoHashBuffer":{"type":"Buffer","data":[137,117,210,112,243,153,213,88,248,222,45,208,85,172,102,220,111,175,81,57]},"announce":[],"urlList":[]}}