{"title":"Michael Chabon - The Yiddish Policemen's Union","uid":12760379,"size":182791719,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:899e2db7e46053b89db8643563454dfcfa3eedac&amp;dn=Michael+Chabon+-+The+Yiddish+Policemen%27s+Union&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":1,"time":1447522845,"description":"\nFor sixty years, Jewish refugees and their descendants have prospered in the Federal District of Sitka, a &quot;temporary&quot; safe haven created in the wake of revelations of the Holocaust and the shocking 1948 collapse of the fledgling state of Israel. Proud, grateful, and longing to be American, the Jews of the Sitka District have created their own little world in the Alaskan panhandle, a vibrant, gritty, soulful, and complex frontier city that moves to the music of Yiddish. For sixty years they have been left alone, neglected and half-forgotten in a backwater of history. Now the District is set to revert to Alaskan control, and their dream is coming to an end: once again the tides of history threaten to sweep them up and carry them off into the unknown.\r\n\r\nBut homicide detective Meyer Landsman of the District Police has enough problems without worrying about the upcoming Reversion. His life is a shambles, his marriage a wreck, his career a disaster. He and his half-Tlingit partner, Berko Shemets, can't catch a break in any of their outstanding cases. Landsman's new supervisor is the love of his life—and also his worst nightmare. And in the cheap hotel where he has washed up, someone has just committed a murder—right under Landsman's nose. Out of habit, obligation, and a mysterious sense that it somehow offers him a shot at redeeming himself, Landsman begins to investigate the killing of his neighbor, a former chess prodigy. But when word comes down from on high that the case is to be dropped immediately, Landsman soon finds himself contending with all the powerful forces of faith, obsession, hopefulness, evil, and salvation that are his heritage—and with the unfinished business of his marriage to Bina Gelbfish, the one person who understands his darkest fears.\r\n\r\nAt once a gripping whodunit, a love story, an homage to 1940s noir, and an exploration of the mysteries of exile and redemption, The Yiddish Policemen's Union is a novel only Michael Chabon could have written.\r\n\r\n\r\nRead by Peter Riegert\r\nFormat: MP3\r\nBitrate: 48 Kbps","torrent":{"xt":"urn:btih:899e2db7e46053b89db8643563454dfcfa3eedac","amp;dn":"Michael+Chabon+-+The+Yiddish+Policemen%27s+Union","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"899e2db7e46053b89db8643563454dfcfa3eedac","infoHashBuffer":{"type":"Buffer","data":[137,158,45,183,228,96,83,184,157,184,100,53,99,69,77,252,250,62,237,172]},"announce":[],"urlList":[]}}