{"title":"Star Trek DDK Cuts","uid":11295548,"size":42298799734,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:89ce6937d4884ad0d60945d421a3c360089318b2&amp;dn=Star+Trek+DDK+Cuts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bbqwoa","files":5,"time":1414375796,"description":"\nThe DDK Fan edits of the four included Star Trek Films are a labour of love.\n\nCreated primarily for personal enjoyment, they are the versions of these great movies I always wanted.\n\nThe included DDK Cut versions of these films are the only Star Trek Fan edits I have produced. I do not have issues with the others that significantly warrant creating Fan edits.\n\n\nUsing a base of the modern releases of these films, the DDK cuts represent the versions of these wonderful films that I feel represent the best possible representations of each film.\n\nEach have have numerous additions, removals, tweaks, colour corrections and minor to major special effects changes.\n-\nStar Trek VI: The Undiscovered Country contains minor colour correction, minor effects tweaks and the replacement of the CGI Enterprise shot during the final battle.\nMost significantly, Phasers have been added to the Enterprise and Excelsior during the final battle.\n\n-\nStar Trek VII: Generations contains colour and gamma correction, musical enhancements and levelling, as well as a new prologue acting as a bridge between the TOS and TNG eras.\nMost significantly, the controversially re-used shots from Star Trek VI have been replaced with new shots: The Enterprise B is now properly shown at warp instead of the re-used Excelsior shot,\nand the destruction of the Duras Sisters' Bird of Prey is shown in a newly composed shot.\nAdditional low quality/re-used shots have been replaced (for example, the Enterprise flyover shot before the Stellar Cartography scene)\n\n-\nStar Trek IX: Insurrection has heavy re-compositing and colour correction on every external/CG/space shot in the film.\nThe previously slightly 'flat' or 'unfinished' look of many of the film's space scenes has been fixed.\nThe poorly animated 'face stretching' shot has been cut off early and the scene has been re-editing. Implying more of the effect than showing it.\nThe Son'a stunt man on-board the Holoship is no longer shown performing a hammy death. The scene has been re-edited to only use the best part of the stunt.\nThe final scene on-board the Son'a Collector vessel has been completely re-composited. The original scene was left unfinished due to the film going over budget; with unfinished Blue-screen shots.\nThese blue-screen elements have been converted to create a much more subdued interior appearance on-board the Collector.\n\n-\nStar Trek X: Nemesis has had removals and slight editing changes.\nThe controversial 'car chase' has been completely removed, with an elegant, subtle scene change instead.\nThe Enterprise shots going into Warp have been re-composited, creating a much more aggressive, rapid effect.\nThe fight between Riker and Shinzon's Viceroy has been reduced and abbreviated.\n\nIt is my desire that these versions of these beloved films be enjoyed by all Star Trek fans.\nAdditionally, it is my hope that these cuts of the films may sway opinion from negative to positive for some fans, as I am confident their major issues with the films will be resolved.\n\nSome Screenshots: &lt;a href=&quot;\nhttp://imgur.com/a/iCAZG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgur.com/a/iCAZG&lt;/a&gt;\n\n\nThese cuts are in 1920X1080 Resolution and Stereo audio, and I recommend watching them using Neo 6 Cinema if you have a surround sound system.\n\nIt goes without saying but make sure you have full 0-255 RGB on your display.\n\nYou must own legal copies of each film on Bluray to enjoy these fan edits.\nThese fan edits are produced and distributed under the Creative Commons License and are not for profit in any way.\t\n\nThank you, enjoy, and please Seed!","torrent":{"xt":"urn:btih:89ce6937d4884ad0d60945d421a3c360089318b2","amp;dn":"Star+Trek+DDK+Cuts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89ce6937d4884ad0d60945d421a3c360089318b2","infoHashBuffer":{"type":"Buffer","data":[137,206,105,55,212,136,74,208,214,9,69,212,33,163,195,96,8,147,24,178]},"announce":[],"urlList":[]}}