{"title":"The Light Of The World - Jack Chick (DivX)","uid":5873988,"size":668772732,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8b8098180c95f982298ec9526e87715d6a72dbe6&amp;dn=The+Light+Of+The+World+-+Jack+Chick+%28DivX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JustPirateBay2010","files":-1,"time":1286496950,"description":"\nThe Light Of The World - Jack Chick (DivX)\n\nMany stories can be entertaining. But only a few can evoke strong enough emotions to change lives. Such is the story of &quot;The Light of the World,&quot; an 80-minute film without live action featuring 360 detailed paintings chronicling biblical events. Set to stirring original music with dramatic narration, &quot;The Light of the World&quot; is a labor of love for Jack Chick of Chick Publications, the Inland Valley company that produces a number of comic-strip gospel tracts distributed around the world. \n\n&quot;The entire film is intended to portray exactly what the Bible says, not to take artistic license to embellish and show things that aren't true,&quot; said Helms, a resident of Rancho Cucamonga. &quot;I believe that this is the most graphic portrayal of the beating and crucifixion of Jesus to date.&quot;\n\nWhile Chick sketched the foundation for each painting, Carter brought each to life with colored markers, acrylics and a touch of oil. Carter, who pastors a small community church just north of Victorville, completed about 95 percent of the paintings himself over 15 years, with the other 5 percent produced by artists Eric Hollander and Keith Goodson.\n\n&quot;There was one (painting) near the end that showed the Lord's eyes,&quot; Carter said when asked if any of the pieces made him emotional. &quot;That one got to me the most.&quot;\n\nFor the original music, Chick contacted John Campbell of Upland, who has won several awards for music he's composed including an Emmy for the cartoon &quot;Where in the World is Carmen San Diego?&quot; Campbell, 42, also has written music for Focus on the Family's children's radio show, &quot;Adventures in Odyssey,&quot; for the past 20 years.\n\nCampbell said writing music for still-life paintings presented some challenges at first. He found himself stopping and staring at the pictures because they were so beautiful, he said. That was inspiration enough to write the music. \n\n1 Hour 18 Mins     720 x 540     29 Fps     1000 Kbps","torrent":{"xt":"urn:btih:8b8098180c95f982298ec9526e87715d6a72dbe6","amp;dn":"The+Light+Of+The+World+-+Jack+Chick+%28DivX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b8098180c95f982298ec9526e87715d6a72dbe6","infoHashBuffer":{"type":"Buffer","data":[139,128,152,24,12,149,249,130,41,142,201,82,110,135,113,93,106,114,219,230]},"announce":[],"urlList":[]}}