{"title":"Jimmy Lafave Discography and Extras","uid":4029756,"size":1905386819,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8b901b17cbfcd4966a6964170ff4212c5e1fa527&amp;dn=Jimmy+Lafave+Discography+and+Extras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"crashray","files":163,"time":1203111857,"description":"Jimmy LaFave was born in Wills Point, Texas, a small town 30 miles east of Dallas. He began school down the road in Mesquite and by Junior High was making music perched behind his Sears &amp; Roebuck drum kit. It wasn?t long before his mother traded a drawer full of green stamps for his first guitar and the switch to singer?songwriter was in progress. His family later moved to Stillwater, Oklahoma, where he finished high school. Although he has lived in Austin for nearly 20 years, many people think of him as being from Oklahoma, because of his strong musical ties to the state and what he often refers to as its ?red dirt music.? It was in this landscape that he began to define his sound and soak up a combination of his experiences among authentic songwriters from the tradition of Woody Guthrie. Before leaving Oklahoma for Austin, Jimmy did some independent recording and toured the southwest with the first version of his band Night Tribe.\n\nHe moved to Austin in 1986, where he continued to write songs and to develop his musical ideas. Shortly after arriving he was asked to help launch the songwriter nights at the new performance venue Chicago House. In 1988 he recorded his self?produced tape, Highway Angels...Full Moon Rain, which won the Austin Chronicle Reader?s Poll Tape of the Year Award. This led to a recording contract with a small independent label and allowed LaFave the opportunity to work with Bob Johnston, producer of several of LaFave?s favorite albums including Bob Dylan?s Blonde on Blonde and Nashville Skyline. Although these recordings were never released, by 1990 LaFave had put together an Austin version of Night Tribe and had become, according to the Austin American?Statesman, ?a perennial presence upon the Austin music scene.? In 1992 Jimmy released a self?produced CD, Austin Skyline, which drew international attention to his songwriting and vocal talents, and led to a publishing agreement with Polygram Music. Due to his growing popularity and radio play on more than 200 stations, Austin Skyline and its label, Bohemia Beat, received national distribution through the Rounder Record Group. His second album, Highway Trance was released in 1994 followed by his third CD, Buffalo Return to the Plains, in 1995.\n\nThe grass roots demand and critical acclaim for Jimmy?s music, which led to extensive touring in the United States and Europe, was recognized in 1996 when he was asked to tape a performance for the PBS musical series Austin City Limits, and was invited by Nora Guthrie to appear in Cleveland at the Rock and Roll Hall of Fame tribute to Woody Guthrie. That same year LaFave won his second consecutive Austin Music Award for Best Singer?Songwriter. His fourth CD, Road Novel, which was released in early 1997, received many glowing reviews. That year he was asked by Nora Guthrie to speak and perform at the induction of Woody Guthrie into the Oklahoma Hall of Fame. He traveled to Europe twice that year and also toured the USA and Canada and made multiple appearances on NPR?s Mountain Stage.\n\nIn the fall of 1998, Jimmy and record label President, Mark Shumate, began compiling a 15?year retrospective of bootleg tapes, live performances, radio shows and studio out takes. LaFave kicked off 1999 with the release of the CD entitled Trail. The double CD contains 31 tracks recorded in Texas and around the world. Including 12 Dylan songs, it answered the demand of fans for a ?LaFave does Dylan? CD. In the liner notes Dave Marsh noted: ?Jimmy LaFave has one of America?s greatest voices, and this album is the story of what he has learned to do with it. It?s a unique instrument, with startling range and its own peculiar sense of gravity, liable to swoop in and wreck your expectations at any instant.?\n\nIn 2001, Jimmy released Texoma, a celebration of the Americana spirit with a heartfelt valentine to the heartland. KGSR Program Director, Jody Denberg called it a ?phenomenon.? Denberg said, ?the phones lit up immediately after it was added to the playlist, and they stayed lit.? Since the release of Texoma, Jimmy combined his solo dates with the Woody Guthrie tribute tour titled ?The Ribbon of Highway ? Endless Skyway,? featuring a rotating cast of Americana musicians that has included such notables as Eliza Gilkyson, Sarah Lee Guthrie &amp; Johnny Irion, Tom Russell and Slaid Cleaves. The two?disc live album Ribbon of Highway Endless Skyway is a collection of the tour?s live performances that features some of Jimmy?s interpretations of Woody Guthrie classics.\n\nEncouraged by his friend, fellow Austin artist Eliza Gilkyson, Jimmy LaFave signed with indie label Red House records, and in 2005 released Blue Nightfall. This stunningly soulful album was LaFave?s first in 4 years and won him much critical attention. LaFave?s new album Cimarron Manifesto finds Jimmy taking a more country road, with sweet and mournful songs about life and loss and special guest appearances by Carrie Rodriguez, Ruthie Foster and Kacy Crowley. Following the release of this new record, Jimmy will hit the road himself, touring across North America.\n\n\n\nSUPPORT THE ARTISTS!!!!!!!!!!!!!!!!\n &lt;a href=&quot;\nhttp://www.jimmylafave.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jimmylafave.com&lt;/a&gt;\n\nTrader&amp;#039;s\n &lt;a href=&quot;\nhttp://db.etree.org/peacetrader&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://db.etree.org/peacetrader&lt;/a&gt;\n\n\nAustin Skyline\nRoad Novel\nHighway Trance\nBlue Nightfall\nTrail\nCimarron Manifesto\nBuffalo Returns To Plains\nTexoma\n\n\nExtras:\n\nSXSW Interview and Concert March 16, 2007 Austin Texas\nLive Mini Music Album (Holland)\nKUT Studios December 14, 2007  Austin Texas\n\n\nPeace!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:8b901b17cbfcd4966a6964170ff4212c5e1fa527","amp;dn":"Jimmy+Lafave+Discography+and+Extras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b901b17cbfcd4966a6964170ff4212c5e1fa527","infoHashBuffer":{"type":"Buffer","data":[139,144,27,23,203,252,212,150,106,105,100,23,15,244,33,44,94,31,165,39]},"announce":[],"urlList":[]}}