{"title":"Dire Straits - Sultans Of Swing (Alchemy Live) (Xvid-2nafish)","uid":7100484,"size":188961978,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8c0768e1c19ea67ac4eb992171c5f9ef137471a3&amp;dn=Dire+Straits+-+Sultans+Of+Swing+%28Alchemy+Live%29+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1331677416,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:10:46\n\n[Video]\nResolution : 640x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 2210 Kbps\nQuality Factor : 0.33 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Sultans of Swing&quot; was the first single release of the British rock band Dire Straits. Although it was first released in 1978, it was its 1979 re-release that caused it to become a hit in both the UK and USA.\n\nThe song was first recorded as a demo at Pathway Studios, North London, in July 1977, and quickly acquired a following after it was put on rotation at Radio London. Its popularity soon reached record executives and Dire Straits were offered a contract with Phonogram Records. The song was then re-recorded in early 1978 at Basing Street Studios for the band's debut album Dire Straits. The record company wanted a less-polished rock sound for the radio, so an alternative version was recorded at Pathway Studios in April 1978 and released as the single in some countries including the United Kingdom and Germany.\n\nThe song was written by Mark Knopfler whilst in a bar in South London. The inspiration came from a jazz band playing in the corner of an otherwise deserted pub.\n\nThe album version of the song featured a critically acclaimed extended guitar solo, reaching #22 on Guitar World's list of the greatest guitar solos and #32 on Rolling Stone Magazine's list of greatest guitar songs. Mark Knopfler improvised and expanded that solo during live performances. The coda of the live recording on the 1984 album Alchemy features one of Knopfler's most notable guitar improvisations. Another memorable live version of the song came as an 11-minute performance at the 1988 Nelson Mandela 70th Birthday Tribute concert in London when Eric Clapton teamed up with the band to play the song.\n\nThe master track of the song is featured in the video game Guitar Hero 5, as a playable song.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\t\n","torrent":{"xt":"urn:btih:8c0768e1c19ea67ac4eb992171c5f9ef137471a3","amp;dn":"Dire+Straits+-+Sultans+Of+Swing+%28Alchemy+Live%29+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c0768e1c19ea67ac4eb992171c5f9ef137471a3","infoHashBuffer":{"type":"Buffer","data":[140,7,104,225,193,158,166,122,196,235,153,33,113,197,249,239,19,116,113,163]},"announce":[],"urlList":[]}}