{"title":"Glamour (US), Sat 03 Aug 2013","uid":8777275,"size":15973263,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8c4e6973533970bbc62cb315fd347be975e76c56&amp;dn=Glamour+%28US%29%2C+Sat+03+Aug+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OrajelJunkie","files":-1,"time":1375589081,"description":"Created by Calibre\n\n\n\nArticles in this issue:\n\nDressed's 5 Best Looks of the Week: Prints, Prints, and More Prints (Plus, One Classic Color!)\n\nWho Knew?! Leather Is the Perfect Summer-to-Fall Wardrobe Essential (Miley Cyrus Thinks So!)\n\nThe Summer Shoe Staple That May Be Worse for Your Feet Than High Heels!\n\nFashion Trucks Are the New Food Trucks: Henry Holland Launches a Store on Wheels!\n\nYoung Hollywood Awards 2013 Red Carpet: All the Fashion Moments You Can't Miss\n\nWhat Do You Think of Fashion Emblazoned With Religious Phrases? Sound Off Here!\n\nFashion Flashback Friday: Saved by the Bell's Lisa Turtle is Remarkably On-Trend RIGHT NOW (We Have 10 Reasons Why!)\n\nThe Alexander Wang Giveaway Video Is the Scariest Thing I've Ever Seen\n\nLauren Conrad's Biggest Fashion Splurge of the Summer!\n\nOlivia Wilde Makes Matchy-Matchy Chic for Date Night With Jason Sudeikis\n\nYou Tell Us: If Your Young Daughter Wanted to Wear Heels, Would You Let Her?\n\nSummer Trend to Try Before Summer's Gone: Lace Mashing\n\nYumi Kim Designer Kim Phan Shares Her Italian Riviera Vacation Essentials (and She Drops a Hint on an Upcoming Project!)\n\nReason Number 2,359 to Love Pinterest: The Site Is Introducing Price-Drop Alerts on Your Pins!\n\nRemember Laura Ashley? Say Hello to the Brand's First Hotel! Plus, 5 More Fashion Hotels to Put on Your Travel Bucket List\n\nNeed a Midday Pick-Me-Up? Beyonce Posted the Cutest Shoe-Instagram You'll See All Day\n\nWork Outfit Idea: A Conservative (yet Modern!) Take on Tweed\n\nWhat Does the Color of Your Underwear Say About Where You Live? Find Out Here!\n\nCheck Out These Amazing Knit Magazine Covers by Danish Artist Inge Jacobsen\n\nFinally! H and M is Sold Online! Here Are 5 Things In My Shopping Cart.\n\nThis Sexy Bedhead Look on Suki Waterhouse Is SO Your New Weekend Hairstyle. Here's How to Get the Look\n\nHere's How to Avoid a Lip Sunburn (It Happens. And it Hurts!) Without Looking Like You Just Made Out With Sunblock\n\nHow to Copy Kate Hudson's Dreamy Blond Hair Color\n\nThis Is the Second Most Charming Braided Hairstyle Idea We've Ever Seen (Just TRY and Resist the Prettiness)\n\nMy New Favorite All-Natural Way to Spot-Treat a Pimple","torrent":{"xt":"urn:btih:8c4e6973533970bbc62cb315fd347be975e76c56","amp;dn":"Glamour+%28US%29%2C+Sat+03+Aug+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c4e6973533970bbc62cb315fd347be975e76c56","infoHashBuffer":{"type":"Buffer","data":[140,78,105,115,83,57,112,187,198,44,179,21,253,52,123,233,117,231,108,86]},"announce":[],"urlList":[]}}