{"title":"The Long Memory 1953 DvdRip Avi Lee1001","uid":9825857,"size":1046597672,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8c8ff81621d295a8bfcfb3e8b744618f84d461fc&amp;dn=The+Long+Memory+1953+DvdRip+Avi+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xultfoad","files":2,"time":1395775521,"description":"The Long Memory 1953 DvdRip Avi Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0044849/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0044849/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/The_Long_Memory&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/The_Long_Memory&lt;/a&gt;\nRecently released from prison, Phillip Davidson finds sanctuary on an abandoned barge on the Kent Marshes. He has spent the last twelve years in prison for a crime of which he is innocent, and now, an embittered middle-aged man, he is bent on revenge. He recalls how it all began, when he asked Captain Driver for his consent to marry his daughter, Fay. How could he have known that Driver was mixed up with dangerous criminals involved in the people trafficking racket? Davidson remembers that fateful night vividly, when Driver's boat caught fire after a brawl. Of course, he was the obvious scapegoat when a charred dead body was found on the boat. Neither Fay nor her father came forward to clear his name. And for that he had spent the best years of his life behind bars. Now, at last, the time has come for him to settle the score\n\nIt is surprising how few really good examples of film noir there are in British cinema. When you consider the impact that film noir had on American cinema in the nineteen-forties and fifties, it is frankly bizarre that the only equivalent film that British cinema is known for is Carol Reed's The Third Man (1949). Yet film noir was actually quite prevalent in Britain in this period and these provide the bleakest, most depressing depictions of post-war austerity to be seen in European cinema (except, perhaps, for the films of the Italian neo-realists). That so few of these films are remembered today is more a feature of their perceived unmarketability (like their American counterparts, they were low budget productions without big name actors) than their artistic failings.\n\nThe Long Memory is typical of the run-of-the-mill British film noir of its era. The film is interesting because it features John Mills, a popular actor at the time, in very atypical role, the unkempt anti-hero. Mills was far better known as the genial heroic character, the kind of well-presented, well-spoken lad that every father in the land would like as a son-in-law. Here, Mills portrays a much darker and introspective character than he had played previously, someone of dubious morality and who might even be prepared to kill a woman. That Mills makes the character so convincing and, at times, frighteningly chilling, is testament to his skill as an actor. The film was directed by Robert Hamer, who had recently made It Always Rains on Sunday (1947) and Kind Hearts and Coronets (1949), two all-time classics of British cinema.\n\nThe film is marginally let down by its modest production values, lethargic pacing and some disappointing contributions from the supporting cast, but it is still a highly atmospheric piece that perfectly evokes the penury and weariness of post-war Britain. The confined living quarters, the dingy back streets and barren Kent coastal landscape all conjure up a world of desolation and despair that has lost its moral and social purpose. It can be argued that this grimly realistic setting makes a far more effective backdrop for a film noir than the stark expressionistic locations seen in equivalent Hollywood productions. The final, stunningly photographed sequence on the Kentish Marshes is one of the most haunting of any British film, the downbeat happy ending almost crushed by the nihilistic bleakness of the setting. \nJuly 27, 1953\nTHE SCREEN; Justice for Blind Man\nH. H. T.\n\nWhile some last-minute improbabilities blunt the general impact, Saturday's new import at the Beekman, &quot;The Long Memory,&quot; emerges as compelling and rewarding film fare. In depicting the revenge and regeneration, after twelve years, of a wrongly imprisoned man, this J. Arthur Rank presentation, which Hugh Stewart produced, steers a sure course toward justice triumphant matched, fortunately, by integrity personified.\n\nHere is a strictly British job, impeccably performed by John Mills, John McCallum, Elizabeth Sellars and a typical, heterogenous gallery; beautifully stitched together by director Robert Hamer and offering food for thought to those so inclined.\n\nFor the scenario, co-written by Mr. Hamer and Frank Harvey, includes some sturdy observations on pliable, rebounding human decency in relating how the hero's blind, reminiscent hate needles the conscience of a suburban community, and eventually, through logic and new-found love, his own.\n\nAlthough the pat climax rattles with whirlwind melodrama, the incidents generally move on a restrained, even psychological keel, as the lonely, bitter occupant of a deserted Thames Estuary barge stalks his uneasy perjurers. And since Messrs. Hamer and Harvey show equal concern for these now respectable gentry, the picture mounts in substance and persuasion.\n\nThe photography throughout is effective, and is artful in the desolate, briny scouring of the hero's base of operations.\n\nAs the buffeted protagonist, the seasoned Mr. Mills is well-nigh perfect. Almost as effective are Mr. McCallum and Miss Sellars, as a sympathetic detective and his stricken spouse who are on Mr. Mills' black list. In smaller roles, Geoffrey Keen, John Slater and Thora Hird are fine, one and all, And as the refugee slavey who comes to love the hero, a newcomer named Eva Bergh, resembling a younger Wendy Hiller, is no less than glowing.\n\nMinus a single polaroid lens, Mr. Hamer and his colleagues have turned out a three-dimensional portrait of a man bucking injustice in an equally disturbed community of imperfect and real people.\n\n&quot;The Long Memory&quot; is by no means unforgettable. It does add up, however, to that most welcome of facsimiles, a good picture.\n\nTHE LONG MEMORY, screen play by Robert Hamer and Frank Harvey, from the novel by Howard Clewes; directed by Mr. Hamer and produced by Hugh Stewart; a J. Arthur Rank presentation distributed here by Astor Pictures Corporation. At the Beekman.\n\nIt's a British B-movie from the 1950s, so it's clear that while there's a woman sleeping at Davidson's place, she's just sleeping there, even if Eva Bergh's passionate voice suggests something else.\n\nCritics have proclaimed The Long Memory &quot;the lost masterpiece of British cinema.&quot;\n\nVIDEO\nSize.... 998mb\nDuration.... 01:29:21\nCodec.... divx\nFrame Width..... 608\nFrame Height.... 464\nData Rate.... 1460kbps\nFrame Rate.... 25 F/S\nAUDIO\nBit Rate.... 101kbps\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:8c8ff81621d295a8bfcfb3e8b744618f84d461fc","amp;dn":"The+Long+Memory+1953+DvdRip+Avi+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c8ff81621d295a8bfcfb3e8b744618f84d461fc","infoHashBuffer":{"type":"Buffer","data":[140,143,248,22,33,210,149,168,191,207,179,232,183,68,97,143,132,212,97,252]},"announce":[],"urlList":[]}}