{"title":"USA Today, 23 July 2013","uid":8729661,"size":2076086,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8ca55384e424fe8fe9c734db85320fae5a27595b&amp;dn=USA+Today%2C+23+July+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OrajelJunkie","files":-1,"time":1374568362,"description":"Created by Calibre\n\n\nArticles in this issue: \nHow safe is a roller coaster?\n\nNose gear fails as Southwest jet lands at LaGuardia\n\nD.C. crowds line up to view odd 'corpse flower'\n\nEx-staffer of San Diego mayor files sex harassment suit\n\nOhio man charged with murder after 3 bodies found\n\nWis. man who killed neighbor teen gets life term\n\nSkipping breakfast may increase heart attack risk\n\nWoman hits McDonald's drive-through ... on a pony\n\n'The Rifleman' says Bulger had a chilling routine\n\nFive things to know Tuesday\n\nJudge delays hearing on Detroit bankruptcy, pensions\n\nFederal judge delays North Dakota abortion law\n\nAdopted daughter murder trial in Mount Vernon\n\nStrong earthquake in western China kills at least 89\n\nMore bodies of immigrants being found near Texas border\n\nLeap Motion: Control your PC through air gestures\n\nLong-awaited OLED TVs finally hit stores\n\nDespite short-term success, challenges remain for Yahoo\n\nRoyalty disputes strike sour note in streaming music\n\nWhy Microsoft will win\n\nReport: Apple testing bigger iPhone, iPad screens\n\nGoogle Hangouts on air a success for L.A.TV station\n\nWhy erroneous payment card declines will keep rising\n\nNetflix gets more subscribers but sees shares slide\n\nCould Apple, Samsung be headed toward a settlement?\n\nForget second-screen apps: the TV Is the second screen\n\nCanadian tech start-ups making a U.S. connection\n\nProfessor plays a new kind of vintage vinyl\n\nWhy Google is testing encryption of Drive consumer data\n\nApple will regret throwing suppliers under the bus\n\nWeird and wacky festivals around the world\n\nBest poolside bars: Where to cool down with a cold one\n\nBeach etiquette: What not to do at the shore\n\nA 474-mile 'vacation': Cyclists pedal across Wisconsin\n\nLuxury hotels and resorts in California wine country\n\nGreat American Bites: KC's Gates proves chain BBQ can be great\n\nWhat to pack for a cruise\n\nThe coolest cruise ship features for families\n\nThe best views in Las Vegas\n\nLas Vegas' most luxurious bathrooms\n\nCarnival CEO: More big overhauls coming for older ships\n\nHotels' family-friendly claims can be exaggerated\n\nAsk the Captain: Advice for prospective pilots (part 2)\n\nBeach lover's Paris: Sun and sand on the Seine\n\nYour cat video could win you a trip to Park City\n\nFewer parents can pay college tuition\n\nWhat stocks do investors think will crash?\n\nRising rates aren't hurting home sales yet\n\nSenators again try to replace dollar bill with coin\n\nRieder: Why Nate Silver couldn't turn down ESPN\n\nTaco Bell dropping kids meals, toys\n\nAston Martin's birthday party draws thousands\n\nRoyal baby fever: +1 financial planning\n\nPurple? Pink? Chevrolet bets on wacky car colors\n\nSix Flags bracing for roller coaster death fallout\n\nWhat's the best way for small business to grow?\n\nHousing market back in focus as rates rise\n\nStocks end slightly higher, S&amp;P 500 sets record\n\nGold rush trash is Information Age treasure","torrent":{"xt":"urn:btih:8ca55384e424fe8fe9c734db85320fae5a27595b","amp;dn":"USA+Today%2C+23+July+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ca55384e424fe8fe9c734db85320fae5a27595b","infoHashBuffer":{"type":"Buffer","data":[140,165,83,132,228,36,254,143,233,199,52,219,133,50,15,174,90,39,89,91]},"announce":[],"urlList":[]}}