{"title":"Conservation and Restoration of Glass","uid":4841279,"size":27288575,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8dfd93b031a3accb6c2ae242694b968957ae89ec&amp;dn=Conservation+and+Restoration+of+Glass&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"philmccrevice","files":1,"time":1239515081,"description":"Without question, the author offers a useful and thorough reference on glass as a material, its historical development, and the mechanisms of deterioration and preservation...Sandra Davison has again provided the field of conservation with a thorough and up-to-date textbook. The book is more devoted to glass objects than the previous version, and topics have been expanded to reflect the significant developments in the field of glass conservation. The sections on architectural glass have been removed but replaced with useful information on chandeliers, installations, and reverse paintings on glass...Sandra Davison is an enthusiastic, extremely talented glass conservator who enjoys sharing her knowledge and hands-on skills widely. She has lectured, taught courses, and given demonstrations of techniques throughout the world, and she actively continues to improve our understanding and capabilities in the conservation of glass. The drawings that she provides in the book are lessons in themselves. The field of glass conservation is fortunate to have her commitment and authoritative expertise... Conservation and Restoration of Glass is a valuable resource for students, conservators, restorers, and anyone else who is interested in the complex nature and behaviour of glass","torrent":{"xt":"urn:btih:8dfd93b031a3accb6c2ae242694b968957ae89ec","amp;dn":"Conservation+and+Restoration+of+Glass","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dfd93b031a3accb6c2ae242694b968957ae89ec","infoHashBuffer":{"type":"Buffer","data":[141,253,147,176,49,163,172,203,108,42,226,66,105,75,150,137,87,174,137,236]},"announce":[],"urlList":[]}}