{"title":"Styx 24 Bit Vinyl Pack","uid":9485632,"size":4392834964,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8e22e816b3b928cdd2318083bef112b0dd8c8dc2&amp;dn=Styx+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1389883195,"description":"\n  Styx 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Arena Rock, Album Rock, Hard Rock, Prog-Rock\n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  1977 The Grand Illusion (Friday Music 180g)\n  1978 Pieces of Eight (Nautilus dbx LP)\n  1979 Cornerstone (A&amp;M Audiophile)\n  1981 Paradise Theater (A&amp;M Audiophile)\n  1983 Kilroy Was Here (A&amp;M Japan)\n\n  Although they began as an artsy prog rock band, Styx would eventually transform into the virtual arena rock prototype by the late '70s and early '80s, due to a fondness for bombastic rockers and soaring power ballads. The seeds for the band were planted in another Chicago band during the late '60s, the Tradewinds, which featured brothers Chuck and John Panozzo (who played bass and drums, respectively), as well as acquaintance Dennis DeYoung (vocals, keyboards). By the dawn of the '70s, the group had changed its name to TW4, and welcomed aboard a pair of guitarists/vocalists, James &quot;JY&quot; Young and John Curulewski -- securing a recording contract in 1972 with Wooden Nickel Records (a subsidiary of RCA). Soon after, the group opted to change its name once more, this time to Styx, named after a river from Greek mythology that ran through &quot;the land of the dead&quot; in the underworld.\n\n  Early on, Styx's music reflected such then-current prog rockers as Emerson, Lake &amp; Palmer and the Moody Blues, as evidenced by such releases as 1972's self-titled debut, 1973's Styx II, 1974's The Serpent Is Rising, and 1975's Man of Miracles. While the albums (as well as nonstop touring) helped the group build a substantial following locally, Styx failed to break through to the mainstream, until the track &quot;Lady,&quot; originally from their second album, started to get substantial airplay in late 1974 on Chicago radio station WLS-FM. The song was soon issued as a single nationwide, and quickly shot to number six on the singles chart, as Styx II was certified gold. By this time, however, the group had grown disenchanted with its record label, and opted to sign on with A&amp;M for their fifth release overall, 1975's Equinox (the band's former label would issue countless compilations over the years, culled from tracks off their early releases). On the eve of the tour in support of the album, Curulewski abruptly left the band, and was replaced by Tommy Shaw (sadly, Curulewski would pass away from an aneurysm in 1988). Shaw proved to be the missing piece of the puzzle for Styx, as most of their subsequent releases throughout the late '70s earned at least platinum certification (1976's Crystal Ball, 1977's The Grand Illusion, 1978's Pieces of Eight, and 1979's Cornerstone), and spawned such hit singles and classic rock radio standards as &quot;Come Sail Away,&quot; &quot;Renegade,&quot; &quot;Blue Collar Man,&quot; &quot;Fooling Yourself,&quot; and the power ballad &quot;Babe.&quot;\n\n  Despite the enormous success of &quot;Babe,&quot; it caused tension within the group -- specifically between Shaw and DeYoung (the latter of whom was the song's author), as the guitarist wanted Styx to continue in a more hard rock-based direction, while DeYoung sought to pursue more melodic and theatrically based works. This led to DeYoung's brief ouster from the group (although it was kept completely hush-hush at the time), before a reconciliation occurred. The bandmembers decided that their first release of the '80s would be a concept album, 1981's Paradise Theater, which was loosely based on the rise and fall of a once beautiful theater (which was supposedly used as a metaphor for the state of the U.S. at the time -- the Iranian hostage situation, the Cold War, Reagan, etc.). Paradise Theater became Styx's biggest hit of their career (selling over three million copies in a three-year period), as they became one of the U.S. top rock acts due to such big hit singles as &quot;Too Much Time on My Hands&quot; and &quot;The Best of Times.&quot; But the behind-the-scenes bickering only intensified in the wake of the album's success, as DeYoung was now convinced that a more theatrical approach was the future direction for Styx. Shaw and the rest of the group begrudgingly went along, and while the resulting follow-up was another hit, 1983's sci-fi-based Kilroy Was Here (which told the story of a future where rock &amp; roll was outlawed, almost a carbon copy of the story line of Rush's 2112), the album would eventually lead to the group's breakup -- as the ensuing prop-heavy tour seemed to focus more on scripted dialogue and lengthy films than good old rock &amp; roll.\n\n  A forgettable live album, Caught in the Act, was issued in 1984, before Styx went on hiatus, and the majority of the bandmembers pursued solo projects throughout the remainder of the decade. DeYoung issued 1984's Desert Moon (which spawned a moderate hit single with its reflective title track), 1986's Back to the World, and 1988's Boomchild, Young released 1986's City Slicker, while Shaw put forth several solo sets -- 1984's Girls with Guns, 1985's What If?, 1986's Live in Japan, and 1987's Ambition. Shaw then formed Damn Yankees along with former Night Ranger bassist/singer Jack Blades, guitarist Ted Nugent, and drummer Michael Cartellone, a group that enjoyed commercial success right off the bat with its self-titled debut in 1990 (due to the hit power ballad &quot;High Enough&quot;), before issuing an unsuccessful sophomore effort two years later, Don't Tread. During Shaw's tenure with Damn Yankees, Styx had re-formed with newcomer Glen Burtnik taking the place of Shaw -- issuing a new studio album in 1990, Edge of the Century, which spawned yet another hit power ballad, &quot;Show Me the Way.&quot; But the Styx reunion was a fleeting one, as the group's members went their separate ways shortly thereafter -- with DeYoung going on to play Pontius Pilate in a revival of Jesus Christ Superstar (and issuing an album of Broadway show tunes, 1994's 10 on Broadway), while Young issued a pair of solo discs (1994's Out on a Day Pass and 1995's Raised by Wolves), and Shaw teamed up with Jack Blades for the short-lived outfit Shaw Blades (issuing a lone recording in 1995, Hallucination).\n\n  A re-recording of their early hit &quot;Lady&quot; (titled &quot;Lady '95&quot;) for a Greatest Hits compilation finally united Shaw with his former Styx bandmates, which led to a full-on reunion tour in 1996. But drummer John Panozzo fell seriously ill at the time (due to a long struggle with alcoholism), which prevented him from joining the proceedings -- and he passed away in July of the same year. Although grief-stricken, Styx persevered with new drummer Todd Sucherman taking the place of Panozzo, as the Styx reunion tour became a surprise sold-out success, resulting in the release of a live album/video, 1997's Return to Paradise, while a whole new generation of rock fans was introduced to the grandiose sounds of Styx via a humorous car ad which used the track &quot;Mr. Roboto,&quot; as well as songs used in such TV shows as South Park and Freaks &amp; Geeks. The group even stuck around long enough to issue a new studio album, 1999's Brave New World, before friction within the band set in once again.\n\n  With the other Styx members wanting to soldier on with further albums and tours, DeYoung was forced to take a break when he developed an uncommon viral ailment, which made the singer extremely sensitive to light. DeYoung was able to eventually overcome his disorder, but not before Shaw and Young opted to enlist new singer Lawrence Gowan and issued a pair of live releases in the early 21st century -- 2000's Arch Allies: Live at Riverport (split 50-50 between Styx and REO Speedwagon) and 2001's Styx World: Live 2001. DeYoung began touring as a solo artist at the same time, and eventually attempted to sue Shaw and Young over the use of the name Styx (the lawsuit was eventually settled in late 2001). Around the same time, Chuck Panozzo confirmed rumors that he had contracted AIDS (but was battling the virus successfully), while the turbulent career of Styx was told in an entertaining episode of VH1's Behind the Music.\n\n  In the spring of 2003, a new studio album featuring Gowan arrived in stores. For Cyclorama, Styx consisted of Shaw, Young, Burtnik, Sucherman, and Gowan. The album also featured guest appearances from John Waite, Brian Wilson, and actor Billy Bob Thornton. By the end of the year, Burtnik was out of the band and replaced by former Bad English and Babys member Ricky Phillips, although Panozzo did play with the group on selected live dates. The two-CD Come Sail Away: The Styx Anthology from 2004 did an excellent job representing the band's career, while 2005's double-disc The Complete Wooden Nickel Recordings collected the band's first four albums. That same year, Styx released the cover version-filled Big Bang Theory, featuring some of their favorite picks from &quot;the Great Rock Songbook.&quot;","torrent":{"xt":"urn:btih:8e22e816b3b928cdd2318083bef112b0dd8c8dc2","amp;dn":"Styx+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e22e816b3b928cdd2318083bef112b0dd8c8dc2","infoHashBuffer":{"type":"Buffer","data":[142,34,232,22,179,185,40,205,210,49,128,131,190,241,18,176,221,140,141,194]},"announce":[],"urlList":[]}}