{"title":"Stay Up With Me - Tom Barbash.epub","uid":8994623,"size":696970,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e4168d80eaa5eea153bd86feacc3ba9c6115286&amp;dn=Stay+Up+With+Me+-+Tom+Barbash.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1380853746,"description":"A deeply humane, piercingly funny, and already widely acclaimed new short story collection that features men and women we all know or might be, nagivating a world made unfamiliar by a lapse in judgment, a change of fortune, by loss, or by love\n\n&quot;One of the most satisfying cover-to-cover short story collections I can remember.&quot;-Dave Eggers\n\nThe stories in Tom Barbash's evocative and often darkly funny collection explore the myriad ways we try to connect to one another and to the sometimes cruel world around us. The newly single mother in &quot;The Break&quot; interferes with her son's love life over his Christmas vacation from college. The anxious young man in &quot;Balloon Night&quot; persists in hosting his and his wife's annual watch-the-Macy's-Thanksgiving-Day-Parade-floats-be-inflated party, while trying to keep the myth of his marriage equally afloat. &quot;Somebody's Son,&quot; tells the story of a young man guiltily conning an elderly couple out of their home in the Adirondacks, and the young narrator in &quot;The Women&quot; watches his widowed father become the toast of Manhattan's mid-life dating scene, as he struggles to find his own footing.\n\nThe characters in Stay Up with Me find new truths when the old ones have given out or shifted course. In the tradition of classic story writer like John Cheever and Tobias Wolff, Barbash laces his narratives with sharp humor, psychological acuity, and pathos, creating deeply resonant and engaging stories that pierce the heart and linger in the imagination.","torrent":{"xt":"urn:btih:8e4168d80eaa5eea153bd86feacc3ba9c6115286","amp;dn":"Stay+Up+With+Me+-+Tom+Barbash.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e4168d80eaa5eea153bd86feacc3ba9c6115286","infoHashBuffer":{"type":"Buffer","data":[142,65,104,216,14,170,94,234,21,59,216,111,234,204,59,169,198,17,82,134]},"announce":[],"urlList":[]}}