{"title":"Picture Cutout Guide v2.10.3 Incl Crack [TorDigger]","uid":9082428,"size":5876355,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8ef0d13fe3a6663dd8e1032860c8fd0aa212620e&amp;dn=Picture+Cutout+Guide+v2.10.3+Incl+Crack+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":11,"time":1382401716,"description":"Picture Cutout Guide\n\nThe Picture Cutout Guide application was developed to be a program that will allow users to separate objects from the background and makes a photomontage. Picture Cutout Guide allows you to change the size or aspect ratio of an image keeping the &quot;important&quot; features intact and remove objects from photo without visible traces.\n\nWide Edge\nThis tool allows you to separate an object from its background, to apply background effects (filling, shadowing, blur), and to separately store an object for later pasting onto another image.\nSize - adjusts the size of the tool (tool size may be adjusted by rotating the mouse wheel, or by using the page up/down keys).\nSeparate - begin separating an object from its background. Wide edge must be indicated by the brush.\nClear - allows you to completely clear the wide edge.\nEffect - applies a selected background effect. An object must be separated from its background.\nSwap - swaps the object and its background. An effect must be applied previously.\nStore - stores the separated object for later pasting onto another image. An effect must be applied previously.\nDone - finishes processing after effect applying.\nBackground: Color - fills the background by selecting color.\nBackground: Shadow - reduces the background brightness. The shadow degree indicated by trackbar.\nBackground: Blur - blurs the background. The blur degree indicated by trackbar.\nBackground: Monochrome - makes the background monochrome by the selected color.\n\nPaste Object\nThis tool allows pasting an object (separated from its background by another tool) into an image. It also is possible to transform the object using vertical and horizontal reflection. The object selected for pasting is displayed on the tool top.\n\nRotation - allow you to rotate selected object at an arbitary angle.\nDelete - deletes the selected object. Deleted objects cannot be recovered.\nThumbnails of the objects that can be selected are displayed on the tool bottom. To select an object, click on its thumbnail.\n\nSupported OS:\n\nWindows XP / Vista / 7 / 8, both 32-bit and 64-bit.\n\nHomepage: http://tintguide.com/picturecutout.html\n\nInstallation Instructions:\n\n- Install program.\n- Copy content from crack folder and paste into default installation directory.\n- Done, Enjoy. \n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:8ef0d13fe3a6663dd8e1032860c8fd0aa212620e","amp;dn":"Picture+Cutout+Guide+v2.10.3+Incl+Crack+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ef0d13fe3a6663dd8e1032860c8fd0aa212620e","infoHashBuffer":{"type":"Buffer","data":[142,240,209,63,227,166,102,61,216,225,3,40,96,200,253,10,162,18,98,14]},"announce":[],"urlList":[]}}