{"title":"Power Engineering Scalar Field Theory - Faraday vs. Maxwell","uid":4406843,"size":710648986,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8fee2cd899fde7ea700e7a3bcefee9457681b4f8&amp;dn=Power+Engineering+Scalar+Field+Theory+-+Faraday+vs.+Maxwell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1222004835,"description":"This is Prof. Dr.-Ing. Konstantin Meyl&amp;#039;s mindblowing video lecture Power Engineering Scalar Field Theory - Faraday vs. Maxwell and Demonstration of Longitudinal Wave Transmission (2003) which explains how one can modify the basic equations of electromagnetic field to include longitudinal waves which results in a true revolution in electromagnetics. This short but highly informative presentation is probably the only one in existence for english-speaking audience to correctly expand the classical electromagnetic field theory to include longitudinal/Tesla waves. The impact of such an expansion is immense and requires a complete change in thinking and a revision of the very foundations of physics in general. Do scalar waves exist or not? In Meyl&amp;#039;s extended field theory they come about naturally eliminating the need for any &quot;exotic&quot; theories such as as superstrings, dark matter, revising even the theory of relativity. Meyl explains how Faraday&amp;#039;s experiments were actually describing a much broader electromagnetics than was later derived by Maxwell and curtailed to an even more primitive state by others so that today&amp;#039;s engineers are literally handicapped when using it. The missing experimental pieces eventually came from the work of Tesla and a small version of his wireless transmission of energy is demonstrated here, carrying electrical energy without losses to the other side of the table with an &quot;impossible&quot; 1.5-times the speed of light. During this amazing lecture Meyl takes you through the forgotten ideas of Nikola Tesla and explains how they are the missing pieces which prevented scientists to reach the goal of a comprehensible unified field theory. Along the course he also discusses many new applications which can now be not only better understood but also built and used in our every day life. Presented at the First Nikola Tesla Energy Science Conference &amp; Exposition 2003 in Washington DC before astonished audience who just couldn&amp;#039;t believe what they were seeing. 110 min. long. A must see for everyone.\n\nVideo specs:\nVideo codec: divx, 720x480, 768 bps\nAudio codec: mp3, 44kHz, Stereo\n","torrent":{"xt":"urn:btih:8fee2cd899fde7ea700e7a3bcefee9457681b4f8","amp;dn":"Power+Engineering+Scalar+Field+Theory+-+Faraday+vs.+Maxwell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fee2cd899fde7ea700e7a3bcefee9457681b4f8","infoHashBuffer":{"type":"Buffer","data":[143,238,44,216,153,253,231,234,112,14,122,59,206,254,233,69,118,129,180,248]},"announce":[],"urlList":[]}}