{"title":"The Anthony Cumia Show 2015-04-30 21 Grams of Cumia MP4 MP3","uid":11874108,"size":282889940,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:907a54a7fd13539c52e9fda777625ae6d568b1ae&amp;dn=The+Anthony+Cumia+Show+2015-04-30+21+Grams+of+Cumia+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1430499989,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nEpisode 155 &quot;21 Grams of Cumia&quot; - Thursday kicks off with Ant telling us about an issue he has with FiOS, the callers offer some suggestions, we check into a live police chase in LA, get an update about the new website, and wish Bobo a happy birthday. We look at a new clip of Geraldo reporting from Baltimore, hear about the protests in NY, Freddie Gray's injury possibly being self-inflicted, Anthony brags about his trial track record, discusses the Baltimore mayor's agenda with shitbag Rev Al, the empty Orioles vs. White Sox game, and we're introduced to an extremely memorable 21 gram dildo. We go through nightmarish sex toys, an ex-cop caller shares info on asphyxiation and injury during arrest, we read about &quot;virtual rape&quot;, Budweiser's new slogan, Ant talks about this new culture of being offended, crazy gamers, shift of interaction and concentration, video &quot;in game&quot; dollars, H1Z1, PC gaming making a comeback, and we find out that Ant knows way too much about horse and sheep fucking. Ant then chats about his home decor, trying out new games and taking recommendations, celebrity gamers, we see a clip of Atari's 1982 E.T. game being uncovered, and get a rundown of how Ant's weekend will go.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:907a54a7fd13539c52e9fda777625ae6d568b1ae","amp;dn":"The+Anthony+Cumia+Show+2015-04-30+21+Grams+of+Cumia+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"907a54a7fd13539c52e9fda777625ae6d568b1ae","infoHashBuffer":{"type":"Buffer","data":[144,122,84,167,253,19,83,156,82,233,253,167,119,98,90,230,213,104,177,174]},"announce":[],"urlList":[]}}