{"title":"[PDF] [2011] The Transforming Power of Prayer - From Illusion to","uid":6464580,"size":506838,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91f144d9beb2c9b532968632feaeb327ef4954d3&amp;dn=%5BPDF%5D+%5B2011%5D+The+Transforming+Power+of+Prayer+-+From+Illusion+to&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lyndavilla","files":2,"time":1307916518,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n   &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\n'We are here that we may learn to bear the beams of light', said Blake. This is the purpose of discipleship and the spiritual journey.\n\n\nCurrent public discussion of religion is characterized by conflict and acerbity. This is due in part to the deeply antagonistic structures of religious debates: science vs religion, theism vs atheism, creationism vs evolution, and so on. This book looks to Blake's and Wordsworth's poetry for a different type of interpretive engagement with religion: one that can include rather than exclude, and creatively interrelate rather than destructively set at odds different approaches to religion. The discussion focuses on a key religious vision of each poet, and finds its way into the question of religion via the reception history of academic and popular responses to these two visions: the autobiographical, biographical, historical, mystical, psychedelic, and theological. These different interpretations reflect different facets of the visions in question, and mirror their synthesizing inclusivity. As the two poets negotiate different personal and corporate experiences of religion, their poetry achieves this inclusive form of engagement not by seeking an unworldly perspective that has transcended such debates, but by making religious vision an open meeting ground for conflicting discourses.","torrent":{"xt":"urn:btih:91f144d9beb2c9b532968632feaeb327ef4954d3","amp;dn":"%5BPDF%5D+%5B2011%5D+The+Transforming+Power+of+Prayer+-+From+Illusion+to","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91f144d9beb2c9b532968632feaeb327ef4954d3","infoHashBuffer":{"type":"Buffer","data":[145,241,68,217,190,178,201,181,50,150,134,50,254,174,179,39,239,73,84,211]},"announce":[],"urlList":[]}}