{"title":"In Vlaamse Velden(2014) DVD5 NR4 (NL gespr)NLtoppers","uid":11010114,"size":4681746740,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:923c7bc4ea0f97b485ec5816df49646416c04e8e&amp;dn=In+Vlaamse+Velden%282014%29+DVD5+NR4+%28NL+gespr%29NLtoppers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Yakomo","files":-1,"time":1410345280,"description":"In Vlaamse Velden(2014) DVD5 NR4 (NL gespr)NLtoppers\n\n\nOktober 1916 - april 1917\nMarie wordt aangehouden aan de Belgisch-Nederlandse grens. Er wordt ontdekt dat zij een valse reispas heeft (die Hans-Peter voor haar heeft geregeld). Ze weet echter te ontsnappen en de grens over te steken. Een tijd later komt ze bij een boerderij aan. Via deze mensen komt ze terecht in Engeland, waar ze met verpleegsterstudies start. Ze ontmoet er ook haar broer Guillaume terug. De ontmoeting loopt op een sisser uit, wanneer het liederlijke leven van Guillaume ter sprake komt. Guillaume lijkt echter de liefde gevonden te hebben in Sarah Woods, de zus van John. In Gent wordt ontdekt dat Marie een spionne was. Kapitein Hoffman slaagt erin de andere Duitsers uit het huis van de familie Boesman te houden. Hij meldt ook aan Hans-Peter dat er onder de Duitsers iemand Marie aan een valse reispas heeft geholpen. Hij verdenkt Hans-Peter, maar spreekt dit niet openlijk uit. Dokter Boesman wordt professor anatomie, maar krijgt steeds meer tegenkanting omdat hij werkt in een zogenaamde Duitse universiteit. Aan het front onderwijst Vincent de Vlaamse ongeletterde soldaten. Aangezien dit echter dus in het Nederlands gebeurt, komt hem dit op zware kritiek van de bevelhebbende Franstalige officier te staan. Als hij en zijn kompanen verrast worden door een aanval, moeten ze vluchten. Wanneer Vincent een gewonde soldaat wil helpen, valt hij roerloos op de grond ...\nApril 1917 - november 1917\nVincent blijkt slechts licht gewond te zijn na de aanval. Hij belandt echter steeds dieper in de put, omdat hij fysiek op is. Marie heeft haar opleiding als verpleegster voltooid en komt in een veldhospitaal terecht. De gruwel van de oorlog wordt haar nu pas echt duidelijk. Op de universiteit vereist men een diploma van dokter Boesman. Hij blijkt voor het vak gynaecologie gebuisd te zijn destijds en mag daarom niet beginnen op de universiteit. Guillaume is terug uit Engeland. Wanneer hij ziet dat zijn liefje Anna wordt misbruikt door majoor Colle, slaat Guillaume Colle tegen de grond. Hierdoor is Guillaume niet meer welkom op de feestjes van John. Hij besluit om terug te keren naar het front. Zijn beste vriend, Jos, wil deserteren en wordt hiervoor veroordeeld tot de dood door de kogel. Het genadeschot wordt afgevuurd door Guillaume, tegen wil en dank. Vincent krijgt in De Panne ruzie met 2 Walen tijdens een dronken bui en wordt hiervoor tijdelijk opgesloten. Zijn zus Marie ontmoet hem hier en spreekt hem moed in om verder te gaan. Guillaume wordt door John betrapt wanneer hij aan het vrijen is met Anna. John is woedend omdat Guillaume zijn zus Sarah laat zitten, ondanks dat Guillaume John overtuigt dat Anna slechts een flirt is. Guillaume wil John dit duidelijk maken wanneer ze in de loopgraven zijn. Dan worden ze aangevallen ...\n***************************************\n10 delige reeks bestaande uit 5 DVD's \nBeeldformaat : 16:9\nspeelduur volledig : +/- 8 uur\nAudio Dolby Digital 2.0\nTaal : Nederlands\nOndertiteling voor doven en slechthorende\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2253780/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2253780/&lt;/a&gt;\n\n\nHeeft u deze film gezien en wilt u ergens een recensie achterlaten?\nga dan eens naar http://www.pheunix.nl\n\n[IMG]http://img411.imageshack.us/img411/5893/phpthumbgeneratedthumbnw.gif[/IMG]   \n\nNLtopper Yakomo","torrent":{"xt":"urn:btih:923c7bc4ea0f97b485ec5816df49646416c04e8e","amp;dn":"In+Vlaamse+Velden%282014%29+DVD5+NR4+%28NL+gespr%29NLtoppers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"923c7bc4ea0f97b485ec5816df49646416c04e8e","infoHashBuffer":{"type":"Buffer","data":[146,60,123,196,234,15,151,180,133,236,88,22,223,73,100,100,22,192,78,142]},"announce":[],"urlList":[]}}