{"title":"AVG Internet Security 2013 2013.0.2741 x86x64 Final","uid":7736638,"size":266388144,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:92d82da32212a10d8009b61e7e51fb751476ccd2&amp;dn=AVG+Internet+Security+2013+2013.0.2741+x86x64+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1350501733,"description":"Protection, which really speeds up your PC\nSome antivirus solutions slow down your computer, AVG Internet Security 2013 speeds up, improving download multimedia files. Faster boot time and support for Flash-video and HD video provides comfortable viewing of video on the Internet, such as YouTube.\nAVG Accelerator\nAVG Accelerator optimizes your computer is connected to the Internet, thus speeding up the loading of a variety of content. It improves the download binary files and minimizes the hangs and delays when playing videos on YouTube. AVG Accelerator is enabled by default at startup.\nAVG System Tools\nSystem Tools With AVG you can control the computer and turn off unneeded applications that are included when you start Windows, and the function of monitoring the system displays information about processes. With this tool, you can set the level of competence of trust within the computer, and the hazard of certain files.\nProtection from hackers and identity theft\nAVG Internet Security - it is not just antivirus: This system protects you when you shop and conduct banking operations, protecting your personal data. AVG Firewall prevents internal and external attacks, and Identity Protection technology ensures the safety of your personal data on the Internet.\nAVG Enhanced Firewall\nAVG Enhanced Firewall protects you from malicious attacks by data received on each network port. If the firewall detects penetration, he immediately blocks it and protecting your sensitive information from outside attacks, as well as in cases when a malicious program gets access to control your computer and tries to harm others. Enhanced Firewall AVG uses intelligent intrusion detection mechanisms to ensure the security of your home wireless and wired networks.\n\nThe main components of AVG Internet Security 2013:\nAntivirus and antispyware\nAnti-Rootkit\nWeb protection Surf-Shield\nOnline Scanner Online Shield\nProtection of personal data\nIdentity Alert\nEmail scanner\nAnti-spam\nPersonal firewall\nPC Analyzer\n\nMinimum system requirements:\n=#=Processor Intel Pentium 1.5 GHz or faster\n=#=Memory 512 MB of RAM\n=#=Hard disk free space (for installation) 1000 MB\n\nRecommended system requirements:\n=#=Processor Intel Pentium 1.8 GHz or faster\n=#=Memory 512 MB RAM\n=#=Hard disk free space (for installation) 1550 MB","torrent":{"xt":"urn:btih:92d82da32212a10d8009b61e7e51fb751476ccd2","amp;dn":"AVG+Internet+Security+2013+2013.0.2741+x86x64+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92d82da32212a10d8009b61e7e51fb751476ccd2","infoHashBuffer":{"type":"Buffer","data":[146,216,45,163,34,18,161,13,128,9,182,30,126,81,251,117,20,118,204,210]},"announce":[],"urlList":[]}}