{"title":"Engelmann DVR Converter 3.0.12.912","uid":7805244,"size":26522104,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:93dc27610cac1d31df83ac8747a8e58661ecfc79&amp;dn=Engelmann+DVR+Converter+3.0.12.912&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1352381000,"description":"Our DVR Converter converts videos in the formats mpeg/mpg, ts, mod, tod, vro, dvr, pvr, mts, m2ts, tp0 and trp to WMV, DivX/Xvid/HDX4/MPEG4 (.avi or .mp4), h.264 or MPEG2 compatible video streams. This leads to a high compatibility of your digital video recordings and you can process the newly created files with almost any other program or play them on a large number of hardware players.\n\nDVR Converter Highlights:\n- Accepts mpeg/mpg, ts, mod, tod, vro, dvr, pvr, mts, m2ts, tp0 and trp video files as input.\n- mpeg compatible files, made with devices from among other companies: Digital Everywhere, Opera, Siemens\n- ts compatible files, made with devices from among other companies: ABCom, AEG, Anubis, Arcon, Astro, Astrotel, Atevio, beyonwiz, Centarea, Comag, Compro, Conceptronic, Coolstream, Darkbox, DGStation, Digitalbox, Digittrade, Dream Multimedia bzw. Dreambox, DVICO, EasyOne, Ellion, Emtec, Geniatech, Genius, Hauppauge, Humax, Hyro, Icecrypt, icom, Kathrein, KNC ONE, KWorld, Medion, Megasat, Netgear, Octagon, Optibox, Orbitech, Pinnacle, Protek, Rebox, Samsung, Satelco, SetOne, SilverCrest, Sony, Teac, TechniSat, TechnoTrend, Telestar, Terratec, Toshiba, Trekstor, TwinHan, Zyxel\n- dvr compatible files, made with devices from among other companies: COMAG, Edision, Imperial, Micro electronic, Pearl, Preisner, Smart, Xoro\n- pvr compatible files, made with devices from among other companies: Targa TSR 5100 HDD and ADT\n- mts compatible files, made with devices from among other companies: AVCHD compatible cams from e.g. Canon and Panasonic, but also devices from Micronik\n- m2ts compatible files from e.g. Blu-ray discs\n- tp0 compatible files, made with devices from among other companies: Topfield, Dick Smith, Homecast, Hyundai, Jepssen, Mascom\n- trp compatible files, made with devices from among other companies: ABCom, Arion, BELdigital, CGV, Clarke-Tech, CreNova, DGStation, Dmsis, Edision, GSS, Hirschmann, Intek Digital, Inverto, Kaon, Lyngbox, NanoXX, OPTICUM, Pixx, Quelle or rather Universum, Schwaiger, Sezam\n- Converts videos to DivX/Xvid, h.264, MPEG2, MP4, DVD, SVCD and WMV compatible video files.\n- The video conversion automatically considers the correct aspect ratio.\n- Capable filters ensure optimum results when enlarging or reducing images.\n- Shows resolution, framerate and bitrate of input files\n- Burning of CDs and DVDs\n- Integrated player allows watching of all input videos before conversion!\n\nInstall:\n\n- run application\n- use keygen","torrent":{"xt":"urn:btih:93dc27610cac1d31df83ac8747a8e58661ecfc79","amp;dn":"Engelmann+DVR+Converter+3.0.12.912","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93dc27610cac1d31df83ac8747a8e58661ecfc79","infoHashBuffer":{"type":"Buffer","data":[147,220,39,97,12,172,29,49,223,131,172,135,71,168,229,134,97,236,252,121]},"announce":[],"urlList":[]}}