{"title":"Wanted / english / 1-6 / full story","uid":4388931,"size":124260380,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:93e5b9f86ae54ef7b936f8012ccc47b86a3e05f6&amp;dn=Wanted+%2F+english+%2F+1-6+%2F+full+story&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rucomics","files":18,"time":1221066885,"description":"ENGLISH -----\n\nanted is a comic book miniseries written by Mark Millar, with art by J. G. Jones. It was published by Top Cow in 2003 and 2004 as part of Millarworld.It features an amoral protagonist who discovers he is the heir to a career as a super-villainous assassin in a world where such villains have secretly taken control of the planet.\n\nThe series is adult in nature, similar to more grown-up &amp;#039;super-hero&amp;#039; titles such as The Authority or The Ultimates. Like the Authority or the Squadron Supreme, several characters are based on DC Comics characters and super-villains (See below). Critics agree with Kiralee in that the series also bears resemblance to the 1999 films Fight Club and the The Matrix, as it is about a despondent man in an unfulfilling white-collar life who attempts to change himself, but becomes extremely violent and marked as outside of &amp;#039;normal&amp;#039; society. It differs from these stories in that the main character has no desire to improve the world through this violence, but only embraces it in the pursuit of an escape from his previous life and selfish and egocentric pleasures.\n\nA film very loosely based on the comic was released in June 2008. It was directed by Timur Bekmambetov and starred James McAvoy, Angelina Jolie and Morgan Freeman. The film focuses on a league of self-righteous assassins rather than super-villains.\n\n\nRUSSIAN -----\n\nV 2003 godu imenityj avtor komiksov Mark Miller / Mark Millar, rabotavshij nad komiksom Tjomnyj Rycar&amp;#039; / The Dark Knight Returns sozdajot miniseriju komiksov novogo mira, s jarkim nazvaniem - Osobo opasen / Wanted.\n\nPolnaja informacija i vozmozhnost&amp;#039; oznakomitsja s drugimi komiksami na portale RUCOMICS.INFO\n\n","torrent":{"xt":"urn:btih:93e5b9f86ae54ef7b936f8012ccc47b86a3e05f6","amp;dn":"Wanted+%2F+english+%2F+1-6+%2F+full+story","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93e5b9f86ae54ef7b936f8012ccc47b86a3e05f6","infoHashBuffer":{"type":"Buffer","data":[147,229,185,248,106,229,78,247,185,54,248,1,44,204,71,184,106,62,5,246]},"announce":[],"urlList":[]}}