{"title":"Teardowns:Learn How Electronics Work by Taking Them Apart ","uid":6722108,"size":11628024,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95251379cde2f19aeec66a7b909cb133b51d35f1&amp;dn=Teardowns%3ALearn+How+Electronics+Work+by+Taking+Them+Apart+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317823280,"description":"                               **ATTENTION DOWN LOADERS**\n\n    If your using Adobe Acrobat you may\\may not have trouble displaying some\n \n      pages.This is not a problem with the file,it's a problem with Adobe.\n\n      The solution to this is to use &quot;Foxit Pdf Reader&quot; it will display all\n\n      Pages with no errors or problems.If you don't have it you can download\n\n      it from the site below.It's safe and free.\n\n\n                &lt;a href=&quot; http://www.foxitsoftware.com/Secure_PDF_Reader/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.foxitsoftware.com/Secure_PDF_Reader/&lt;/a&gt;\n\n\n*******************************************************************************\n\nLearn Practical Electronics From a Skilled Mentor!\n\n&quot;The text is written as if Dr. Bergeron, who is a highly experienced electronics practitioner, is speaking directly to the reader with a point-by-point commentary about each teardown, complete with clear explanations of the operation and function of every component. By the time the product is completely disassembled, the reader understands the design tricks, component selection, and packaging choices that enabled the product to reach the market.&quot; -- From the Foreword by Forrest M. Mims III\n\nAmp up your knowledge of electronics by deconstructing common devices and analyzing the revealed components and circuitry. Teardowns: Learn How Electronics Work by Taking Them Apart contains 14 projects that expose the inner workings of household appliances, workbench measuring instruments, and musical equipment. Discover how resistors, capacitors, sensors, transducers, and transistors function in real circuitry. You'll even get details on custom modifications to electric guitar pickups, an effects pedal, and a tube amp. Essential instructions for safely launching your own teardowns are also included in this hands-on guide.\n\n    * Learn about sensors and ICs from smoke detectors and motion-activated lights\n    * Work with the LCD and strain gauge transducers in a digital scale\n    * Discover how surge protectors, power conditioners, and UPS units function\n    * Study thermal design techniques in compact fluorescent bulbs\n    * Analyze the control systems in ultrasonic humidifiers and digital thermometers\n    * Understand how op amps and power ICs work in a hi-fi stereo amplifier\n    * Figure out how ultrasonic transducers work in a laser-guided measuring device\n    * Explore electric guitar pickups, effects pedals, and tube amplifiers\n\nMake Great Stuff!\nTAB, an imprint of McGraw-Hill Professional, is a leading publisher of DIY technology books for makers, hackers, and electronics hobbyists.\nAbout the Author\nBryan Bergeron is editor of Nuts &amp; Volts Magazine and Servo Magazine, the author of several hundred articles, and two dozen books, and owner of several patents. He teaches in the Harvard-MIT Division of Health Sciences and Technology. Bryan's company, Archetype Technologies, Inc., develops intelligent systems in the military.\nProduct Details\n\n    * Paperback: 352 pages\n    * Publisher: McGraw-Hill/TAB Electronics; 1 edition (July 13, 2010)\n    * Language: English\n    * ISBN-10: 0071713344\n    * ISBN-13: 978-0071713344\n","torrent":{"xt":"urn:btih:95251379cde2f19aeec66a7b909cb133b51d35f1","amp;dn":"Teardowns%3ALearn+How+Electronics+Work+by+Taking+Them+Apart+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95251379cde2f19aeec66a7b909cb133b51d35f1","infoHashBuffer":{"type":"Buffer","data":[149,37,19,121,205,226,241,154,238,198,106,123,144,156,177,51,181,29,53,241]},"announce":[],"urlList":[]}}