{"title":"Maria Muldaur - 1999 - Meet Me Where They Play the Blues FLAC","uid":9415484,"size":345483951,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:979f7f4f58cf2ab9af771a59b2e09fe4024356fc&amp;dn=Maria+Muldaur+-+1999+-+Meet+Me+Where+They+Play+the+Blues+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1388431942,"description":"Maria Muldaur - 1999 - Meet Me Where They Play the Blues\n\nMeet Me Where They Play the Blues captures Maria Muldaur at her sexy, sultry, sizzlin' best. Twenty-five years after she sent her camel to bed in &quot;Midnight at the Oasis,&quot; Muldaur delivers a soulful package of late-night blues gems bolstered by a top-notch supporting cast. Originally planning to record this material with the legendary singer/pianist Charles Brown, she ended up producing a tribute when Brown became too ill to join in. He was, however, able to sing a duet with Muldaur from his nursing home on &quot;Gee Baby, Ain't I Good to You,&quot; a performance that turned out to be his last. On the remaining tracks, the spirit of Brown's &quot;cool blues&quot; permeates the proceedings. Most of the songs are taken at slow to medium tempos, and Muldaur intimately caresses each lyric to squeeze out every drop of sensuality. The arrangements work to complement her delivery, with David Matthews' piano especially important in filling the space where Brown would have resided, and a three-piece horn section figuring prominently on several tracks. Jim Rothermel's clarinet and saxophone solos are particularly noteworthy. The opening duo of &quot;Soothe Me&quot; and &quot;I Wanna Be Loved&quot; set the tone for this disc, as Muldaur issues the irresistible invitation to &quot;love me 'til I'm numb with ecstasy.&quot; After proclaiming &quot;It Ain't the Meat, It's the Motion,&quot; she makes an offer that &quot;We Can Let It Happen Tonight.&quot; She reworks John Hiatt's contemporary blues standard, &quot;Feels Like Rain,&quot; into a completely new song; glides over a Creedence-like guitar lick on &quot;Blues So Bad&quot;; and leads a gospel chorus into &quot;The Promised Land.&quot; On &quot;All to Myself Alone,&quot; Gerry Grosz' vibes atmospherically accentuate the singer's sad tale. This is an album that transcends genre. Perhaps the theme song of Meet Me Where They Play the Blues is really &quot;He Don't Have the Blues Anymore,&quot; for on this recording, Muldaur delivers a surefire cure for even the most intractable case of the blues. (AllMusic)\n\nTrack list:\n01 - Soothe Me\n02 - I Wanna Be Loved\n03 - Gee Baby, Ain't I Good To You (duet with Charles Brown)\n04 - It Ain't The Meat, It's The Motion\n05 - We Can Let It Happen Tonight\n06 - Meet Me Where They Play The Blues\n07 - It Feels Like Rain\n08 - Blues So Bad\n09 - Misery And The Blues\n10 - He Don't Have The Blues Anymore (for Johnny Adams and Charles Brown)\n11 - All To Myself Alone\n12 - The Promised Land\n\nPersonnel:\nMarty Grebb - piano\nMaria Muldaur\nDanny Caron\nJim Rothermel - clarinet, alto &amp; tenor saxophones\nReggie McBride - bass ;\nDavid Matthews\nAnthony Paule - guitar\nKevin Porter - trombone, bass trombone, tuba\nSteve Campos - trumpet, cornet, flugelhorn\nCranston Clements\nChris Burns - piano, organ\nGerry Grosz - vibraphone\nCharles Brown - guest artist\n\nEnjoy and share!","torrent":{"xt":"urn:btih:979f7f4f58cf2ab9af771a59b2e09fe4024356fc","amp;dn":"Maria+Muldaur+-+1999+-+Meet+Me+Where+They+Play+the+Blues+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"979f7f4f58cf2ab9af771a59b2e09fe4024356fc","infoHashBuffer":{"type":"Buffer","data":[151,159,127,79,88,207,42,185,175,119,26,89,178,224,159,228,2,67,86,252]},"announce":[],"urlList":[]}}