{"title":"M.A.R.S. Patrol Total War (Gold Key)","uid":5382718,"size":157659562,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:984bade19c7d72bb9ddf34ad0d2698ada07c6bd5&amp;dn=M.A.R.S.+Patrol+Total+War+%28Gold+Key%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1266791202,"description":"M.A.R.S. Patrol Total War was a short-lived science fiction/war comic book series published by Gold Key Comics for 10 issues from July 1965 to August 1969.  The artist on the first 3 issues was Wally Wood, who probably had a hand in creating the series. In 1966 the comic won an Alley Award for Best Normal Group Adventure Title.\n\nThe comic told of an invasion of all nations of the Earth by unknown invaders who used teleportation to appear at different destinations.  The invaders used weapons similar to what was then currently in use with each one having a night vision device on their helmet.  The invaders make no demands, but kill anyone (military or civilian) in their path and prefer to kill themselves rather than surrender.\nOpposing them is the M.A.R.S. (Marine Attack Rescue Service) Patrol of the United States Marine Corps. The MARS Patrol combat teams are a combination of commandos, paratroops, and guerrillas. The main focus is on one team composed of Lt. Cy Adams, leader and combat pilot; Corporal Russ Stacey, weapons expert and commando; Sgt. Joe Stryker, demolitions expert and paratrooper; and Sgt Ken Hiro, frogman and skilled martial artist. The team is also ethnically diverse, with Stryker an African-American and Hiro a Japanese-American.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:984bade19c7d72bb9ddf34ad0d2698ada07c6bd5","amp;dn":"M.A.R.S.+Patrol+Total+War+%28Gold+Key%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"984bade19c7d72bb9ddf34ad0d2698ada07c6bd5","infoHashBuffer":{"type":"Buffer","data":[152,75,173,225,156,125,114,187,157,223,52,173,13,38,152,173,160,124,107,213]},"announce":[],"urlList":[]}}