{"title":"300 (2007) - Greek Subtitles (Optional) - By Omifast","uid":4418623,"size":666357691,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9904a944434e1ab4690d1fdafbd2a839f9c39eeb&amp;dn=300+%282007%29+-+Greek+Subtitles+%28Optional%29+-+By+Omifast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OmifastGR","files":5,"time":1222655246,"description":"If nobody seeding check my Blog &lt;a href=&quot;\nhttp://akykloforita.blogspot.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://akykloforita.blogspot.com/&lt;/a&gt;\n\n300 (2007) - Starring: Gerard Butler, Lena Headey, Michael Fassbender,Dominic West\n\nThis is a Hight Quality Nero Digital Movie!\n\nThis Movie Recode it from the Original DVD.\n\nSpoken Languages: English.\n\nSubtitles: Greek.\n\nYou can download first, the included 16 Mb sample of this rip\nand if you like the quality you can download the main movie.\n\n================================================\nBut If You Want To Change Language Or Subtitles,\nYou Must Have Nero ShowTime Player.\n================================================\n\nYou can find Nero ShowTime player as part of Nero 6  on file My Older Uploads.\n\nImage\nhttp://img258.imageshack.us/img258/3796/threehundredver13xlgzt6.jpg\n\nTrailer\nhttp://www.trailerfan.com/movie/300/trailer\n\nSummary\nIt is spring 480 BC, Persian King Xerxes, continuing his father Darius' master plan to conquer the Hellenic city-states, arrives in Hellas. The previous Persian invasion and diplomatic attempts have already turned most northern Hellas tribes and states to the Persian side. But the people of Athens and Sparta, the largest Hellenic powers at the time, feel quite insulted by the Persian emissaries' request to surrender to Xerxes, and so slay them. In Sparta, King Leonidas consults the local oracle, who gives two options: Either a spartan king will have to be sacrificed, or Sparta will be burned to the ground. A year earlier (481, BC) a Panhellenic consortium of all southern city-states had already recognized the superiority of the Spartan army (the best organized and trained army at the time) and had declared King Leonidas as supreme commander of the combined Hellenic army. It is then decided that a small force should block Xerxes' way to southern Hellas in the Thermopylae passage. This passage was, at that time, 12 meters wide. The great historian Herodotus, possibly exaggerating, states that there were 1,700,000 Persians (their true number could have been anywhere from 100,000 to 1,000,000) against 7,000 Hellenic hoplites and slaves, including the 300 men of the Spartan King elite guard. King Xerxes waited four days for the Hellenes to be frightened and eventually surrender and was quite astonished by his opponents' complete apathy. Xerxes tried to convince Leonidas to drop weapons, give up his position, kneel before him and live on as a local governor under Xerxes. King Leonidas replied &quot;molon lave,&quot; which means &quot;Come and get them.&quot; The three-day battle began, with the 300 Spartans and 700 Thespians (the other Hellenes where sent by Leonidas to protect passages to their flanks) slaying thousands of Persians with minimal losses. The whole Persian campaign would have failed if it hadn't been for Efialtes, who showed Xerxes a secret passage to the Hellenic flanks. After a final battle led by King Xerxes himself, the Hellenic force was slain and their heroism and glory was written forever in history. From the beginning of the battle, the Hellenes buried their dead in the spot where they fell. Then battle signs where made for the dead of each Hellenic faction. For the Pelloponisians, (including the 300 Spartans) the sign generally read (free translation) &quot;In this place 4,000 Pelloponisians fought 30 millions).&quot; For the 300 Spartans (Lakaedaemonians), the sign reads (free translation) &quot;Oh foreigner, tell the Lakaedaemonians that we are buried here obeying their laws,&quot; meaning that they never hesitated and never retreated from the enemy. The impact of the battle was enormous for both sides. The Persians' morale dropped to zero, and the Hellenes lost their fear for the Persian conqueror and organized their defense. After several successful battles, the Hellenes ultimately defeated the Persian army and repelled their invasion in the Battle of Plataea in 479 BC. Written by Harris o Harros\n\nPlease be kind enough to seed my torrents\n\nThank You All.\n\nps. If nobody seeding please post a request and i will seed immediately !\n","torrent":{"xt":"urn:btih:9904a944434e1ab4690d1fdafbd2a839f9c39eeb","amp;dn":"300+%282007%29+-+Greek+Subtitles+%28Optional%29+-+By+Omifast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9904a944434e1ab4690d1fdafbd2a839f9c39eeb","infoHashBuffer":{"type":"Buffer","data":[153,4,169,68,67,78,26,180,105,13,31,218,251,210,168,57,249,195,158,235]},"announce":[],"urlList":[]}}