{"title":"The Wheels That Drove New York - A History of the New York City ","uid":9203778,"size":20956853,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:991c68252a58f9a2f817691dae8400f31fa36703&amp;dn=The+Wheels+That+Drove+New+York+-+A+History+of+the+New+York+City+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1384644205,"description":"Roger P. Roess, Gene Sansone, &quot;The Wheels That Drove New York: A History of the New York City Transit System&quot; \nEnglish | ISBN: 3642304834 | 2013 | 499 pages | PDF | 20 MB\n\nThe Wheels That Drove New York tells the fascinating story of how a public transportation system helped transform a small trading community on the southern tip of Manhattan island to a world financial capital that is home to more than 8,000,000 people. From the earliest days of horse-drawn conveyances to the wonders of one of the world's largest and most efficient subways, the story links the developing history of the City itself to the growth and development of its public transit system. Along the way, the key role of played by the inventors, builders, financiers, and managers of the system are highlighted.\n\nNew York began as a fur trading outpost run by the Dutch West India Company, established after the discovery and exploration of New York Harbor and its great river by Henry Hudson. It was eventually taken over by the British, and the magnificent harbor provided for a growing center of trade. Trade spurred industry, initially those needed to support the shipping industry, later spreading to various products for export. When DeWitt Clinton built the Erie Canal, which linked New York Harbor to the Great Lakes, New York became the center of trade for all products moving into and out of the mid-west.\n\nAs industry grew, New York became a magnate for immigrants seeking refuge in a new land of opportunity. The City's population continued to expand. Both water and land barriers, however, forced virtually the entire population to live south of what is now 14th Street. Densities grew dangerously, and brought both disease and conflict to the poorer quarters of the Five Towns. To expand, the City needed to conquer land and water barriers, primarily with a public transportation system.\n\nBy the time of the Civil War, the City was at a breaking point. The horse-drawn public conveyances that had provided all of the public transportation services since the 1820's needed to be replaced with something more effective and efficient. First came the elevated railroads, initially powered by steam engines. With the invention of electricity and the electric traction motor, the elevated's were electrified, and a trolley system emerged. Finally, in 1904, the City opened its first subway. From there, the City's growth to northern Manhattan and to the &quot;outer boroughs&quot; of Brooklyn, Queens, and the Bronx exploded.\n\nThe Wheels That Drove New York takes us through the present day, and discusses the many challenges that the transit system has had to face over the years. It also traces the conversion of the system from fully private operations (through the elevated railways) to the fully public system that exists today, and the problems that this transformation has created along the way.","torrent":{"xt":"urn:btih:991c68252a58f9a2f817691dae8400f31fa36703","amp;dn":"The+Wheels+That+Drove+New+York+-+A+History+of+the+New+York+City+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"991c68252a58f9a2f817691dae8400f31fa36703","infoHashBuffer":{"type":"Buffer","data":[153,28,104,37,42,88,249,162,248,23,105,29,174,132,0,243,31,163,103,3]},"announce":[],"urlList":[]}}