{"title":"Noise and the Brain Experience Dependent Developmental and Adult","uid":9383745,"size":4788701,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:991d11647367468c7477f9255e778c3786444cef&amp;dn=Noise+and+the+Brain+Experience+Dependent+Developmental+and+Adult&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":5,"time":1387761053,"description":" In our industrialized world, we are surrounded by occupational, recreational, and environmental noise. Very loud noise damages the inner-ear receptors and results in hearing loss, subsequent problems with communication in the presence of background noise, and, potentially, social isolation. There is much less public knowledge about the noise exposure that produces only temporary hearing loss but that in the long term results in hearing problems due to the damage of high-threshold auditory nerve fibers. Early exposures of this kind, such as in neonatal intensive care units, manifest themselves at a later age, sometimes as hearing loss but more often as an auditory processing disorder. There is even less awareness about changes in the auditory brain caused by repetitive daily exposure to the same type of low-level occupational or musical sound. This low-level, but continuous, environmental noise exposure is well known to affect speech understanding, produce non-auditory problems ranging from annoyance and depression to hypertension, and to cause cognitive difficulties. Additionally, internal noise, such as tinnitus, has effects on the brain similar to low-level external noise. \nNoise and the Brain discusses and provides a synthesis of hte underlying brain mechanisms as well as potential ways to prvent or alleviate these aberrant brain changes caused by noise exposure. \nAuthored by one of the preeminent leaders in the field of hearing research \nEmphasizes direct and indirect changes in brain function as a result of noise exposure \nProvides a comprehensive and evidence-based approach \nAddresses both developmental and adult plasticity \nIncludes coverage of epidemiology, etiology, and genetics of hearing problems; effects of non-damaging sound on both the developing and adult brain; non-auditory effects of noise; noise and the aging brain; and more.","torrent":{"xt":"urn:btih:991d11647367468c7477f9255e778c3786444cef","amp;dn":"Noise+and+the+Brain+Experience+Dependent+Developmental+and+Adult","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"991d11647367468c7477f9255e778c3786444cef","infoHashBuffer":{"type":"Buffer","data":[153,29,17,100,115,103,70,140,116,119,249,37,94,119,140,55,134,68,76,239]},"announce":[],"urlList":[]}}