{"title":"Jackie Leven-album","uid":5535806,"size":1373089988,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:99e51476509e300f84d8cab0357705e8e1f6f984&amp;dn=Jackie+Leven-album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"flitigalisa","files":189,"time":1273065636,"description":"\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/flitigalisa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/flitigalisa&lt;/a&gt;\n\nJackie Leven, born June 18, 1950 in Kirkcaldy, Fife, Scotland is a Scottish songwriter and folk music musician.\nJackie Leven made his first forays into the music business in the late 1960s under the pseudonym &quot;John St Field&quot; and recorded one album, Control, in 1971. Leven admits this is probably his favourite album and he loves the bass playing, which is all his.\nIn the following years he travelled, but enthusiastic about punk, he formed the band Doll by Doll in 1978. Despite having a unique and powerful live act, this band never broke through to the mainstream. They released four albums between 1979 and 1982. Blending LSD visions, folk, blues, Celtic, psychedelic and punk influences the band, which featured Leven as main songwriter, often explored the darker side of human nature (&quot;Butcher Boy&quot;, &quot;Sleeping Partners&quot;, &quot;The Palace of Love&quot;), contrasted with the tough, almost macho tenderness of songs such as &quot;Stripshow&quot;, &quot;Chances&quot; and &quot;Hey Sweetheart&quot;.\nAfter Doll by Doll disintegrated in 1983, Leven embarked on his solo career. However, a vicious and unprovoked assault in the street during the recording of his first solo album in 1984 left him unable to speak for nearly two years - the after-effects of near strangulation. During this time he slid into heroin addiction. Despite this he managed to collaborate with fellow ex-Doll by Dolls Joe Shaw and David Macintosh plus ex-Sex Pistol Glen Matlock to release the single &quot;Big Tears&quot; under the name &quot;Concrete Bulletproof Invisible&quot;. The record was a Melody Maker single of the week in 1988. He eventually cured himself of his addiction though a mixture of acupuncture and psychic healing: this led him to form the CORE Trust, which favours a holistic approach to the treatment of heroin addiction.\nIn 1994 his solo career started in earnest with the release of the album The Mystery of Love is Greater than the Mystery of Death, which earned much critical praise. Since then he has been extremely prolific, releasing another 15 official albums, including a joint album with crime writer Ian Rankin Jackie Leven Said, featuring the keyboards of Michael Cosgrave. In addition to these official releases, he has released a number of limited edition, fanclub-only live albums through the Haunted Valley fanzine and website.\nIn 2006 Leven released the album Songs For Lonely Americans using the pseudonym &quot;Sir Vincent Lone&quot;. A second Sir Vincent Lone CD, When The Bridegroom Comes (Songs For Women), was recorded a year later: initially sold only at live shows, it proved so successful that it eventually saw commercial release by his record company, Cooking Vinyl. This is what Leven had to say about the Sir Vincent pseudonym on the Cooking Vinyl webpage:\n\nPlease SEED and enjoy, thanks........!\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:99e51476509e300f84d8cab0357705e8e1f6f984","amp;dn":"Jackie+Leven-album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99e51476509e300f84d8cab0357705e8e1f6f984","infoHashBuffer":{"type":"Buffer","data":[153,229,20,118,80,158,48,15,132,216,202,176,53,119,5,232,225,246,249,132]},"announce":[],"urlList":[]}}