{"title":"JoJos Circus","uid":4684866,"size":5295174537,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9a61a9582b4fd1311419582e4dd1037453cb4025&amp;dn=JoJos+Circus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"katnap","files":-1,"time":1233197670,"description":"Here are 39 episodes of the claymation series &quot;JoJo's Circus&quot; which airs on the Disney Channel. The series is aimed at preschool-kindergarten students and focuses on problem-solving and physical movement. The protagonist is a five- or six-year-old clown who has mini-adventures in and around the collection of circus tents in which she and her family live. Each show is about 11 minutes long, and each features a short song which encourages the audience to move along.\n\nThe shows were originally aired in a certain order, with two 11-minute shows being tied together and collectively assigned an episode number. Although no two shows so grouped contain related content, I have preserved that number system in the filenames of my .avi's. For instance, &quot;S01.E04.p02&quot; means Season 1, Episode 4, Part 2. The episodes were transferred from VHS to .avi, and I would say the quality is about 95% of what you would find on a DVD. A few episodes have about a quarter second of missing content where two files were joined together, and four of the 11-minute parts have a thin line (about the size of pencil lead) running along the top of the screen that is a different color from the rest of the display. Neither flaw detracts from the viewing experience.\n\nThe shows are cute without being sickly-sweet, and the content is engaging to little ones without being annoying for parents to watch repeatedly. The collection I have consists of the majority of of Season 1 and a few episodes from Season 2, and is incomplete. If you have recordings from any of the missing episodes or later seasons, message me and I would be happy to seed.","torrent":{"xt":"urn:btih:9a61a9582b4fd1311419582e4dd1037453cb4025","amp;dn":"JoJos+Circus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a61a9582b4fd1311419582e4dd1037453cb4025","infoHashBuffer":{"type":"Buffer","data":[154,97,169,88,43,79,209,49,20,25,88,46,77,209,3,116,83,203,64,37]},"announce":[],"urlList":[]}}