{"title":"Bridge Constructor Stunts v1.3","uid":12648002,"size":46347915,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:9ac26a54d86eabf6b266026f98b851fea5cb5f30&amp;dn=Bridge+Constructor+Stunts+v1.3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":1,"time":1446082750,"description":"The successful Bridge Constructor series – number 1 in the Google Play Store with over 30 million players worldwide – treads new paths with Bridge Constructor Stunts!\r\n\r\nStuntman and engineer in one? No problem with Bridge Constructor Stunts!\r\nBuild imposing ramps and loops to reach your goal in the diverse stages. But building structures alone isn't enough this time: you sit behind the wheel of the vehicles yourself and have to maneuver them skillfully to the goal. \r\n\r\nCollect stars, complete daredevil jumps, flips and spectacular stunts, leaving behind a trail of destruction across the entire level to beat the high score. But you can only do all that with perfectly constructed bridges and ramps.\r\n\r\nJoin the huge Let's Play community\r\nTo ensure none of your jumps are forgotten, you can save your runs as videos, upload them via the sharing feature and share them with your friends. Let the world be part of your most outrageous jumps!\r\n\r\nImproved Construction Mode\r\nOnce again you have access to a variety of building materials with different properties. Numerous improvements make building even easier: simply tap to convert a beam you have built into road, and vice-versa. Tap and hold on a part of the construction and you now have the option to reposition your structures without having to build them from scratch.\r\n\r\nLoose Screw!\r\nWe have hidden some hard-to-reach screws in some of the levels. Find and collect them, and you might be able to put these screws to good use in the future...\r\n\r\nFEATURES:\r\n\r\n- The latest instalment in the internationally successful Bridge Constructor series!\r\n- Improved and simplified Construction Mode\r\n- Build ramps and drive vehicles across them yourself\r\n- Diverse levels with different objectives: collect stars, score target, reach the goal…\r\n- Delivery vans and dump trucks with cargo that wreaks havoc when coming loose, but is also useful to help you collect items\r\n- Various building materials\r\n- Spectacular stunts and rampages of destruction\r\n- Achievements and rankings\r\n- Replay feature and video sharing: save your best bridge crossings and stunts and share them with your friends\r\n- Google Play Game Services for Achievements and Leaderboards\r\n- Tablet support \r\n\r\nWhat's New:\r\n\r\n- Various bug fixes\r\n- Various level fixes\r\n- Video sharing (Everyplay) now supports camera and audio recording\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.headupgames.bridgeconstructorstunts","torrent":{"xt":"urn:btih:9ac26a54d86eabf6b266026f98b851fea5cb5f30","amp;dn":"Bridge+Constructor+Stunts+v1.3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ac26a54d86eabf6b266026f98b851fea5cb5f30","infoHashBuffer":{"type":"Buffer","data":[154,194,106,84,216,110,171,246,178,102,2,111,152,184,81,254,165,203,95,48]},"announce":[],"urlList":[]}}