{"title":"Eagle-Eye Cherry - Living In the Present Future 2000","uid":7027775,"size":326169182,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9b883f35a23dd40deb2f4bc6dd270e0aef26470b&amp;dn=Eagle-Eye+Cherry+-+Living+In+the+Present+Future+2000&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1329125062,"description":"Eagle-Eye Lanoo Cherry (born May 7, 1971) is a Swedish musician.\nCherry was born in Stockholm, Sweden, the son of African American jazz artist Don Cherry and Swedish painter/textile artist Monika 'Moki' Cherry (nee Karlsson). He is half-brother of singer Neneh Cherry, his mother's daughter, and stepbrother to singer Titiyo. He was named Eagle-Eye because the first time he looked at his father, he did so with only one eye open. As children, Eagle-Eye and Neneh spent months on the road with their father. At the age of 12, Cherry was sent to school in New York, where he stayed on to work as an actor and a drummer in various bands. In 1988, he was credited as 'teenager' in the film Arthur 2: On the Rocks. In 1993 he starred on the short-lived NBC action/adventure television show South Beach.\nHis father died in 1995. In 1996 Cherry moved back to Stockholm to focus on his music over the acting career that had taken precedence in his professional life. He began writing and recording his debut album, Desireless in his bedroom studio on an acoustic guitar. According to manager Tommy Manzi, Cherry's perfectionism made him keep the recordings under wraps until the album was virtually complete. The album became a commercial success throughout the world during 1998 and 1999. Desireless went platinum in the United States, selling a total of four million copies worldwide.\nCherry co-wrote and sang on 'Wishing It Was' on Santana's 1999 album Supernatural, as well as in films such as Wim Wenders' The Soul of a Man, Y tu mama tambien, The Love of the Game, GO, Best Laid Plans, Holes, Billy Elliot and Over Her Dead Body. Some of his best known songs include 'Save Tonight', 'Falling in Love Again', 'Are You Still Having Fun', 'Long Way Around', 'Feels So Right', 'Skull Tattoo' and 'Don't Give Up'.\n\n- - -\n\nLiving in the Present Future is the second studio album by Swedish rock singer-songwriter Eagle-Eye Cherry. It was released in 2000. In the three-year gap between 1997's 'Desireless' and this release, he left Epic subsidiary Work and came to MCA, wherein he worked with such producers as The Dust Brothers and Rick Rubin . (wikipedia)\n\n- - -\n\nEagle-Eye Cherry - Living in the present future 2000\n(Solna Superstudio blÃƒÂ¥)\n\n 1. Been here once before \n 2. Are you still having fun? \n 3. One good reason \n 4. Promises made \n 5. Burning up \n 6. Together \n 7. Long way around \n 8. Lonely days (miles away) \n 9. First to fall \n10. Miss Fortune \n11. She didn't believe \n12. Shades of gray\n\nEagle-Eye Cherry: Vocals, Keyboards, Piano\nMats Asplen: Fender Rhodes Electric Piano, Organ, Moog Synthesizer\nPatrick Warren: Chamberlin\nKlas Ahlund, Eric Schermerhorn, Mattias Torrell, Christopher Watkins: Guitars\nOlav Gustaffson: Pedal Steel\nSpencer Campbell, Peter Fors, Benny Rietveld: Bass\nJim Bogios, Rodney Holmes, Magnus Persson: Drums\nDominic Keyes, Karl Perazzo, Raul Rekow: Percussion\nPer 'Texas' Johansson: Sax\nGoran Kajfes: Trumpet\n","torrent":{"xt":"urn:btih:9b883f35a23dd40deb2f4bc6dd270e0aef26470b","amp;dn":"Eagle-Eye+Cherry+-+Living+In+the+Present+Future+2000","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b883f35a23dd40deb2f4bc6dd270e0aef26470b","infoHashBuffer":{"type":"Buffer","data":[155,136,63,53,162,61,212,13,235,47,75,198,221,39,14,10,239,38,71,11]},"announce":[],"urlList":[]}}