{"title":"Encyclopedia of Neuroscience (10 Volume Set) (2009).pdf Gooner","uid":12178236,"size":353296995,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c3eb1036e31dc8294f064ec9c1f4ab613a1a28a&amp;dn=Encyclopedia+of+Neuroscience+%2810+Volume+Set%29+%282009%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1438361157,"description":"Publisher: Academic Press; 1 edition (June 11, 2009)\nLanguage: English\nISBN-10: 0080446175\nISBN-13: 978-0080446172\n\nThe Encyclopedia of the Neuroscience explores all areas of the discipline in its focused entries on a wide variety of topics in neurology, neurosurgery, psychiatry and other related areas of neuroscience. Each article is written by an expert in that specific domain and peer reviewed by the advisory board before acceptance into the encyclopedia. Each article contains a glossary, introduction, a reference section, and cross-references to other related encyclopedia articles. Written at a level suitable for university undergraduates, the breadth and depth of coverage will appeal beyond undergraduates to professionals and academics in related fields. Arranged alphabetically by title, the articles encompass 10 volumes, making this the authoritative reference for the field. \n\n* Provides comprehensive coverage of neuroscience in 10 volumes \n* 32 separate areas of neuroscience and neurology covered for breadth and depth of content\n* Language is accessible for undergraduates, depth appropriate for scientists\n* Authored and edited by world class researchers in neuroscience, followed by peer review\n* Extensive use of figures, tables, and color illustrations and photographs\n* Glossaries, further reading suggestions, and cross-references provide additional tools to understand material \n* Index provides opportunities to find entries under multiple relevant terms or find related material easily\n* Available in print and online versions","torrent":{"xt":"urn:btih:9c3eb1036e31dc8294f064ec9c1f4ab613a1a28a","amp;dn":"Encyclopedia+of+Neuroscience+%2810+Volume+Set%29+%282009%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c3eb1036e31dc8294f064ec9c1f4ab613a1a28a","infoHashBuffer":{"type":"Buffer","data":[156,62,177,3,110,49,220,130,148,240,100,236,156,31,74,182,19,161,162,138]},"announce":[],"urlList":[]}}