{"title":"Schlafkrankheit aka Sleeping Sickness 2011 DVDRip Sonata Premier","uid":7988036,"size":885924453,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9c7ca6cf55cc32ac2bc934f82e661409e26f56ab&amp;dn=Schlafkrankheit+aka+Sleeping+Sickness+2011+DVDRip+Sonata+Premier&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"klinho","files":4,"time":1357331830,"description":"Ulrich Kohler's uneven Competition film Sleeping Sickness contrasts the \nrelationship that two doctors, one a white German, the other a black Frenchmen,\nhave with Africa. Pierre Bokma plays Dr. Ebbo Velten, whose long-term program to combat sleeping sickness has been so successful that it risks losing the funds that keep it going. His wife Vera (Jenny Schily) is keen to return to Germany and their \ndaughter Helen (Maria Elise Miller) has lost interest in Africa after two years at \nhome in boarding school.A transition is in the works with another doctor set to move in to his hospital and so Veltman's wife and daughter return to Germany while the doctor wraps things up. At this point, the film abruptly skips some years and changes point of view with the introduction in France of young Dr. Alex Nzila (Jean-Christophe Folly), who is despatched by the World Health Organization to Cameroon where Velten has continued to operate.Urban, gay and very French, Nzila finds the clinic in disarray and Veltman absent. The epidemic of sleeping sickness appears to have been beaten but Veltman has become more eccentric and conflicted over his love for the place.\n\n\nLanguages: German / French\n\nSubs srt: Portuguese / English / Spanish","torrent":{"xt":"urn:btih:9c7ca6cf55cc32ac2bc934f82e661409e26f56ab","amp;dn":"Schlafkrankheit+aka+Sleeping+Sickness+2011+DVDRip+Sonata+Premier","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c7ca6cf55cc32ac2bc934f82e661409e26f56ab","infoHashBuffer":{"type":"Buffer","data":[156,124,166,207,85,204,50,172,43,201,52,248,46,102,20,9,226,111,86,171]},"announce":[],"urlList":[]}}