{"title":"Per Olov Enquist - Het bezoek van de lijfarts, NL Ebook(epub).DM","uid":6934338,"size":468234,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d3590a4cf76a05a785563b515d5ebe2934760ee&amp;dn=Per+Olov+Enquist+-+Het+bezoek+van+de+lijfarts%2C+NL+Ebook%28epub%29.DM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Falco_bis","files":-1,"time":1325724895,"description":"Per Olov Enquist - Het bezoek van de lijfarts, NL Ebook(epub).DMT\n\n\nAuteur: Per Olov Enquist\nPagina\\'s: 326\nUitgever: Ambo/Anthos B.V.\njaar van uitgifte: 2011\ngenre: Roman\n\n\nBeschrijving\n\nIn 1770 wordt Johan Friedrich Struensee, lijfarts van de geesteszieke Deense koning Christian VII, praktisch alleen heerser van Denemarken. Niet alleen weet hij door middel van talrijke hervormingen een fuwelen revolutie door te voeren, hij knoopt ook een liefdesbetrekking aan met koningin Caroline Mathilde, bij wie hij een dochter verwekt. De adel en het volk komen tegen Struensee in opstand. In januari 1772 wordt hij gevangengezet en in april 1772 van dat jaar terechtgesteld, na een proces dat in heel Europa opschudding veroorzaakt. Tegen de achtergrond van deze gebeurtenissen en van de naderende confrontatie tussen het absolutisme en de Verlichting in Europa vertelt Per Olov Enquist in Het bezoek van de lijfarts een van psychologie en politiek doortrokken liefdesdrama. De beschrijvingen van de waanvoorstellingen van Christian VII vormen het leidmotief van Enquists vertelling en schetsen een aandoenlijk, poÃƒÂ«tisch beeld van de waanzinnige koning. Caroline Mathilde, de zuster van de Engelse koning, trouwt op vijftienjarige leeftijd met Christian, maar wordt vervolgens geheel genegeerd en leidt een geÃƒÂ¯soleerd leven aan het verre Deense hof. Stuensee, de verlichte intellectueel, is hun verlosser, die deze tragische figuren hun menselijke waardigheid teruggeeft. Zijn tegenstrever is de intrigant en machtswellusteling Guldberg, die wordt bijgestaan door de stiefmoeder van Christian. Haar motivatie ligt in de aanspraken van haar zwakzinnige zoon Frederik op de Deense kroon.\n\n\n\nDit boek wordt u aangeboden door:\n\nDUTCH MOVIE THEATER\n","torrent":{"xt":"urn:btih:9d3590a4cf76a05a785563b515d5ebe2934760ee","amp;dn":"Per+Olov+Enquist+-+Het+bezoek+van+de+lijfarts%2C+NL+Ebook%28epub%29.DM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d3590a4cf76a05a785563b515d5ebe2934760ee","infoHashBuffer":{"type":"Buffer","data":[157,53,144,164,207,118,160,90,120,85,99,181,21,213,235,226,147,71,96,238]},"announce":[],"urlList":[]}}