{"title":"Erasing Death: Rewriting the Boundaries Between Life and Death","uid":8317249,"size":993042,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d71f71df6e2399a149d2e0dd31dfbb42d9e690d&amp;dn=Erasing+Death%3A+Rewriting+the+Boundaries+Between+Life+and+Death&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1364615445,"description":"\nErasing Death: The Science That Is Rewriting the Boundaries Between Life and Death\nJosh Young, Sam Parnia,\nISBN: 0062080601 | 2013 | EPUB/MOBI | 352 pages | 970 KB/643 KB\n\n\nErasing Death: The Science That Is Rewriting the Boundaries Between Life and Death reveals that death is not a moment in time. Death, rather, is a process-a process that can be interrupted well after it has begun. Innovative techniques have proven to be effective in revitalizing both the body and mind, but they are only employed in approximately half of the hospitals throughout the United States and Europe.\n\nDr. Sam Parnia, Director of the AWARE Study (AWAreness during REsuscitation) and one of the worlds leading experts on the scientific study of death and near-death experiences (NDE), presents cutting-edge research from the front lines of critical care and resuscitation medicine while also shedding light on the ultimate mystery: What happens to human consciousness during and after death? Dr. Parnia reveals how some form of afterlife may be uniquely ours, as evidenced by the continuation of the human mind and psyche after the brain stops functioning.\n\nWith physicians such as Dr. Parnia at the forefront, we are on the verge of discovering a new universal science of consciousness that reveals the nature of mind and a future where death is not the final defeat, but is, in fact, reversible.","torrent":{"xt":"urn:btih:9d71f71df6e2399a149d2e0dd31dfbb42d9e690d","amp;dn":"Erasing+Death%3A+Rewriting+the+Boundaries+Between+Life+and+Death","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d71f71df6e2399a149d2e0dd31dfbb42d9e690d","infoHashBuffer":{"type":"Buffer","data":[157,113,247,29,246,226,57,154,20,157,46,13,211,29,251,180,45,158,105,13]},"announce":[],"urlList":[]}}