{"title":"The Birth of Chinese Feminism [dovah]","uid":8902978,"size":3586649,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9dd81d4777a0400a5db1ff8df5b4e7d3b75ad88e&amp;dn=The+Birth+of+Chinese+Feminism+%5Bdovah%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dovah12","files":1,"time":1378846982,"description":" &lt;a href=&quot;\nhttp://cup.columbia.edu/book/978-0-231-16290-6/the-birth-of-chinese-feminism/tableOfContents&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://cup.columbia.edu/book/978-0-231-16290-6/the-birth-of-chinese-feminism/tableOfContents&lt;/a&gt;\n\n\nby Lydia H. Liu (Editor) , Rebecca E. Karl (Editor) , Dorothy Ko (Editor)\n\nformat : pdf retail 328 pages\nPublisher: Columbia University Press (March 26, 2013)\nLanguage: English\nISBN-10: 023116291X\nISBN-13: 978-0231162913\n\n\nAbout the Author\n\nLydia H. Liu is Wun Tsun Tam Professor in the Humanities at Columbia University and codirector of the Center for Translingual and Transcultural Studies at Tsinghua University in Beijing. She is the author of The Clash of Empires: The Invention of China in Modern World Making and, more recently, The Freudian Robot: Digital Media and the Future of the Unconscious.\n\nRebecca E. Karl is associate professor of history at New York University. She is the author of Mao Zedong and China in the Twentieth-Century World: A Concise History and Staging the World: Chinese Nationalism at the Turn of the Twentieth Century.\n\nDorothy Ko, a native of Hong Kong, is professor of history at Barnard College. She is a coeditor of Women and Confucian Cultures in Pre-modern China, Korea, and Japan and the author of Teachers of the Inner Chambers: Women and Culture in Seventeenth-Century China and Cinderella's Sisters: A Revisionist History of Footbinding.\n\nHe-Yin Zhen (ca. 1884-1920?) was a theorist who figured centrally in the birth of Chinese feminism. Unlike her contemporaries, she was concerned less with China's fate as a nation and more with the relationship among patriarchy, imperialism, capitalism, and gender subjugation as global historical problems. This volume, the first translation and study of He-Yin's work in English, critically reconstructs early twentieth-century Chinese feminist thought in a transnational context by juxtaposing He-Yin Zhen's writing against works by two better-known male interlocutors of her time.\n\nThe editors begin with a detailed analysis of He-Yin Zhen's life and thought. They then present annotated translations of six of her major essays, as well as two foundational tracts by her male contemporaries, Jin Tianhe (1874-1947) and Liang Qichao (1873--1929), to which He-Yin's work responds and with which it engages. Jin, a poet and educator, and Liang, a philosopher and journalist, understood feminism as a paternalistic cause that liberals like themselves should defend. He-Yin presents an alternative conception that draws upon anarchism and other radical trends. Ahead of her time, He-Yin Zhen complicates conventional accounts of feminism and China's history, offering original perspectives on sex, gender, labor, and power that remain relevant today. ","torrent":{"xt":"urn:btih:9dd81d4777a0400a5db1ff8df5b4e7d3b75ad88e","amp;dn":"The+Birth+of+Chinese+Feminism+%5Bdovah%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dd81d4777a0400a5db1ff8df5b4e7d3b75ad88e","infoHashBuffer":{"type":"Buffer","data":[157,216,29,71,119,160,64,10,93,177,255,141,245,180,231,211,183,90,216,142]},"announce":[],"urlList":[]}}