{"title":"Sri Lanka's Killing Fields  2011 14 06  Ch 4","uid":6547005,"size":424423424,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9e23e74fa703c445b0df3ea9d0979bfea3fbb831&amp;dn=Sri+Lanka%5C%27s+Killing+Fields++2011+14+06++Ch+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"john1942","files":1,"time":1310911475,"description":"Sri Lanka's Killing Fields  2011 14 06  Ch 4\n\n\n404mb/49mns/avi\n\nWarning: With disturbing and distressing descriptions and film of executions, atrocities and the shelling of civilians.\n\n\nJon Snow presents a forensic investigation into the final weeks of the quarter-century-long civil war between the government of Sri Lanka and the secessionist rebels, the Tamil Tigers.\n\n\nCaptured on mobile phones, both by Tamils under attack and government soldiers as war trophies, the disturbing footage shows: the extra-judicial executions of prisoners; the aftermath of targeted shelling of civilian camps; and dead female Tamil fighters who appear to have been raped or sexually assaulted, abused and murdered.\n\nAlso examined in the film are some of the horrific atrocities carried out by the Tamil Tigers, who used civilians as human shields.\n\nIn April 2011, Ban Ki-moon published a report by a UN-appointed panel of experts, which concluded that as many as 40,000 people were killed in the final weeks of the war between the Tamil Tigers and government forces.\n\nIt called for the creation of an international mechanism to investigate alleged violations of international humanitarian law and international human rights law committed by government forces and the Tamil Tigers during that time.\n\nThis film provides powerful evidence that will lend new urgency to the panel's call for an international inquiry to be mounted, including harrowing interviews with eye-witnesses, new photographic stills, official Sri Lankan army video footage, and satellite imagery.\n\nThe film raises serious questions about the consequences if the UN fails to act, not only with respect to Sri Lanka but also to future violations of international law.\n\n\nFile Name .............: Sri Lanka's Killing Fields (14 June 2011)[PDTV(XviD)].avi\n\n\t       \t\nSource: &lt;a href=&quot; https://thebox.bz/details.php?id=161622&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thebox.bz/details.php?id=161622&lt;/a&gt;\nUpped by:\tgeclipse\n\n","torrent":{"xt":"urn:btih:9e23e74fa703c445b0df3ea9d0979bfea3fbb831","amp;dn":"Sri+Lanka%5C%27s+Killing+Fields++2011+14+06++Ch+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e23e74fa703c445b0df3ea9d0979bfea3fbb831","infoHashBuffer":{"type":"Buffer","data":[158,35,231,79,167,3,196,69,176,223,62,169,208,151,155,254,163,251,184,49]},"announce":[],"urlList":[]}}