{"title":"Into.the.Dark.Ultimate.Trash.Edition-HI2U","uid":10079551,"size":3205815288,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9e74a34952b7b7f22e6cefce18316f77818c750f&amp;dn=Into.the.Dark.Ultimate.Trash.Edition-HI2U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Xetron","files":2,"time":1398976062,"description":"HI2U!\n\nInto the Dark: Ultimate Trash Edition (c) Homegrown Games\n\nRelease date : 1 May 2014\nProtection   : Steam\nType         : Action, Adventure, Indie\nSize         : 65 x 50 mb\n\nNote:\n~~~~~\nDon't expect a good game here!\nDon't even dare to hope for state-of the art graphics, a proper balancing,\nprofessional voice acting or breathtaking script-writing. This here is 100%\npure trash, an adventure / shooter hybrid with gazillions of bad jokes, dozens\nof pop culture references and a hidden, dense net of subversive, intelligent\nmessages related to post-WWII-politics. Oh yes, you need a basic knowledge of\npop culture to enjoy the game, and quite some education on politics to really\nlove it, but who cares? \n\nFar more important is: \nWe got boobies. \nWe got hookers. \nWe got Zombies. \nWe got Nazis. \nWe got even Nazi-Zombies! \n\nYou`re Peter &quot;Pete&quot; O`Brannon, a Private Eye. Sounds fascinating? It isn`t,\ntrust me - unless you find it exciting to hunt down cheating husbands and lost\ndogs while living of cheap Chinese food in shabby motels. THAT would be what\nPetes job is all about - but luckily for him, he has a good customer paying\nhis bills. It`s GlobalSecure Inc., one of the biggest insurance companies on\nthe East Coast. More exactly, it`s Samantha &quot;Sam&quot; Miller who runs their\ninvestigation department on insurance fraud. She`s tough, she`s intelligent,\nshe`s better than Pete. By far better. But due to the companies Code of\nConduct and some very nasty ethic rules, she`s prevented from taking, erm,\n&quot;semi-legal&quot; steps to gain essential information and proofs. That`s where\nPete steps in - for 500 bucks per day + expenses + a nice 20% share of the\nmoney the company saves with whatever Pete finds out. \n\nInto the Dark is a playable B-Movie, a trash experience composed out of 60%\nhumor, 30% horror and 10% technical flaws. Enjoy! \n\n11 Levels of pure madness \n15 different guns &amp; weaponized items \nSoundtrack featuring Nox Arcana \n67 puzzles \n238 lovely clipping errors \n35 sophisticated AI bugs \nGuaranteed minimum of 10 crashes when playing through the game! \n168 additional glitches \nPlay it as adventure, as shooter or as both! \nExplore the levels with your Oculus Rift Kit in VR! \nWatch the full movie &quot;Night of the living dead&quot; ingame!\n\nAttention: \nWindows 8 users: As Windows 8 treats DarkBasic applications quite strange upon\ndemanding large chunks of memory, we officially don't support it. We have ran\nthrough the game on several Windows 8 systems, we have reports of many players\nbeating the game on Windows 8, but we CANNOT guarantee it works on your side.\nBuy on own risk and RUN THE INTOTHEDARK EXE AS ADMINISTRATOR WITH\nCOMPATIBILITY MODE WINDOWS 7 \n\nMemory Issues: Into the Dark calls large chunks of your primary 1.85Gig\nmemory block. You may have to turn off FRAPS and Skype to have a proper trash\nexperience, and sometimes you will have to reload an autosave to clear the\nmemory. Refer to the troubleshooting guide for more information!\n\nInstall:\n~~~~~~~\n\nUnrar, mount/burn image, install, copy over crack to installation destination.\n\n","torrent":{"xt":"urn:btih:9e74a34952b7b7f22e6cefce18316f77818c750f","amp;dn":"Into.the.Dark.Ultimate.Trash.Edition-HI2U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e74a34952b7b7f22e6cefce18316f77818c750f","infoHashBuffer":{"type":"Buffer","data":[158,116,163,73,82,183,183,242,46,108,239,206,24,49,111,119,129,140,117,15]},"announce":[],"urlList":[]}}