{"title":"Megaton Man","uid":4183871,"size":306392730,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9e8a6eaf4122580cced3a2c34530e49acd24340e&amp;dn=Megaton+Man&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gilgamesh07","files":17,"time":1210555299,"description":"This Torrent contains Donald Simpson&amp;#039;s Megaton Man.\n\nThese are all the Megaton Man comics I have been able to find scanned.\n\nMegaton Man (civilian alter ego: Trent Phloog) is a satirical superhero created by cartoonist &quot;Dandy Don&quot; Simpson. A parody of the superhero genre, Megaton Man is a gigantically-muscled but dim-witted oaf who starred in Simpson&amp;#039;s cheerfully absurd stories. Megaton Man is also the title of the creator-owned comic book series (published by Kitchen Sink Press beginning in 1984) Simpson wrote and drew, in which the character first appeared and starred. The original Megaton Man series ran for ten issues, but the character was later revived in a limited series, The Return of Megaton Man, and a series of one-shot issues spun off from the concept. In 1994, Simpson left Kitchen Sink to form his own company, Fiasco Comics, through which Simpson self-published his new title Bizarre Heroes, featuring Megaton Man (and many members of his old supporting cast) as part of a large ensemble cast. Bizarre Heroes ended when Fiasco went out of business during the mid-1990s contraction of the American comics industry, but Megaton Man and the rest of the Bizarre Heroes went on to appear in several projects published by Image Comics.\n\nLiving in Megatropolis in Michigan, USA, Trent Phloog has made a living as superhero Megaton Man, otherwise known as &quot;The Man of Molecules&quot;. Whenever he says the magic word &quot;Overkill&quot;, he explodes. Megaton Mans&amp;#039; costume is metallic blue, with yellow gloves and boots. His allies include X-Ray Boy and Yarn Man, who both assist Megaton Man in battles against his arch foes, Bad Guy and Bulky Guy.\n\nThe origins of Megaton Mans&amp;#039; powers remain unknown, but there are two given possibilities:\n\nHe was bitten by a radioactive frog (A hint towards Spider-Man) \nMegaton Man was the result of a military megasoldier program (A nod towards Captain America). \nWhen he first gained his powers, Megaton Man was first known as Megaton Lad, and had a sidekick called Plutonium Pup (A reference to Krypto the Superdog). It wasn&amp;#039;t until the death of Plutonium Pup and his 21st birthday when Trent Phloog became Megaton Man.\n\nDue to an error in bureaucratic paperwork, Megaton Man is re-taking his high-school exams, but this is understandable, as he is known to be less than intelligent. During his first run of high school, Megaton Man used to play the clarinet in the high-school band.\n\nTrent Phloog is married to Stella Starlight, who is known as the superheroine Earth Mother (see below), and the two also had a child together.\n\nIn recent times, Megaton Man has discovered both previous and present incarnations of himself. In particular, Golden Age Megaton Man, Silver-Age Megaton Man, and a Russian Megaton Man, whose costume is red.\n\nOutside Megatropolis, Megaton Man is allied to The Phantom Jungle Girl. Villains outside Megatropolis include Irving the Living Cactus, and the Tomb Team, a band of supernatural villains including: The Bride of Frankenstein and Dracula&amp;#039;s Daughter.\n\nThanks to the scanners and to the original sources.\n\nPlease seed Please enjoy.","torrent":{"xt":"urn:btih:9e8a6eaf4122580cced3a2c34530e49acd24340e","amp;dn":"Megaton+Man","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e8a6eaf4122580cced3a2c34530e49acd24340e","infoHashBuffer":{"type":"Buffer","data":[158,138,110,175,65,34,88,12,206,211,162,195,69,48,228,154,205,36,52,14]},"announce":[],"urlList":[]}}