{"title":"Comprehensive Chirality [9 Vol. Set]","uid":15542590,"size":211656622,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9edcd6664b3ac199114deb97f6f19a5a48393043&amp;dn=Comprehensive+Chirality+%5B9+Vol.+Set%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"clouderone","files":1,"time":1470931937,"description":"Although many books exist on the subject of chiral chemistry, they only briefly cover chiral synthesis and analysis as a minor part of a larger work, to date there are none that pull together the background information and latest advances in one comprehensive reference work. Comprehensive Chirality provides a complete overview of the field, and includes chiral research relevant to synthesis, analytic chemistry, catalysis, and pharmaceuticals. The individual chapters in each of the 9 volumes provide an in depth review and collection of references on definition, technology, applications and a guide/links to the related literature. Whether in an Academic or Corporate setting, these chapters will form an invaluable resource for advanced students/researchers new to an area and those who need further background or answers to a particular problem, particularly in the development of drugs.\r\n\r\n\r\n\r\nChirality research today is a central theme in chemistry and biology and is growing in importance across a number of disciplinary boundaries. These studies do not always share a unique identifying factor or subject themselves to clear and concise definitions. This work unites the different areas of research and allows anyone working or researching in chiral chemistry to navigate through the most essential concepts with ease, saving them time and vastly improving their understanding.\r\n The field of chirality counts several journals that are directly and indirectly concerned with the field. There is no reference work that encompasses the entire field and unites the different areas of research through deep foundational reviews. Comprehensive Chirality fills this vacuum, and can be considered the definitive work. It will help users apply context to the diverse journal literature offering and aid them in identifying areas for further research and/or for solving problems.\r\nChief Editors, Hisashi Yamamoto (University of Chicago) and Erick Carreira (ETH Zürich) have assembled an impressive, world-class team of Volume Editors and Contributing Authors. Each chapter has been painstakingly reviewed and checked for consistent high quality. The result is an authoritative overview which ties the literature together and provides the user with a reliable background information and citation resource","torrent":{"xt":"urn:btih:9edcd6664b3ac199114deb97f6f19a5a48393043","amp;dn":"Comprehensive+Chirality+%5B9+Vol.+Set%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9edcd6664b3ac199114deb97f6f19a5a48393043","infoHashBuffer":{"type":"Buffer","data":[158,220,214,102,75,58,193,153,17,77,235,151,246,241,154,90,72,57,48,67]},"announce":[],"urlList":[]}}