{"title":"Whitney Houston - All The Man That I Need","uid":4693308,"size":132216836,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9f11e1347cca32b4bc71b0b5c55db14956c172c3&amp;dn=Whitney+Houston+-+All+The+Man+That+I+Need&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1233470227,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;All the Man That I Need&quot; is the second single from Whitney Houston's third album I'm Your Baby Tonight, a number-one hit in the US.\n\nHouston's version of &quot;All The Man That I Need&quot; is a R&amp;B/gospel-tinged song. It was written by Dean Pitchford and Michael Gore; a version was released by Linda Clifford a decade earlier. Houston's video for this song was directed by Peter Israelson (the same director for her &quot;Greatest Love of All&quot; and &quot;Where Do Broken Hearts Go&quot; singles). The video features Houston declaring her love for God, as she sings He is &quot;all the man that I need&quot;. The song makes prominent use of a choir on the final chorus of the song. Sister Sledge also had a minor R&amp;B hit with the song in 1982.\n\nAt this point, Whitney had achieved eight number one hits in the US in only four years. &quot;All the Man That I Need&quot; continued this success and became her ninth number-one on the Billboard Hot 100. It reigned for two weeks, from February 23, 1991 to March 8, 1991 and remained in the Top 40 of the chart for fifteen weeks.\n\nOn other Billboard charts, the song was a smash, reaching number one on both component charts of the Hot 100, the Hot 100 Single Sales and Hot 100 Airplay, her first song to top both charts since &quot;Where Do Broken Hearts Go&quot; in 1988. It also reached Gold certification. Houston's song also reached number one for four weeks on the Adult Contemporary Chart, and for two weeks on the R&amp;B Chart. Also, the song was notable as being Houston's first release to top all the charts it was eligible on.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9f11e1347cca32b4bc71b0b5c55db14956c172c3","amp;dn":"Whitney+Houston+-+All+The+Man+That+I+Need","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f11e1347cca32b4bc71b0b5c55db14956c172c3","infoHashBuffer":{"type":"Buffer","data":[159,17,225,52,124,202,50,180,188,113,176,181,197,93,177,73,86,193,114,195]},"announce":[],"urlList":[]}}