{"title":"Medical Management of Type 1 Diabetes, 6E [PDF] [StormRG]","uid":10199613,"size":32057374,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f7b9d17dcc95eab4213d5a157aefa192e3e7b2e&amp;dn=Medical+Management+of+Type+1+Diabetes%2C+6E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"0xmovva","files":3,"time":1400754645,"description":"Author: Francine R. Kaufman \nSeries: Kaufman, Medical Management of Type 1 Diabetes\nPaperback: 272 pages\nPublisher: American Diabetes Association; Sixth Edition edition (May 29, 2012)\nLanguage: English\nISBN-10: 1580404561\nISBN-13: 978-1580404563\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nType 1 diabetes, formerly known as juvenile diabetes, is a complex disorder that requires a great deal of patient-guided self-care. In recent years, advances in diabetes treatment have dramatically shifted potential outcomes in the favor of the patient with diabetes. The challenge for health care professionals is to realize this potential through an individualized, flexible, and responsive treatment plan for patients with type 1 diabetes.\n\nNow in its sixth edition, Medical Management of Type 1 Diabetes offers health care providers the newest information and guidelines for the treatment of type 1 diabetes. Built on the foundation of multiple daily insulin injections and insulin pump therapy, this book guides health care providers in helping their patients continually strive for optimal blood glucose control. This new edition focuses on the latest molecular advances, new treatment methods, recent clinical trials, and the American Diabetes Association's Standards of Care. Key topics also include new insulins and administration protocols, advanced carbohydrate counting, and emphasis on continuing patient education.\n\nIndividual sections address all of the topics in managing type 1 diabetes, including:\nDiagnosis and Classification/PathogenesisDiabetes Standards and EducationTools of TherapySpecial SituationsPsychosocial Factors Affecting Adherence, Quality of Life, and Well-BeingComplications\nEdited by Dr. Francine Kaufman, a widely recognized expert in the treatment of diabetes and of insulin therapy, and guided by the recognized authority of the American Diabetes Association's Standards of Care, Medical Management of Type 1 Diabetes is an essential addition to any clinician's library for the treatment and understanding of type 1 diabetes.","torrent":{"xt":"urn:btih:9f7b9d17dcc95eab4213d5a157aefa192e3e7b2e","amp;dn":"Medical+Management+of+Type+1+Diabetes%2C+6E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f7b9d17dcc95eab4213d5a157aefa192e3e7b2e","infoHashBuffer":{"type":"Buffer","data":[159,123,157,23,220,201,94,171,66,19,213,161,87,174,250,25,46,62,123,46]},"announce":[],"urlList":[]}}