{"title":"Archer-Plot to Seize the White House(1973)","uid":4533056,"size":14957283,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a0666a7544dac82efc34e755ed79a7b3cf471d5f&amp;dn=Archer-Plot+to+Seize+the+White+House%281973%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"red_gonzo","files":1,"time":1227632456,"description":"This is Jules Archer&amp;#039;s shocking book The Plot to Seize the White House (1973) which vividly describes an actual attempt of a fascist takeover of USA. The story in brief is that General Smedley Butler was approached by shadowy men to lead a coup d&amp;#039;etat to overthrow democracy in 1933&amp;34. In telling the story of the Plot, Jules Archer tells also the biography of General Smedley Butler who declined to become the American Hitler or Mussolini, over a fascist takeover of the US. The plot was not only real, it was witnessed and documented by the man the moguls wanted to lead it, retired Marine Corps General, Smedley D. Butler. Not a man for idle brag or idle praise, two-time Medal of Honor winner, Smedley Butler, was a Marine&amp;#039;s Marine. He led his Marines from the font in battle, which was why he was such a popular figure with the veterans of that very unstable Depression period - a point not lost on those who wanted a military figure to lead a veteran army, similar to the Nazis in Germany, the Fascists in Italy and the strong but untried fascist movement in France. Playing for time and gaining as much information as he could about the plotters, Butler finally took his evidence before the House Un-American Activities Committee. He reported. His report and evidence was found solid, legitimate and unquestioned. But then what? Nothing. Nobody was ever prosecuted. Important men were never arrested or grilled over facts. The newspaper sensation created by an impotent congressional investigation in 1934 and 1935 died down and the story collected dust, forgotten ever since. However, the story fits into some others, including other suppressed and buried history. This book stands alone as a mystery story, a spy story, a thriller, a history, a biography of a patriot, a record of government corruption. It also fits in with a great body of literature with pieces of information telling bits of the history of sociopathy that killed over 200,000,000 people last century. As major industiral and banking names were involved, the story, it seems, was buried. Until Archer&amp;#039;s book appeared in 1973. Then it seems to have been buried again. The question is why and who is still afraid of the information contained in Archer&amp;#039;s book? 285 pages, many pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:a0666a7544dac82efc34e755ed79a7b3cf471d5f","amp;dn":"Archer-Plot+to+Seize+the+White+House%281973%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0666a7544dac82efc34e755ed79a7b3cf471d5f","infoHashBuffer":{"type":"Buffer","data":[160,102,106,117,68,218,200,46,252,52,231,85,237,121,167,179,207,71,29,95]},"announce":[],"urlList":[]}}