{"title":"The Screamin' Cheetah Wheelies - 'Live Vol 1 &amp; 2'","uid":4612415,"size":258553552,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a078f15cc459c43365f40b61cc449a05763ad759&amp;dn=The+Screamin%5C%27+Cheetah+Wheelies+-+%5C%27Live+Vol+1+%26+2%5C%27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"smbdownload","files":-1,"time":1230681497,"description":"Screamin' Cheetah Wheelies was a rock band from Nashville, Tennessee which formed in the early 1990s. The band embraced a southern boogie style which led to comparisons with groups such as Lynyrd Skynyrd, The Allman Brothers Band, The Black Crowes, Collective Soul, and Cry of Love. The band played at a blues club near Vanderbilt University before being signed to Atlantic Records in 1993. The band drew its name from one of Gary Larson's comics The Far Side\n\nLIVE VOL. 1&amp;2\n\nTrack Listings [320k MP3]\n\nDisc: 1\n  \n1. Intro - The Screamin' Cheetah Wheelies,  \n2. Shakin' the Blues - The Screamin' Cheetah Wheelies, Farris, Michael E.  \n3. Ride the Tide - The Screamin' Cheetah Wheelies, Farris, Michael E.  \n4. Something Else - The Screamin' Cheetah Wheelies, Farris, Michael  \n5. This Is the Time - The Screamin' Cheetah Wheelies, Burgess, Steven P.  \n6. Slow Burn - The Screamin' Cheetah Wheelies, Burgess, Steven P.  \n7. Leave Your Pride - The Screamin' Cheetah Wheelies,  \n8. Majestic - The Screamin' Cheetah Wheelies, Farris, Michael E.  \n9. Moses Brown - The Screamin' Cheetah Wheelies, Farris, Michael E.\n  \nDisc: 2\n  \n1. Venus - The Screamin' Cheetah Wheelies,  \n2. I Found Love - The Screamin' Cheetah Wheelies, Farris, Michael  \n3. Magnolia - The Screamin' Cheetah Wheelies, Farris, Michael  \n4. Father Speaks - The Screamin' Cheetah Wheelies, Farris, Michael  \n5. Messenger's Lament - The Screamin' Cheetah Wheelies, Farris, Michael  \n6. I Dreamed - The Screamin' Cheetah Wheelies, Farris, Michael  \n7. You Are - The Screamin' Cheetah Wheelies, Farris, Michael  \n\n\n---------------------------------------------------------------------------------\n\nHistory:\n\nMembers Mike Farris (vocals), Rick White (guitar), Bob Watkins (guitar), Steve Burgess (bass) and Terry Thomas (drums) released their self-titled debut album in 1994.[1] The album hit #40 on the Billboard Heatseekers chart. The album was recorded at Ardent Studios in Memphis, Tennessee and produced by Paul Ebersold.[2] &quot;The Screamin' Cheetah Wheelies&quot; was an album that &quot;played like a gateway between guitar hero classic rock and hippie jam band grooves, often combining both within the confines of a single track.&quot; And their single &quot;Shakin' the Blues&quot; made the album-rock Top Ten.\n\n1996 saw the release of &quot;Magnolia&quot;, with varied musical styles ranging from the eponymous title track, a slow-burn build-up rock and roll epic, to &quot;Gypsy Lullaby&quot;, a delicate ode featuring Farris' blistering vocals at their best. &quot;Magnolia&quot; was produced by Michael Barbiero and also featured a guest appearance by Warren Haynes of Gov't Mule.\n\n&quot;Big Wheel&quot;, released in 1998, contained &quot;Standing In The Sun&quot; and &quot;Boogie King&quot;, a rollick as at home in the mosh pit as it is cruising the local drag. In addition, &quot;Boogie King&quot; was featured on the soundtrack of the movie Bride of Chucky. Also, &quot;Right Place, Wrong Time&quot; was featured on &quot;The Malcom in the Middle&quot; episode &quot;Home Alone 4&quot;, as well as &quot;Songs from Malcolm in the Middle&quot;, the soundtrack to the television series which was released on November 21, 2000.\n\nSince the dissolution of the band, Mike Farris has released two solo albums: 2002's &quot;Goodnight Sun&quot;, on Mean It! records, and 2007's &quot;Salvation In Lights&quot;, on INO Records.\n\n--------------------------------------------------------------------------------\n\nIt's a mystery to me (and all the other Screamin' Cheetah Wheelies fans that I've met at their live shows since 1993) why this band is not more popular. While the music on their studio albums is some of the most soulful ever recorded, hearing them live is an almost religious experience. This double CD set is a perfect testament to their dedication and power. Rick White and Bobby Watkins are two of the best duelling lead guitarists that you've never heard of. Steve Burgess is one major league funky bass player and Terry Thomas does some things on his drumkit that defy description. As incredible as these four masters are, the lead singer, harp player and sometimes guitarist is a phenomenon unto himself. Imagine Jim Morrison mixed with Stevie Ray Vaughan then add a dash of Joe Cocker having a drink with Marvin Gaye and you've got the near holy vocals of Mike Farris. When he sings, you feel like God is standing backstage listening in. This 2 CD set captures their live show as well as possible without actually standing right in front of the stage. While every song is worth extended replays, stand-outs include &quot;Leave Your Pride&quot;, &quot;I Found Love&quot;, &quot;Magnolia&quot; and &quot;Father Speaks&quot;. I can't say enough about this album. You will be very pleased by what you hear.\n","torrent":{"xt":"urn:btih:a078f15cc459c43365f40b61cc449a05763ad759","amp;dn":"The+Screamin%5C%27+Cheetah+Wheelies+-+%5C%27Live+Vol+1+%26+2%5C%27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a078f15cc459c43365f40b61cc449a05763ad759","infoHashBuffer":{"type":"Buffer","data":[160,120,241,92,196,89,196,51,101,244,11,97,204,68,154,5,118,58,215,89]},"announce":[],"urlList":[]}}