{"title":"No Coward Soldiers: Black Cultural Politics in Postwar America [","uid":8789055,"size":684677,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a0a8c3577508f67c0365278e7eb2017a5a6a5dae&amp;dn=No+Coward+Soldiers%3A+Black+Cultural+Politics+in+Postwar+America+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1375894897,"description":"No Coward Soldiers: Black Cultural Politics in Postwar America | With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload | filetype: pdf |\n\n\n\n In a vibrant and passionate exploration of the twentieth-century civil rights and black power eras in American history, Waldo Martin uses cultural politics as a lens through which to understand the African-American freedom struggle.\n\nIn black culture, argues Martin, we see the debate over the profound tension at the core of black identity: the duality of being at once both American and African. And in the transformative postwar period, the intersection between culture and politics became increasingly central to the African-American fight for equality. In freedom songs, in the exuberance of an Aretha Franklin concert, in Faith Ringgold's exploration of race and sexuality, the personal and social became the political.\n\nMartin explores the place of black culture in this vision and examines the multiple ways in which various forms of expressive culture and African-American cultural figures influenced consciousness and helped effect social action. From the music of John Coltrane and James Brown to the visual art of Jacob Lawrence and Betye Saar to the dance movements of Alvin Ailey and Arthur Mitchell, Martin discusses how, why, and with what consequences culture became a critical battle site in the freedom struggle. And in a fascinating epilogue, he draws the thread of black cultural politics into today's hip-hop culture.\n\nThis engaging book brings a new perspective to the civil rights and black power eras, while illuminating the broader history of American and global freedom struggles. \n\n\n [b] Review [/b] \nThrough concise and cogent observations grounded in wide-ranging interdisciplinary research, Waldo Martin's No Coward Soldiers makes a singular contribution to the literature on African-American life since World War II. Devoting special attention to music and other aspects of popular culture, Martin illuminates many of the central concerns that remain unresolved as Americans continue to debate the meaning of race. This insightful book deserves a wide readership.\n--Clayborne Carson, editor of The Papers of Martin Luther King, Jr. and author of In Struggle: SNCC and the Black Awakening of the 1960s\n\nWaldo Martin takes up the charge being led by a growing number of scholars who understand the symbiotic connections between the Civil Rights/Black Power movements and black expressive culture in a myriad of forms. Throughout the highs and lows of their freedom struggle, black Americansâˆ†-in song and dance, poetry and painting, sermon and sculptureâˆ†-constructed mighty cultural armature on the front lines of a social revolution. With rigor and verve, No Coward Soldiers captures the richness and complexity of that historical moment.\n--Deborah E. McDowell, University of Virginia, author of Leaving Pipe Shop: Memories of Kin\n\nNo Coward Soldiers...is a fine representation of contemporary efforts in history, ethnic studies, and American studies to examine the cultural dimensions of politics, the politicization of culture, and the interaction between the two arenas...The work is a remarkable synthesis in its analysis of different facets of black culture. Martin's canvas is rather extensive. Besides examining the artistic and political aspects of blues, spirituals, jazz, soul, rock and roll, funk, and hip-hop, he looks at sports heroes and the works of artists in different media.\n--Douglas Henry Daniels (Journal of American History )\n\nWaldo E. Martin, Jr. draws on the development of postwar black aesthetic-cultural forms to read African-American political history. He argues that what developed between the 1940s and 1970s was a &quot;distinctive black cultural politics&quot; where culture and politics overlapped and merged...He keeps the reader focused on his central themes of hope and possibility for black political and cultural struggle between 1940 and 1979 and the drive for freedom, equality, and justice underlying cultural politics and the political culture...No Coward Soldiers constitutes a strong addition to cultural studies and analyses of African-American politics alike. While it doesn't seek to replace more detailed historical studies of black power and civil rights that already exist, it does provide a new outlook on those histories. It is indeed an important book that ought to be read by academics and students with an interest in either or both disciplines.\n--Kalbir Shukra (Ethnic and Racial Studies )\n\n[b]About the Author[/b] \nWaldo E. Martin, Jr. is Professor of History at the University of California, Berkeley.\n\n\n\nHardcover: 176 pages\nPublisher: Harvard University Press (February 28, 2005)\nLanguage: English\nISBN-10: 067401507X\nISBN-13: 978-0674015074\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/No-Coward-Soldiers-Cultural-Politics/dp/067401507X/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/No-Coward-Soldiers-Cultural-Politics/dp/067401507X/&lt;/a&gt;\n\n\nTags: military, miitary desegregation, blacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery, experimentation, tuskeegee, unconscious, subconscious, identity","torrent":{"xt":"urn:btih:a0a8c3577508f67c0365278e7eb2017a5a6a5dae","amp;dn":"No+Coward+Soldiers%3A+Black+Cultural+Politics+in+Postwar+America+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0a8c3577508f67c0365278e7eb2017a5a6a5dae","infoHashBuffer":{"type":"Buffer","data":[160,168,195,87,117,8,246,124,3,101,39,142,126,178,1,122,90,106,93,174]},"announce":[],"urlList":[]}}