{"title":"Building.Cars.Live--BBC--720p","uid":12648517,"size":3197046304,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:a1064880a6ef05edca24f049fde49eaa55164504&amp;dn=Building.Cars.Live--BBC--720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"uggauga","files":4,"time":1446089680,"description":"Building Cars Live\r\n\r\nBuckle up for an incredible journey into the fascinating secret world of the car factory. Every 68 seconds a brand new car drives off the production line at the MINI Plant in Oxford. In this series, James May, Kate Humble and Ant Anstead go live behind the scenes to bring us this modern miracle in real time. Over two nights they will reveal the science, engineering and people that keep us all on the road, and see a car built from start to finish in a little over 24 hours.\r\n\r\nEpisode 1\r\nIn the first episode, James makes friends with an army of diligent robots and busts the myth that British manufacturing is dead. Kate heads to Norway to discover why the electric car is king of the Norwegian road and Ant explores the history and heritage of one of the most iconic cars ever built. With access all areas live on the factory floor, the team will see exactly how a car is born - a car that tomorrow will be driven off the line ready for life on the open road.\r\n\r\nEpisode 2\r\nJames May, Kate Humble and Ant Anstead are back broadcasting live from one of the biggest and busiest car factories in Britain. Think you know how a car is born? Think again. James races against the clock on the production line and embraces the Japanese philosophy of Kaizen. Kate gets to the bottom of how manufacturers test car seats for mass production and Ant heads to Germany to put his faith in a driverless car on the autobahn.\r\nInside the factory, the team reveal what it takes to build a thousand different cars a day, and are live as a car that started being built yesterday drives off the production line for the very first time","torrent":{"xt":"urn:btih:a1064880a6ef05edca24f049fde49eaa55164504","amp;dn":"Building.Cars.Live--BBC--720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1064880a6ef05edca24f049fde49eaa55164504","infoHashBuffer":{"type":"Buffer","data":[161,6,72,128,166,239,5,237,202,36,240,73,253,228,158,170,85,22,69,4]},"announce":[],"urlList":[]}}