{"title":"Criticism of the Western Civilization-Collection 61 (Gambling 2)","uid":13071937,"size":75317268,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1138026897b99b6c7fe68fddb901ddc51c9a466&amp;dn=Criticism+of+the+Western+Civilization-Collection+61+%28Gambling+2%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moman73","files":37,"time":1450802665,"description":"Criticism of the Western Civilization - Collection 61 (Gambling 2):\r\n\r\nWe have 37 titles here:\r\n\r\n-  Abbott et al - A Review of Research on Aspects of Problem Gambling, Auckland Univ. of Technology (2004)\r\n\r\n-  Banks - Online Gambling and Crime; Causes, Controls and Controversies (2014)\r\n\r\n-  Bashan &amp; White - Gambling with Our Future; the Costs and Benefits of Legalized Gambling (2002)\r\n\r\n-  Binde - Gambling Advertising; a Critical Research Review (2014)\r\n\r\n-  Binde - What Are the Most Harmful Forms of Gambling; Analyzing Problem Gambling Prevalence Surveys (2011)\r\n\r\n-  Cassidy et al - Fair Game; Producing Gambling Research, the Goldsmiths Report (2013)\r\n\r\n-  Cheng - The Sociology of Gambling in China (2011)\r\n\r\n-  Derevensky et al (Eds.) - Youth Gambling; the Hidden Addiction (2011)\r\n\r\n-  Doiron - Gambling and Problem Gambling in Prince Edward Island (2006)\r\n\r\n-  Gambling Impact Study, Spectrum Gaming Group (2013)\r\n\r\n-  Gerstein et al - Gambling Impact and Behavior Study (1999)\r\n\r\n-  Grant &amp; Potenza (Eds.) - Pathological Gambling; a Clinical Guide to Treatment (2004)\r\n\r\n-  Grinols - Gambling in America; Costs and Benefits (2004)\r\n\r\n-  Hayward - The Costs and Benefits of Gaming; a Literature Review with Emphasis on Nova Scotia (2004)\r\n\r\n-  Humphreys et al - The Effect of Gambling on Health; Evidence from Canada, U. of Alberta (Nov 2011)\r\n\r\n-  Iorizzo - Straight Talk About.. Gambling (2013)\r\n\r\n-  Isaacs - You Bet Your Life; the Burdens of Gambling (2001)\r\n\r\n-  Kearney - The Economic Winners and Losers of Legalized Gambling (Feb 2005)\r\n\r\n-  McComb &amp; Hanson - Problem Gambling on College Campuses, NASPA Journal (2009)\r\n\r\n-  McCown &amp; Howatt - Treating Gambling Problems (2007)\r\n\r\n-  McMillen (Ed.) - Gambling Cultures; Studies in History and Interpretation (1996)\r\n\r\n-  Mutari &amp; Figart - Just One More Hand; Life in the Casino Economy (2015)\r\n\r\n-  Orford et al - Gambling and Problem Gambling in Britain (2003)\r\n\r\n-  Problem Gambling and Harm; Towards a National Definition, The SA Centre for Economic Studies (2005)\r\n\r\n-  Raymer - Lay the Favorite; a Memoir of Gambling (2010)\r\n\r\n-  Reith - The Age of Chance; Gambling in Western Culture (1999)\r\n\r\n-  Rickwood et al - The Psychology of Gambling; APS Review Paper (Nov 2010)\r\n\r\n-  Seniors and Gambling, a Hidden Problem; a Report on the Seniors and Gambling Project, Nova Scotia (March 2010)\r\n\r\n-  Shaffer et al (Eds.) - Futures at Stake; Youth, Gambling, and Society (2003)\r\n\r\n-  Skolnik - High Stakes; the Rising Cost of America's Gambling Addiction (2011)\r\n\r\n-  Snowdon - The Crack Cocaine of Gambling; Gambling Machines in the UK (April 2013)\r\n\r\n-  Social and Economic Impact Study of Gambling in Tasmania (2011)\r\n\r\n-  Sojourner - She Bets Her Life; a True Story of Gambling Addiction (2010)\r\n\r\n-  Spapens et al (Eds.) - Crime, Addiction and the Regulation of Gambling (2008)\r\n\r\n-  The Costs and Consequences of Gambling in the State of Delaware, U. of Delaware (Oct 2002)\r\n\r\n-  Thompson - The International Encyclopedia of Gambling,  Vols. 1 &amp; 2 (2010)\r\n\r\n-  Ugel - Money for Nothing; One Man's Journey Through the Dark Side of Lottery Millions (2007)","torrent":{"xt":"urn:btih:a1138026897b99b6c7fe68fddb901ddc51c9a466","amp;dn":"Criticism+of+the+Western+Civilization-Collection+61+%28Gambling+2%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1138026897b99b6c7fe68fddb901ddc51c9a466","infoHashBuffer":{"type":"Buffer","data":[161,19,128,38,137,123,153,182,199,254,104,253,219,144,29,220,81,201,164,102]},"announce":[],"urlList":[]}}