{"title":"Anthony Wayne: American General","uid":6526785,"size":4433257,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a187a2374bb0782eb7782b542d106dbef5661896&amp;dn=Anthony+Wayne%3A+American+General&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"_F1_","files":-1,"time":1310194106,"description":"&quot;Anthony Wayne: American General&quot; by Patricia A. Grabowski\n C H P | 80 pages | English | 2001 | ISBN: 0791063828 | PDF | 4.22 MB\n\n Grade 4-6-In these workmanlike biographies, the authors do a competent, if not inspiring job of presenting complex ideas and historical material for an audience with little background knowledge of the topics. The history and achievements of Wayne will be more familiar to children, but there are still many complicated battles and intricacies of power politics among the military leaders. In the case of Kosciuszko, the author must explain the economic, social, and political structure of 18th-century Poland; provide background on the Enlightenment; and describe Kosciuszko's accomplishments as a military engineer, along with his military strategy during the Revolutionary War. The many reproductions and illustrations, in color and black and white, and the few, unclear maps do little to elucidate the texts. The pictures of important contemporaries such as Lord Howe or General Burgoyne will be meaningless to most readers, and there are no diagrams of Wayne's battles or Kosciuszko's fortifications. Although these books are not likely to be used for recreational reading, they might be useful as additional sources for reports.","torrent":{"xt":"urn:btih:a187a2374bb0782eb7782b542d106dbef5661896","amp;dn":"Anthony+Wayne%3A+American+General","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a187a2374bb0782eb7782b542d106dbef5661896","infoHashBuffer":{"type":"Buffer","data":[161,135,162,55,75,176,120,46,183,120,43,84,45,16,109,190,245,102,24,150]},"announce":[],"urlList":[]}}