{"title":"Zulu 1964 Michael Caine DvDRip x264 AAC-miKem","uid":8514882,"size":1672577063,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a1a59459c8c100d78888c44283dc6e99c1a8e4ff&amp;dn=Zulu+1964+Michael+Caine+DvDRip+x264+AAC-miKem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mikem777","files":6,"time":1369698375,"description":"Zulu (1964)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0058777&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0058777&lt;/a&gt;\n\nSAMPLE file included \n\nTwo Lieutenants, Chard of Engineers and Bromhead find that their 140 man contingent in Natal has been isolated by the destruction of the main British Army column and that 4,000 Zulu warriors will descend on them in hours. Each has a different military background in tactics and they are immediately in conflict on how to prepare for the attack. Nearly a third of the men are in the infirmary, as the welsh company tries to somehow survive with no help in sight. Based on a true story.\n\nWhen one sees this film you know great pains were taken in the making of this masterpiece -- of all of the films that I have seen I found this one to be one of the classics that sets a standard for film. Great effort was put into the historical tale-telling. From political and social commentary to great action sequences Zulu is one of the more complete films that you will ever see, having something for everyone. I enjoyed the human aspect of different men, coming together under duress to fight bravely in the face of overwhelming odds; it shows normal men coming together and accomplishing something great in the face of opposition and all the human story that goes along with it. A must-see for anyone who enjoys action &amp; war films.\n\nThe Battle of Rorke's Drift, also known as the Defence of Rorke's Drift, was a battle in the Anglo-Zulu War. The defence of the mission station of Rorke's Drift, under the command of Lieutenant John Chard of the Royal Engineers, immediately followed the British Army's defeat at the Battle of Isandlwana on 22 January 1879, and continued into the following day, 23 January. Just over 150 British and colonial troops successfully defended the garrison against an intense assault by 3,000 to 4,000 Zulu warriors. The massive, but piecemeal, Zulu attacks on Rorke's Drift came very close to defeating the tiny garrison but were ultimately repelled. Eleven Victoria Crosses were awarded to the defenders, along with a number of other decorations and honours.\n\nspecs:\nH.264, 716 x 436, Millions\nAAC, 2 channels, 48000 Hz\n1,664.10 kbit/s\n1019 x 436 pixels (actual)\nRuntime: 138 min \n\ntags: drama, history, war, zulu, battle, warrior, british, army, military, Michael Caine, hero, south africa, 1879","torrent":{"xt":"urn:btih:a1a59459c8c100d78888c44283dc6e99c1a8e4ff","amp;dn":"Zulu+1964+Michael+Caine+DvDRip+x264+AAC-miKem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1a59459c8c100d78888c44283dc6e99c1a8e4ff","infoHashBuffer":{"type":"Buffer","data":[161,165,148,89,200,193,0,215,136,136,196,66,131,220,110,153,193,168,228,255]},"announce":[],"urlList":[]}}