{"title":"Battle of Crete","uid":11704643,"size":80058430,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1c5347301ecf55f48d0c8c63fc5cf34a4ca539e&amp;dn=Battle+of+Crete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424071773,"description":"Following the successful German invasion of the Balkans and the capture of mainland Greece, the Axis powers' focussed their attentions upon the strategic island of Crete. The island was Britain's last foothold in the northeast Mediterranean and was perceived as being pivotal to the ongoing defence of the Middle East and the crucial sea-lanes leading to the Suez Canal. By early 1941 the British position in the Mediterranean was wavering; in North Africa Rommel's forces were sweeping towards Egypt, and the remaining British fortresses such as Malta were threatened. Against this background, German forces launched an airborne attack against Crete in late May 1941. Drawing upon an incredible selection of contemporary photographs, allied with first-hand recollections from those who fought, 'Battle of Crete' examines one of the most bitterly contested engagements of the early war years. Uniquely recounted from the viewpoint of the individual fighting soldier, sailor and airman, this timely examination of an important but often overlooked battle will be essential reading for all historians of World War 2","torrent":{"xt":"urn:btih:a1c5347301ecf55f48d0c8c63fc5cf34a4ca539e","amp;dn":"Battle+of+Crete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1c5347301ecf55f48d0c8c63fc5cf34a4ca539e","infoHashBuffer":{"type":"Buffer","data":[161,197,52,115,1,236,245,95,72,208,200,198,63,197,207,52,164,202,83,158]},"announce":[],"urlList":[]}}