{"title":"What is Psychology (3rd Ed)(gnv64)","uid":7314755,"size":70704265,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1f5348701d91cd4cd64ceda48659240a90eb95e&amp;dn=What+is+Psychology+%283rd+Ed%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1338456009,"description":"What is Psychology? (3rd edition)\nby Ellen E. Pastorino and Susann M Doyle-Portillo\nWadsworth Publishing | January 2011 | 800 Pages | ISBN-10: 111134700X | PDF | 67.4 mb &lt;a href=&quot;\nhttp://www.amazon.com/What-Psychology-Ellen-E-Pastorino/dp/111134700X&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/What-Psychology-Ellen-E-Pastorino/dp/111134700X&lt;/a&gt;\n\nEllen Pastorino and Susann Doyle-Portillo are dedicated, award-winning psychology professors with an infectious enthusiasm for teaching psychology. Praised in previous editions for fostering students' curiosity, WHAT IS PSYCHOLOGY? Third Edition, extends the authors' successful and engaging approach to teaching the introductory psychology course. The authors have found that when students are curious they are motivated to explore and truly learn how psychological concepts are connected. This book unlocks readers' curiosity by capturing their interest and then helping them see connections between personal stories, applications to their own lives, and psychological concepts that they will use and retain in and out of the classroom.\n\nAbout the Authors\nEllen E. Pastorino (Ph.D. in School Psychology, Florida State University) is a developmental psychologist who teaches psychology classes at Valencia Community College in Orlando, Florida. Dr. Pastorino has won numerous teaching awards, including the University of Georgia, Board of Regents Distinguished Professor; the NISOD Excellence in Teaching Award; and Valencia's Teaching and Learning Excellence Award. She also serves as a reviewer for the &quot;Journal on Excellence in College Teaching.&quot; Dr. Pastorino has authored test banks, instructor manuals, and student study guides, and has published research in the &quot;Journal of Adolescent Research and Adolescence.&quot; While working as a consultant for IBM Corporation she developed numerous educational materials for teachers and students.\nDr. Susann M. Doyle-Portillo, a professor of psychology at Gainesville College, earned her Ph.D. in Social Cognition from the University of Oklahoma. She holds bachelors degrees in engineering and psychology. She has published articles in &quot;Social Cognition&quot; and &quot;Contemporary Social Psychology,&quot; but the main focus of her career is teaching. During her tenure at Gainesville College, Dr. Doyle-Portillo has twice been listed in &quot;Who's Who Among America's Teachers.&quot; She has supervised independent-study student research at the two-year college level and is the founder of the Division of Social Sciences and Education Annual Research Poster Competition at Gainesville College. She also is the chair of the Scientific Review Committee/Institutional Review Board for the Gainesville College Engineering and Science Fair. She has authored test banks, instructor manuals, and student study guides.","torrent":{"xt":"urn:btih:a1f5348701d91cd4cd64ceda48659240a90eb95e","amp;dn":"What+is+Psychology+%283rd+Ed%29%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1f5348701d91cd4cd64ceda48659240a90eb95e","infoHashBuffer":{"type":"Buffer","data":[161,245,52,135,1,217,28,212,205,100,206,218,72,101,146,64,169,14,185,94]},"announce":[],"urlList":[]}}