{"title":"Classof88_TheTrueAcidHouseExperience_version_1998","uid":3951934,"size":1080570,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a51fe521ff434ba4d843c1900218e4346585d756&amp;dn=Classof88_TheTrueAcidHouseExperience_version_1998&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wagnet88","files":4,"time":1198922510,"description":"Class of 88 - The True Acid House Experience\n\nWayne Anthony took his first Ecstasy tablet in Spain in 1987. Then the Summer of Love hit Britain in &amp;#039;88 and, together with the rest of the youth of the UK, Wayne embraced the bright new Acid House lifestyle of dace music, MDMA and all-night celebrations as Britain partied like never before.\n\nYet when Wayne turned his natural East End entrepreneurial instincts to the rave world, and began organising the infamous Genesis dance parties for thousands of kids, he quickly discovered the seamy downside of the Acid House dream. Beneath the shiny smiley surfaces lurked a vicious world of violence, police harassment, gangsters, protection rackets and organised crime.\n\nIn two years as an illegal dance party promoter, Wayne Anthony made and lost hundreds of thousands of pounds, took vast amounts of drugs, and jumped out of a airplane on LSD. H was also beaten up by psychotic ex-paratroopers, menaced by criminals and blackmailers, confronted with sawn-off shotguns, kidnapped and threatened with murder.\n\nWayne Anthony spent two years breaking and entering into warehouses and putting his life on the line in the vanguard of the dace party revolution which swept the UK in the late eighties. Class of 88 is his raw, idiosyncratic and fascinating account of how Acid House changed his life, and Great Britain, forever.\n\nIan Gittins (Virgin Books - Original Publisher 1998)\n\nPLEASE RESEED\nAuthor Wayne Anthony - MySpace - www.myspace.com/wayneanthony88\nClass of 88 - Special Edition Paperback Book -","torrent":{"xt":"urn:btih:a51fe521ff434ba4d843c1900218e4346585d756","amp;dn":"Classof88_TheTrueAcidHouseExperience_version_1998","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a51fe521ff434ba4d843c1900218e4346585d756","infoHashBuffer":{"type":"Buffer","data":[165,31,229,33,255,67,75,164,216,67,193,144,2,24,228,52,101,133,215,86]},"announce":[],"urlList":[]}}