{"title":"PureMagnetik Microtron (3 Tape Sets) for Kontakt","uid":5985088,"size":689644497,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a6784ea0c8b87513e22359df69328246446973df&amp;dn=PureMagnetik+Microtron+%283+Tape+Sets%29+for+Kontakt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gyaradon","files":2,"time":1290711441,"description":"From the guy who can't get enough Mellotron, here's yet another set of tape banks. This time, it's PureMagnetik's Microtron for Kontakt (of course for Kontakt! It's my favorite!) You get all three sets currently available: Tapes 1, 2, &amp; 3. That's nine sounds: 8 Voice Choir, String Section, Brass, Cello, Flutes (of course,) Octave Recorders (that's new to me,) Clarinet (a different one from the ones I've seen before,) French Horn (also different,) and Glenn Miller (presumably trombone, but once again, a different one from the ones I know.) (What? No Violins?)\n\nAmazing how the same sets of sounds, however many generations from the original tapes, can sound so different each time someone samples them. Somewhere along the line, somebody probably put these sounds through a low-pass filter. Consequently, they have a fat, bassy sound. Whether you want that depends on, well, whether you want that. In my humbug opinion, several of these sounds have superior counterparts in the Mike Pinder or M-Tron libraries (never mind the remastered Venice Audio samples, which are practically a different beast.) But there are a few distinctly different samples in this library, so it has its merits.","torrent":{"xt":"urn:btih:a6784ea0c8b87513e22359df69328246446973df","amp;dn":"PureMagnetik+Microtron+%283+Tape+Sets%29+for+Kontakt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6784ea0c8b87513e22359df69328246446973df","infoHashBuffer":{"type":"Buffer","data":[166,120,78,160,200,184,117,19,226,35,89,223,105,50,130,70,68,105,115,223]},"announce":[],"urlList":[]}}