{"title":"Pete Seeger (1973) - Rainbow Race","uid":7004734,"size":42084372,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a699a69f80007456a1713d6dbe250033d4eaf775&amp;dn=Pete+Seeger+%281973%29+-+Rainbow+Race&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jonzo666","files":10,"time":1328226791,"description":"Pete Seeger (1973) - Rainbow Race\n\nAfter the traumatic year of 1968, when the American Left lost Civil Rights leader Dr. Martin Luther King, Jr., and anti-war presidential candidate Senator Robert F. Kennedy to assassins, culminating in the Poor People's March on Washington, the police riot at the Democratic National Convention in Chicago, and the election of Richard Nixon, a supporter of the Vietnam War, as president, Pete Seeger briefly flirted with giving up singing. Instead, he grew a beard and, adopting the &quot;Think global, act local&quot; philosophy, helped build the sloop Clearwater, which sailed the Hudson River, advocating the cleanup of that polluted waterway (which runs beside his home in Beacon, NY), and ecology in general. Seeger's changes of appearance and focus were not reflected in his 1969 Columbia Records album Young vs. Old, a collection of disparate tracks in some cases dating back several years, and then he went uncharacteristically silent on the recording front for a while. Two years on, however, he was back with Rainbow Race, which, starting with a cover picture that shows him in his beard and sailing cap, standing with guitar in hand before a body of water, is very much the work of Pete Seeger the Clearwater captain. Not that he's given up his usual concerns, however. That becomes clear as the music starts with &quot;Last Train to Nuremberg,&quot; the first eight out of ten Seeger originals on the LP, in which he demonstrates that he's been reading the papers since his last album by drawing a direct line between Nazi war crimes and the My Lai massacre in Vietnam, and from there to the then-current political regime in Washington, D.C. Seeger is one with the outrage felt by those on the left at the turn of events in the late '60s, identifying with the confused and dismayed radical longhairs in &quot;Our Generation&quot; and, in that song and &quot;Uncle Ho,&quot; even going so far as to find common cause with the &quot;enemy&quot; in Vietnam. But war protest is not his only interest here; ecology is at least as well represented. Even in &quot;Our Generation,&quot; he begins decrying a world in which people are &quot;knee-deep in garbage,&quot; and on his own &quot;Sailing Down This Golden River&quot; and Georgia Tech English teacher Bud Foote's &quot;The Clearwater&quot; Seeger explains what he and his crew intend to do about it. Seeger is a natural optimist who, like those with whom he shares a political philosophy, has been going through a trying time, and despite his determination, that comes out. The lovely, poetic &quot;Snow Snow&quot; is a wistful song reflecting on death, and much the same can be said of the album closer, &quot;Hobo's Lullaby,&quot; a song Seeger used to sing with Woody Guthrie. Still, in &quot;Old Devil Time&quot; (heard in 1970 as a theme song for the movie Tell Me That You Love Me, Junie Moon) and the title song &quot;My Rainbow Race,&quot; he declares that he will fight on: &quot;And because I love you,&quot; goes the chorus of the latter, sung with a choir of children, &quot;I'll give it one more try/To show my rainbow race/It's too soon to die.&quot; \n\nTracklist:\n\n01 - Last Train To Nuremberg\n02 - Sailing Down This Golden River\n03 - Uncle Ho\n04 - Snow, Snow\n05 - My Rainbow Race\n06 - Our Generation\n07 - Old Devil Time\n08 - The Clearwater\n09 - Words, Words, Words\n10 - Hobo's Lullaby\n\nMp3, 192 Kbps.","torrent":{"xt":"urn:btih:a699a69f80007456a1713d6dbe250033d4eaf775","amp;dn":"Pete+Seeger+%281973%29+-+Rainbow+Race","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a699a69f80007456a1713d6dbe250033d4eaf775","infoHashBuffer":{"type":"Buffer","data":[166,153,166,159,128,0,116,86,161,113,61,109,190,37,0,51,212,234,247,117]},"announce":[],"urlList":[]}}