{"title":"Batman: Arkham Asylum GOTY Edition [Multi-5] 2010 TRiViUM","uid":6110019,"size":8491038923,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a6e1b3b78b76375fe803f701a8e93cbd52733a88&amp;dn=Batman%3A+Arkham+Asylum+GOTY+Edition+%5BMulti-5%5D+2010+TRiViUM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Ex_Exist","files":-1,"time":1295314906,"description":"Batman: Arkham Asylum GOTY Edition [ENG|Multi-5][EIDOS] 2010 TRiViUM\n\n                    T e a M  T R i V i U M   P r e s e n t S                 \n                                                                           \n                                                                            \n                   Batman: Arkham Asylum GOTY Edition (c) Eidos              \n                                     *MULTi 5*                              \n                                                                          \n                     RELEASE DATE .................. : 01/2011            \n                     RELEASE SiZE .................... : 1 rar            \n                     PROTECTiON ............... : SecuROM 7.41            \n                                                                          \n                                                                             \n                                   RELEASE NOTES                              \n                                                                          \n                                                                          \n             In Batman: Arkham Asylum the player assumes the role of      \n             Batman as he delivers The Joker to Arkham Asylum. There,     \n             the imprisoned super-villains have set a trap and an         \n             immersive combat gaming experience unfolds. With an          \n             original script penned by Emmy Award-winning Batman          \n             writer Paul Dini, the game brings the universe of DC         \n             Comics' detective to life!                                   \n             Batman: Arkham Asylum exposes players to a unique, dark      \n             and atmospheric adventure that takes them to the depths      \n             of Arkham Asylum - Gotham's psychiatric hospital for the     \n             criminally insane. Gamers will move in the shadows,          \n             instigate fear amongst their enemies and confront The        \n             Joker and Gotham City's most notorious villains who have     \n             taken over the asylum. Using a wide range of Batman's        \n             gadgets and abilities, players will become the invisible     \n             predator and attempt to foil The Joker's demented scheme.    \n             Expanding the gameplay of the original boxed edition, the    \n             Batman: Arkham Asylum - Game of the Year Edition comes       \n             with all six previously released Downloadable Content        \n             Challenge Maps on disc, giving players further opportunity   \n             to hone their combat skills. Gamers can face-off against     \n             Arkham Asylum's toughest inmates in some of the iconic       \n             environs from the game such as the infamous Crime Alley      \n             and the insane Scarecrow Nightmare. The Game of the Year     \n             Edition also offers a play-in-3D option compatible with      \n             all standard and high definition TV sets.                    \n                                                                          \n                                                                          \n             Features:                                                    \n                                                                          \n              - Utilize the unique FreeFlowTM combat system to chain      \n                together unlimited combos seamlessly and battle with      \n                huge groups of The Joker's henchmen in brutal melee       \n                brawls                                                    \n              - Investigate as Batman, the WORLD'S GREATEST DETECTIVE,    \n                by solving intricate puzzles with the help of cutting     \n                edge forensic tools including x-ray scanning,             \n                fingerprint scans, &quot;Amido Black&quot; spray and a pheromone    \n                tracker                                                   \n              - Face off against Gotham's greatest villains including     \n                The Joker, HARLEY QUINN, POISON IVY and KILLER CROC       \n              - Become the Invisible Predator with Batman's fear          \n                takedowns and unique vantage point system to move         \n                without being seen and hunt enemies                       \n              - Choose multiple takedown methods, including swooping      \n                from the sky and smashing through walls.                  \n              - Explore every inch of Arkham Asylum and roam freely on    \n                the infamous island, presented for the first time ever    \n                in its gritty and realistic entirety                      \n              - Experience what it's like to be BATMAN using BATARANGS,   \n                explosive gel aerosol, The Batclaw, sonar resonator and   \n                the line launcher                                         \n              - Unlock more secrets by completing hidden challenges in    \n                the world and develop and customize equipment by earning  \n                experience points                                         \n              - Enjoy complete superhero freedom in the environment with  \n                the use of Batman's grapnel gun to get to any place you   \n                can see, jump from any height and glide in any direction  \n                                                                          \n                                                                             \n                                   iNSTALL NOTES                              \n                                                                              \n                                                                            \n                    - Unpack                                               \n                    - Install the game                                    \n                    - Copy the cracked content from the TRiViUM folder    \n                    - Enjoy ;)                                            \n                                                                          \n                                                                             \n                                    GROUP NOTES                               \n                                                                              \n                                                                            \n                            Greets: THETA, TSRh, tPORt                     \n                                                                            \n                                                                            \n-------------------------------------------------------------------\n\n\nall the useful information in the file trivium.nfo and\n\n &lt;a href=&quot;\nhttp://peerat.ru:8080/forum/viewtopic.php?t=4010&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://peerat.ru:8080/forum/viewtopic.php?t=4010&lt;/a&gt;\n\n\n-------------------------------------------------------------------\n\n\n","torrent":{"xt":"urn:btih:a6e1b3b78b76375fe803f701a8e93cbd52733a88","amp;dn":"Batman%3A+Arkham+Asylum+GOTY+Edition+%5BMulti-5%5D+2010+TRiViUM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6e1b3b78b76375fe803f701a8e93cbd52733a88","infoHashBuffer":{"type":"Buffer","data":[166,225,179,183,139,118,55,95,232,3,247,1,168,233,60,189,82,115,58,136]},"announce":[],"urlList":[]}}