{"title":"Various Artists - The Stiff Records Box Set","uid":4198462,"size":443471038,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a6f8a0746565a83c80f4a11ac6ccdea646f2b177&amp;dn=Various+Artists+-+The+Stiff+Records+Box+Set&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"syniker","files":100,"time":1211369041,"description":"\\\\\\&quot;Stiff Records was a maverick among British independent record labels, partially responsible for starting the punk and new wave revolution of the late \\\\\\&amp;#039;70s. Under the guidance of house producer Nick Lowe, Stiff turned out an enormous number of seminal punk and new wave singles in their first years, including classic tracks by the Damned, Elvis Costello, Graham Parker, the Adverts, Ian Dury, and Lowe himself. But what really gave the label its wild, original flavor were minor artists like Ian Dury, Wreckless Eric, Tenpole Tudor, the Yachts, Lene Lovich, Rachel Sweet, and Mickey Jupp, who turned out a series of raw pop gems that were everything good rock &amp; roll singles should be -- catchy, energetic, and memorable. Over 100 of Stiff\\\\\\&amp;#039;s finest tracks are collected on this wonderful four-disc box set. While most of these songs weren\\\\\\&amp;#039;t hits, they are classic rock &amp; roll. The first three discs are excellent; the fourth disc contains some bright moments, but by that time, their artists were pretty much spent. However, the box remains one of the most compulsively listenable sets ever assembled, providing the definitive retrospective of arguably the most important and influential British record label of the late \\\\\\&amp;#039;70s.\\\\\\&quot;\n\nquote from allmusic.com","torrent":{"xt":"urn:btih:a6f8a0746565a83c80f4a11ac6ccdea646f2b177","amp;dn":"Various+Artists+-+The+Stiff+Records+Box+Set","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6f8a0746565a83c80f4a11ac6ccdea646f2b177","infoHashBuffer":{"type":"Buffer","data":[166,248,160,116,101,101,168,60,128,244,161,26,198,204,222,166,70,242,177,119]},"announce":[],"urlList":[]}}