{"title":"PetiteHDPorn - Piper Perri (Sky Spiri) NEW 12 November 2015","uid":12747069,"size":223361904,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:a7973b2c6d1154f88210b606342a94e807e9b7a1&amp;dn=PetiteHDPorn+-+Piper+Perri+%28Sky+Spiri%29+NEW+12+November+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1447325446,"description":"Lusty blonde Piper Perri peels off her clothes in a striptease that gets her hot and horny and wet enough to press a finger deep into her creamy fuck hole. Bambino is happy to have Piper put that craving for a good time to use by encouraging her to take his dick into her mouth for a long luxurious cock sucking. When he pulls her into a standing 69 for a taste of her juicy twat, Piper groans her excitement while she continues to enjoy a big dong in her mouth.Just a taste of Bambino's member isn't enough. Kneeling down, she presents her lush snatch for a doggy style fuck and then squeals with joy when Bambino picks her up to lift her high into the air and slam into her juicy wetness. When Bambino returns Piper to the ground, she keeps her thighs parted and her body pliant to keep on taking his pussy pounding thrusts.Piper is still in that position when Bambino can't hold back another moment. Pulling out, he uses his hand to bring himself the final few steps towards a climax that covers Piper's shaved snatch and bottom with globs of hot sticky cum.\r\nTags: Medium Boobs, Shaved Pussy, Short Girls, Blonde, Long hair, Braces, Hardcore, Thongs, High Heels, Petite, Tan Lines, Girl-Boy, Blowjob, Deep Throat\r\n \nhttp://imgdone.com/viewer.php?file=96765726738243734519.jpg\r\n \nhttp://imgdone.com/viewer.php?file=58530700965642791622.jpg","torrent":{"xt":"urn:btih:a7973b2c6d1154f88210b606342a94e807e9b7a1","amp;dn":"PetiteHDPorn+-+Piper+Perri+%28Sky+Spiri%29+NEW+12+November+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7973b2c6d1154f88210b606342a94e807e9b7a1","infoHashBuffer":{"type":"Buffer","data":[167,151,59,44,109,17,84,248,130,16,182,6,52,42,148,232,7,233,183,161]},"announce":[],"urlList":[]}}