{"title":"Security Design Consulting{BBS}","uid":6629698,"size":6888011,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a7e1f73f2d25e35767636a6902eda62271dcb94e&amp;dn=Security+Design+Consulting%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314286209,"description":"A crucial reference for the practicing or aspiring design consultant, Security Design Consulting brings you step by step through the process of becoming a security consultant, describing how to start the business, market services, write proposals, determine fees, and write a report. Specific elements of assessment, design and project management services as well as acquiring product and industry knowledge are all covered in detail. Concentrating on client-focused marketing and sales strategies as well as the crucial elements of preparing, running, and succeeding at the security consulting business, Security Design Consulting gives the reader a working knowledge of all the steps necessary to be a successful security design consultant and a smarter business owner. Security directors, architects and security management consultants will also find this reference invaluable in understanding the security design consultant's important and growing role in an overall security program.\n\n* Focuses on consulting in security design, not security management\n* Provides sample service agreements, specifications, and reports to use as models\n* Emphasizes the highest technical and ethical standards for this increasingly crucial profession\nAbout the Author\nBrian Gouin, PSP, CSC has been an independent security design consultant since 2001. He owns Strategic Design Services, LLC, based in Portland, CT, a firm specializing in assessment, design and project management services for electronic and physical security. Prior to becoming a consultant, Brian owned a successful security installation firm. His professional memberships include the American Society for Industrial Security, International (ASIS), the International Association of Professional Security Consultants (IAPSC), the National Fire Protection Association (NFPA), The Association of School Business Officials International (ASBO) and the National Association of Chiefs of Police. Brian has served as a Director for the Board of the IAPSC as well as an item writer for both the PSP and CSC certifications.\n\n\n\n    * Hardcover: 352 pages\n    * Publisher: Butterworth-Heinemann (May 16, 2007)\n    * Language: English\n    * ISBN-10: 0750676884\n    * ISBN-13: 978-0750676885","torrent":{"xt":"urn:btih:a7e1f73f2d25e35767636a6902eda62271dcb94e","amp;dn":"Security+Design+Consulting%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7e1f73f2d25e35767636a6902eda62271dcb94e","infoHashBuffer":{"type":"Buffer","data":[167,225,247,63,45,37,227,87,103,99,106,105,2,237,166,34,113,220,185,78]},"announce":[],"urlList":[]}}