{"title":"Rock Festival Stamping Ground 1970.mp4","uid":10627653,"size":1323487202,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a8722e1bc197f1a74f724b1ced22d0e13aa24687&amp;dn=Rock+Festival+Stamping+Ground+1970.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lorefolk","files":1,"time":1406253602,"description":"The Kralingen Music Festival was a music festival held in the Kralingse Bos, in the Kralingen neighbourhood of Rotterdam, on the 26th-28th June 1970.[1] Performing bands included Tyrannosaurus Rex, The Byrds, Santana, Jefferson Airplane, and the headlining Pink Floyd. Approximately 150.000 attended. Festival posters show that the festival was billed in Dutch as 'Pop Paradijs' and 'Holland Pop Festival 70', and that the main investor was Coca-Cola.[2] In both English and Dutch, the festival is also known by the English name Stamping Ground, and is often billed as the European answer to Woodstock.[1][3][4] It took place approximately one year after Woodstock, and two months before the third 1970 Isle of Wight Festival (the first two being held in 1968 and 1969).\n\nThe Festival became an influential event, as it turned out to be the actual beginning of the Dutch tolerance policy towards marijuana. The many present undercover cops did not arrest any of the users or small traders: it became clear that there were just too many, and all of them peaceful.\n\nIn 1971 a documentary about the festival appeared, titled Stamping Ground, created by George Sluizer. The film was made for an international audience and is also known under the titles Love and Music, and in Germany Rock Fieber. Also, several books and exhibitions have been dedicated to the event. A triple lp-boxset was released in 2010.\n\nSince 21 September, 2013, a memorial has been placed in the Kralingse Bos area, to commemorate the first multi-day open air popfestival on the European continent.","torrent":{"xt":"urn:btih:a8722e1bc197f1a74f724b1ced22d0e13aa24687","amp;dn":"Rock+Festival+Stamping+Ground+1970.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8722e1bc197f1a74f724b1ced22d0e13aa24687","infoHashBuffer":{"type":"Buffer","data":[168,114,46,27,193,151,241,167,79,114,75,28,237,34,208,225,58,162,70,135]},"announce":[],"urlList":[]}}