{"title":"Verve Jazz Masters 28 - Charlie Parker Plays Standards (1994) [J","uid":4976447,"size":96354190,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a89a49dcc6bca7d4bea84d49803a000d60031c47&amp;dn=Verve+Jazz+Masters+28+-+Charlie+Parker+Plays+Standards+%281994%29+%5BJ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":21,"time":1246025948,"description":"Verve Jazz Masters 28 - Charlie Parker Plays Standards \nAudio CD: October 18, 1994 \nOriginal Release Date: October 18, 1994 \nLabel: Polygram Records \nBitrate: 192 kbps\n\nOne of a handful of musicians who can be said to have permanently changed jazz, Charlie Parker was arguably the greatest saxophonist of all time.  He could play remarkably fast lines that, if slowed down to half speed, would reveal that every note made sense.  &quot;Bird,&quot; along with his contemporaries Dizzy Gillespie and Bud Powell, is considered a founder of bebop; in reality he was an intuitive player who simply was expressing himself.  Rather than basing his improvisations closely on the melody as was done in swing, he was a master of chordal improvising, creating new melodies that were based on the structure of a song.  In fact, Bird wrote several future standards (such as &quot;Anthropology,&quot; &quot;Ornithology,&quot; &quot;Scrapple from the Apple,&quot; and &quot;Ko Ko,&quot; along with such blues numbers as &quot;Now's the Time&quot; and &quot;Parker's Mood&quot; ) that &quot;borrowed&quot; and modernized the chord structures of older tunes.  Parker's remarkable technique, fairly original sound, and ability to come up with harmonically advanced phrases that could be both logical and whimsical were highly influential.  By 1950, it was impossible to play &quot;modern jazz&quot; with credibility without closely studying Charlie Parker.  Born in Kansas City, KS, Charlie Parker grew up in Kansas City, MO.  He first played baritone horn before switching to alto.  Parker was so enamored of the rich Kansas City music scene that he dropped out of school when he was 14, even though his musicianship at that point was questionable (with his ideas coming out faster than his fingers could play them).  After a few humiliations at jam sessions, Bird worked hard woodshedding over one summer, building up his technique and mastery of the fundamentals.  By 1937, when he first joined Jay McShann's Orchestra, he was already a long way toward becoming a major player.  Charlie Parker, who was early on influenced by Lester Young and the sound of Buster Smith, visited New York for the first time in 1939, working as a dishwasher at one point so he could hear Art Tatum play on a nightly basis.  He made his recording debut with Jay McShann in 1940, creating remarkable solos with a small group from McShann's orchestra on &quot;Oh, Lady Be Good&quot; and &quot;Honeysuckle Rose. &quot; When the McShann big band arrived in New York in 1941, Parker had short solos on a few of their studio blues records, and his broadcasts with the orchestra greatly impressed (and sometimes scared) other musicians who had never heard his ideas before.  Parker, who had met and jammed with Dizzy Gillespie for the first time in 1940, had a short stint with Noble Sissle's band in 1942, played tenor with Earl Hines' sadly unrecorded bop band of 1943, and spent a few months in 1944 with Billy Eckstine's orchestra, leaving before that group made their first records.  Gillespie was also in the Hines and Eckstine big bands, and the duo became a team starting in late 1944.  Although Charlie Parker recorded with Tiny Grimes' combo in 1944, it was his collaborations with Dizzy Gillespie in 1945 that startled the jazz world.  To hear the two virtuosos play rapid unisons on such new songs as &quot;Groovin' High,&quot; &quot;Dizzy Atmosphere,&quot; &quot;Shaw 'Nuff,&quot; &quot;Salt Peanuts,&quot; and &quot;Hot House,&quot; and then launch into fiery and unpredictable solos could be an upsetting experience for listeners much more familiar with Glenn Miller and Benny Goodman.  Although the new music was evolutionary rather than revolutionary, the recording strike of 1943-1944 resulted in bebop arriving fully formed on records, seemingly out of nowhere.  Unfortunately, Charlie Parker was a heroin addict ever since he was a teenager, and some other musicians who idolized Bird foolishly took up drugs in the hope that it would elevate their playing to his level.  When Gillespie and Parker (known as &quot;Diz and Bird&quot; ) traveled to Los Angeles and were met with a mixture of hostility and indifference (except by younger musicians who listened closely), they decided to return to New York.  Impulsively, Parker cashed in his ticket, ended up staying in L. A. , and, after some recordings and performances (including a classic version of &quot;Oh, Lady Be Good&quot; with Jazz at the Philharmonic), the lack of drugs (which he combated by drinking an excess of liquor) resulted in a mental breakdown and six months of confinement at the Camarillo State Hospital.  Released in January 1947, Parker soon headed back to New York and engaged in some of the most rewarding playing of his career, leading a quintet that included Miles Davis, Duke Jordan, Tommy Potter, and Max Roach.  Parker, who recorded simultaneously for the Savoy and Dial labels, was in peak form during the 1947-1951 period, visiting Europe in 1949 and 1950, and realizing a lifelong dream to record with strings starting in 1949 when he switched to Norman Granz's Verve label.  But Charlie Parker, due to his drug addiction and chance-taking personality, enjoyed playing with fire too much.  In 1951, his cabaret license was revoked in New York (making it difficult for him to play in clubs) and he became increasingly unreliable.  Although he could still play at his best when he was inspired (such as at the 1953 Massey Hall concert with Gillespie), Bird was heading downhill.  In 1954, he twice attempted suicide before spending time in Bellevue.  His health, shaken by a very full if brief life of excesses, gradually declined, and when he died in March 1955 at the age of 34, he could have passed for 64.  Charlie Parker, who was a legendary figure during his lifetime, has if anything grown in stature since his death.  Virtually all of his studio recordings are available on CD along with a countless number of radio broadcasts and club appearances.  Clint Eastwood put together a well-intentioned if simplified movie about aspects of his life (Bird).  Parker's influence, after the rise of John Coltrane, has become more indirect than direct, but jazz would sound a great deal different if Charlie Parker had not existed.  The phrase &quot;Bird Lives&quot; (which was scrawled as graffiti after his death) is still very true.  ~ Scott Yanow, All Music Guide \n\nVerve Jazz Masters 28 - Charlie Parker Plays Standards Tracks:\n01  Love For Sale 5:37 \n02  If I Should Lose You 2:48 \n03  Almost Like Being In Love 2:36 \n04  Why Do I Love You? 3:08 \n05  I Remember You 3:05 \n06  Easy To Love 2:22 \n07  Old Folks 3:37 \n08  I Got Rhythm 12:56 \n09  Laura 3:00 \n10  Estrellita (Little Star)-Alternative Take 2:48 \n11  What Is This Thing Called Love? 2:39 \n12  Embraceable You 10:35 \n13  I Love Paris 5:09 \n14  How High The Moon? 6:22 \n\n","torrent":{"xt":"urn:btih:a89a49dcc6bca7d4bea84d49803a000d60031c47","amp;dn":"Verve+Jazz+Masters+28+-+Charlie+Parker+Plays+Standards+%281994%29+%5BJ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a89a49dcc6bca7d4bea84d49803a000d60031c47","infoHashBuffer":{"type":"Buffer","data":[168,154,73,220,198,188,167,212,190,168,77,73,128,58,0,13,96,3,28,71]},"announce":[],"urlList":[]}}