{"title":"Hospital Ships - Destruction in Yr Soul (2013) [FLAC]","uid":8583236,"size":262697638,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a8ce6bac8022b53d20b275ce061fe8d925cd80a4&amp;dn=Hospital+Ships+-+Destruction+in+Yr+Soul+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1371468875,"description":"\n  Hospital Ships - Destruction in Yr Soul (2013) [FLAC]\n\n  Released: 2013\n  Genre: Pop/Rock\n  Styles: Post-Rock, Alternative, Indie Rock, Indie Pop\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 850 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Come Back to Life\n  02 Joan of Arc\n  03 If It Speaks\n  04 Desolation Waltz\n  05 Lost Folk Song\n  06 All Yr Gold\n  07 Servants\n  08 Remaining Light\n\n  In the early days of his Hospital Ships project, Jordan Geiger was the act's sole member, making delightfully spare lo-fi twee pop with almost transparently whispery vocals steering the ship. With third album Destruction in Yr Soul, the lo-fi trappings and solitary construction of his nascent output give way to brightened production and full-band performances without losing any of the insular charm that made the project so warm and approachable to begin with. Geiger's voice has long been compared to Daniel Johnston's nasal croon, and his penchant for ramshackle production owes some influence to early Flaming Lips. Even the project's name is taken from a Flaming Lips tune from their 1995 masterpiece, Clouds Taste Metallic. The clearer tones and textures of the eight songs here add new depth to Hospital Ships' sound, and the longer form and meandering structure of the compositions highlight more similarities to guitar-driven legends Built to Spill and other Neil Young-adoring indie rock acts. \n\n  Geiger sounds strikingly like Built to Spill vocalist Doug Martsch on building album opener &quot;Come Back to Life,&quot; and the woozy amble of &quot;Desolation Waltz&quot; is way more Keep It Like a Secret than Soft Bulletin. Still, the blown-out drum samples and occasional random bursts of distorted piano that accent melodic rave-ups like &quot;Joan of Arc&quot; touch on a silent history of freaked-out production values from the likes of the Elephant 6 collective, masters like the Flaming Lips, and more recent carriers of the homespun torch like John Vanderslice and Unknown Mortal Orchestra. Dark themes of death, suffering, and internal mayhem are buried in the relatively upbeat sonics here, with lines like &quot;All I wanted was you and the sweet relief of death&quot; popping out through the seemingly happy layers of noisy pop. The heavy lyrics are curious in the framework of mostly bright sonics, but the combination makes Destruction in Yr Soul a more thought-provoking listen, drawing the listener back to certain phrases or sections of its colorful pastiche of sounds to better understand its unique duality.","torrent":{"xt":"urn:btih:a8ce6bac8022b53d20b275ce061fe8d925cd80a4","amp;dn":"Hospital+Ships+-+Destruction+in+Yr+Soul+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8ce6bac8022b53d20b275ce061fe8d925cd80a4","infoHashBuffer":{"type":"Buffer","data":[168,206,107,172,128,34,181,61,32,178,117,206,6,31,232,217,37,205,128,164]},"announce":[],"urlList":[]}}