{"title":"Lenny (1974)","uid":4543549,"size":1449214025,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a8d318048431a46584ddc6cfa5bef06e49bc59fd&amp;dn=Lenny+%281974%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Malinkaz","files":-1,"time":1228044190,"description":"Lenny (1974)\n\nBefore there were any comedians who dared use an unholy word on the stage, or talk about taboo subjects, there was &quot;Lenny Bruce&quot;. No comedian today, worth his weight, did it without the courage and groundbreaking heroism of this one man.  In a sense, he paid the price for every new comic on the scene in our modern times. He was the 1st.   He was arrested numerous times, stripped of his wealth continuously, ostracized and ridiculed, but we all owe him a debt of gratitude.  \n\nBased loosely on the Broadway play, this film biography of late comedian Lenny Bruce captures his fiery brand of provocative humor while looking at his less-than-savory personal life. Dustin Hoffman earned an Oscar nomination for his portrayal of Bruce, a seminal figure in stand-up comedy who broke boundaries of language and subject matter by questioning hypocrisy and telling it hilariously like he saw it. Director Bob Fosse, working with cinematographer Bruce Surtees, used black-and-white to capture the shadowy nightclub world in which Bruce rose and fell, bleakly depicting the eventual loss of his livelihood when he became a victim of governmental obscenity prosecution. Hoffman is ably supported by Valerie Perrine as Bruce&amp;#039;s stripper wife, Honey, as much a victim as a lover for Bruce. \n\n\nTwo-time Oscar(r) winner* Dustin Hoffman brings controversial 60s comedian Lenny Bruce to life in this landmark (Variety) film that earned six Oscar(r) nominations,** including Best Picture. A jagged portrait of a man driven to mainlining honesty into the arteries of a hypocritical culture (Newsweek), Lenny is artful, imaginative (Los Angeles Times) and truly an extraordinary film (Saturday Review)! From his first gig as a nervous Catskill comedian, it&amp;#039;s obvious that Lenny Bruce is a force to be reckoned with. Armed with a shocking routine and a stripper as his muse (Valerie Perrine), Lenny turns comedy and America on its ear with his abrasive and often offensive humor. But life in the smoke-filled bars of the comedy circuit begins to take its toll. The drugs and arrests for his subject matter wear heavily on this maverick crusader but don&amp;#039;t stop him from pushing the envelope right to his tragic and myth-making end.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0071746/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0071746/&lt;/a&gt;","torrent":{"xt":"urn:btih:a8d318048431a46584ddc6cfa5bef06e49bc59fd","amp;dn":"Lenny+%281974%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8d318048431a46584ddc6cfa5bef06e49bc59fd","infoHashBuffer":{"type":"Buffer","data":[168,211,24,4,132,49,164,101,132,221,198,207,165,190,240,110,73,188,89,253]},"announce":[],"urlList":[]}}