{"title":"Far.Cry.Cider.Port.Mac-thebeast09","uid":4111164,"size":2733189873,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:aacefd93868156fd41331b1acd75aa30c5d47673&amp;dn=Far.Cry.Cider.Port.Mac-thebeast09&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thebeast09","files":1,"time":1207067085,"description":"     A cider port of the popular PC game Far Cry! Worked well wiht my black MacBook (2.3ghz and 2 gigs of RAM)Comment if you have any problems! Enjoy!\n\n\n\nFar Cry is a first-person shooter computer game developed by Crytek Studios from Germany and published by Ubisoft on March 23, 2004 for Windows. Far Cry sold 730,000 units within four months of release[1] and has currently sold over 1 million copies worldwide. The original game has since spawned several console ports and a movie.\n\nThe game&amp;#039;s story follows an ex-Special Forces operator, Jack Carver, who is stranded on a mysterious archipelago in Micronesia. He is searching for a female journalist he was escorting after she went missing when their boat was destroyed by mercenaries. The game includes thematic elements relating to the dangers of genetic engineering and the genocide of local islanders as can be seen by the deformed creatures created by a mad scientist named Krieger. Also, a mysterious backdrop relating to dinosaurs is revealed via in-game radios that will sometimes carry programs that discuss the history of dinosaurs and the possibility that some might still be alive. This is further developed by appearance of lizard-like animals (which resemble small dinosaurs) that reside in the jungles on the island.\n\nThe terrain in Far Cry varies greatly. Set on a South Pacific archipelago, the landscape includes beaches, tropical rainforests, dense jungles, towering canyons, mines, swamps, and even volcanic forests. Many of the interiors range from simple beach huts and army camps to elaborate complexes, an underground temple, and ultra-modern research labs. Several of these mazes use the remains of WWII Japanese-era fortifications and bunkers.","torrent":{"xt":"urn:btih:aacefd93868156fd41331b1acd75aa30c5d47673","amp;dn":"Far.Cry.Cider.Port.Mac-thebeast09","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aacefd93868156fd41331b1acd75aa30c5d47673","infoHashBuffer":{"type":"Buffer","data":[170,206,253,147,134,129,86,253,65,51,27,26,205,117,170,48,197,212,118,115]},"announce":[],"urlList":[]}}