{"title":"Gerry Mulligan - Re-birth Of The Cool (1992)","uid":5483579,"size":120295485,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ac5042e97b7db9ae094b7fa85a6922dde6d3a95f&amp;dn=Gerry+Mulligan+-+Re-birth+Of+The+Cool+%281992%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"artpepper","files":-1,"time":1270575564,"description":"Gerry Mulligan - Re-birth Of The Cool\n\nGRP Records | HQ MP3 | CBR-320kbps | 105MB\n\n\nThe most famous and probably greatest jazz baritonist of all time, Gerry Mulligan was a giant. A flexible soloist who was always ready to jam with anyone from Dixielanders to the most advanced boppers, Mulligan brought a somewhat revolutionary light sound to his potentially awkward and brutal horn and played with the speed and dexterity of an altoist. This fascinating disc is most highly recommended to veteran jazz collectors who know the original Birth of the Cool records.\n\n\nTrack Listings:\n\n1. Israel\n2. Deception\n3. Move\n4. Rouge\n5. Rocker\n6. Godchild\n7. Moon Dreams\n8. Venus De Milo\n9. Budo\n10. Boplicity\n11. Darn That Dream\n12. Jeru\n\n\n\n\nIn the summer of 1991 Gerry Mulligan decided to revisit Miles Davis's Birth of the Cool recordings. He discussed it with Miles Davis himself who said he might be interested in participating but sadly Davis died a few months later.\n\nWith Wallace Roney (the perfect sound-alike) in the trumpeter's place, baritonist Mulligan got the band's original pianist and tuba player (John Lewis and Bill Barber), used his own bassist (Dean Johnson) and drummer (Ron Vincent), and found able substitutes in altoist Phil Woods (unfortunately Lee Konitz was unavailable to play his old parts), trombonist Dave Bargeron and John Clark on French horn.\n\nThis GRP CD brings back the dozen Birth of the Cool recordings of 1949-50 with Mel Torme taking Pancho Hagood's vocal on &quot;Darn That Dream.&quot; Although the charts are the same (and it is a particular pleasure to listen to them with the improved recording quality), the solos are all different and in many cases have been lengthened; no need to stick to only three minutes apiece. This fascinating disc is highly recommended to  jazz collectors who know the original Birth of the Cool records. ","torrent":{"xt":"urn:btih:ac5042e97b7db9ae094b7fa85a6922dde6d3a95f","amp;dn":"Gerry+Mulligan+-+Re-birth+Of+The+Cool+%281992%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac5042e97b7db9ae094b7fa85a6922dde6d3a95f","infoHashBuffer":{"type":"Buffer","data":[172,80,66,233,123,125,185,174,9,75,127,168,90,105,34,221,230,211,169,95]},"announce":[],"urlList":[]}}