{"title":"Matemáticas para la computación (ebook)","uid":15035203,"size":19728806,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:acbd82f068e34b4e40566c5cf5fc9459de675260&amp;dn=Matem%26aacute%3Bticas+para+la+computaci%26oacute%3Bn+%28ebook%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"megamente","files":1,"time":1466573210,"description":"Matemáticas para la computacion, José A. Jiménez Murillo\r\nLas matemáticas siempre han sido una de las disciplinas que le cuesta más trabajo entender a los estudiantes. Si se observan las estadísticas de reprobación en las carreras relacionadas con la computación, junto con las matemáticas la materia de programación es una aduana muy difícil de librar. Sin embargo, las matemáticas y la programación constituyen un campo importante, apasionante y ameno. La computación y las matemáticas tienen gran relación entre sí, solo hay que recordar que las computadoras fueron creadas inicialmente para realizar operaciones matemáticas con mayor rapidez, además de que la computación no se podría entender sin las matemáticas.\r\nActualmente la computación es fundamental en todas las actividades que se desarrollan diariamente en la administración, educación, medicina, ingeniería e investigación. El funcionamiento adecuado de una empresa no se podría entender sin la ayuda de la computadora, ¿qué haríamos si se tuviera que regresar al tiempo en que todo se procesaba manualmente?, ¿qué pasaría si no se contara con el correo electrónico, hojas de cálculo, procesadores de texto, lenguajes de programación e internet? Si bien es cierto que todos estos elementos son parte de las acciones que se pueden llevar a cabo en la computadora, también lo es el que las matemáticas proporcionaron el soporte necesario para desarrollar todas estas herramientas computacionales. Ramas de las matemáticas como sistemas numéricos, métodos de conteo, conjuntos, matrices, lógica matemática, algebra booleana, relaciones y funciones son la base para el diseño de todo lo que se maneja en la computadora. Es por esto que surgen las matemáticas para la computación, mismas que permiten entender el aspecto formal de la relación matemáticas-computadora.\r\nEste libro tiene como objetivo fundamental que los alumnos que cursan alguna carrera relacionada con la computación, aprendan con facilidad los conocimientos matemáticos básicos necesarios para entender el principio matemático usado en la creación de herramientas computacionales. Asimismo se espera que el joven que incursiona en el mundo de la computación tenga una visión más clara de los aspectos que se toman en cuenta para el desarrollo y manejo de estructuras de datos, bases de datos, circuitos electrónicos y lenguajes de programación, no para desarrollar un software al final del curso, pero si para tener una mejor visión de todo aquello que ayudo a desarrollar estas herramientas computacionales que hoy usamos y de las cuales somos muy dependientes.\r\n\r\nContenido:\r\nCapítulo 1. Sistemas numéricos\r\nCapítulo 2. Métodos de conteo\r\nCapítulo 3. Conjuntos\r\nCapítulo 4. Lógica matemática\r\nCapítulo 5. Álgebra booleana\r\nCapítulo 6. Relaciones\r\nCapítulo 7. Grafos\r\nCapítulo 8. Árboles\r\nCapítulo 9. Introducción a los lenguajes formales","torrent":{"xt":"urn:btih:acbd82f068e34b4e40566c5cf5fc9459de675260","amp;dn":"Matem%26aacute%3Bticas+para+la+computaci%26oacute%3Bn+%28ebook%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acbd82f068e34b4e40566c5cf5fc9459de675260","infoHashBuffer":{"type":"Buffer","data":[172,189,130,240,104,227,75,78,64,86,108,92,245,252,148,89,222,103,82,96]},"announce":[],"urlList":[]}}