{"title":"iFCB OS X2.4.1 k'd version BL by lfscrew.zip","uid":8519485,"size":15713992,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:adb363e19cef3f7fc08fdc4e4d717e378b75915d&amp;dn=iFCB+OS+X2.4.1+k%27d+version+BL+by+lfscrew.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"skizzolfs","files":1,"time":1369870376,"description":"Info www: http://www.wabbitwanch.com/iFCB.html\n\n\n\nWith iFCB Version 2 on Macintosh OS X, we have expanded the ways to program, annotate and simulate your Behringer FCB1010 MIDI footboard controller.\n\nA graphical user interface that mirrors both the look and operation of the FCB1010 makes programming much easier than the usual footboard &quot;Riverdance&quot;! If speed is your goal, use our expanded matrix view and change a single patch item directly in the grid or select the patch lines and change items at the same time. \n\nVersion 2 expands to support COMMENTS for each patch line!  Plus, you can link the comments to your FCB1010. Any time you load the SYSEX from the FCB1010 all of your comments will be displayed for you automatically.\n\nFCB-BITS - We've also introducing FCB-BITs for iFCB where instead of having to deal with another users complete patch set and over writing your own, you can import selected patches to augment your own sets or export select patches for other iFCB users to use.\n\nWith our expanded simulation mode, the interface perfroms exactly the same as a real FCB1010 so you can easily test your changes to see how they will affect the operation of devices you plan to control via the FCB1010.\n\nProgramming, simulation and comments are only part of iFCB. You can backup, restore and arrange presets with relative ease.\n\nFeatures:\n\nComments - Easily add and link comments to each of your patches\nFCB-BITS - Import/Export patch lines with comments for other iFCB users\nMINI FCB1010 Control palette for SIM mode testing\nEasy access to FCB1010 global settings\nExpanded user manual in process format, many step by step examples\niFCB features both GUI editor AND matrix/grid style editor\nEnhanced editing and patch arranging in spreadsheet mode\nSIM mode to easily test configurations (software and hardware)\nBackup FCB1010 Presets in seconds (allows multple backups)\nRestore FCB1010 presets from any backup file\nManual or automatic version update checks\nBuilt in MIDI control reference files for V-AMP, podXT's, Digitech Whammy, Live\nAbleton LIVE Setup configuration files and documentation\nSystem/MIDI Requirements:\n\nMacintosh OS X - 10.4 or newer, including Snow Leopard and Lion \nBehringer FCB1010 Firmware 2.3 or newer (UNO firmware not supported)\nDedicated Midi Interface: MOTU  MIDISPORT 1x1, 2x2 (UNO not advised)\nNeeds TWO MIDI cables (IN and OUT must be connected to interface)\nFCB1010 Direct Select Mode editing not supported\n1280 x 800 display required for Comments view\nMIDI Interface Warning: \n\nWe highly recommend a dedicated MIDI interface for programming the FCB1010, the most reliable are the ones without the built in cables. Audio interfaces (USB or Firewire), MIDI Controllers (USB), keyboards are hit and miss for reliable SYSEX transfers. Use the Loopback test from within iFCB to test your interface to ensure compliance (steps in how to do it are in the Help Guide).\n\n\n[k'd] By LfsCrew \nBuon Divertimento !! ;D","torrent":{"xt":"urn:btih:adb363e19cef3f7fc08fdc4e4d717e378b75915d","amp;dn":"iFCB+OS+X2.4.1+k%27d+version+BL+by+lfscrew.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adb363e19cef3f7fc08fdc4e4d717e378b75915d","infoHashBuffer":{"type":"Buffer","data":[173,179,99,225,156,239,63,127,192,143,220,78,77,113,126,55,139,117,145,93]},"announce":[],"urlList":[]}}