{"title":"Northwest Passage (1940) Xvid 1cd - Spencer Tracy, Robert Young ","uid":9580347,"size":734373888,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ae6f3d0b0252e3239cd45a54be732d55c203bdbc&amp;dn=Northwest+Passage+%281940%29+Xvid+1cd+-+Spencer+Tracy%2C+Robert+Young+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SaM","files":-1,"time":1391751286,"description":"Northwest Passage (1940) Xvid 1cd - Spencer Tracy, Robert Young - Western Adventure [DDR]\n\nNorthwest Passage is a 1940 film in Technicolor, starring Spencer Tracy, Robert Young, Walter Brennan, Ruth Hussey, and others. It is based on a novel by Kenneth Roberts titled Northwest Passage (1937).\n\nIt is set in the mid 18th century during the French and Indian War (as the Seven Years' War in North America is usually known in the US). It is a partly fictionalised account of the St. Francis Raid, an attack by Rogers' Rangers on Saint Francis (the current Odanak, Quebec), a settlement of the Abenakis, an American Indian tribe. The purpose of the raid is to avenge the many attacks on British settlers and deter further attacks.\n\nThe title is something of a misnomer, since this film is a truncated version of the original story, and only at the end do we find that Rogers and his men are about to go on a search for the Northwest Passage.\n\n    CAST:-\n    Spencer Tracy as Major Rogers\n    Robert Young as Langdon Towne\n    Walter Brennan as &quot;Hunk&quot; Marriner\n    Ruth Hussey as Elizabeth Browne\n    Nat Pendleton as &quot;Cap&quot; Huff\n    Louis Hector as Reverend Browne\n    Robert Barrat as Humphrey Towne\n    Lumsden Hare as Lord Amherst\n\nDirected by King Vidor\nProduced by Hunt Stromberg\nWritten by Laurence Stallings, Talbot Jennings\nMusic by Herbert Stothart\nRunning time 125 minutes\n\nMOVIE REVIEW:- Northwest Passage (1940)\nThe film opens in the year 1759 with the arrival of Langdon Towne (Robert Young) in Portsmouth, New Hampshire. The son of a cordage (rope)- maker and ship rigger, he returns from Harvard University after being expelled for complaining about college food and drawing an unflattering picture of the President of Harvard College. Though disappointed, Langdon's family greets him with love, as does Elizabeth Browne (Ruth Hussey), the daughter of a noted clergyman. Elizabeth's father (Louis Hector) is less welcoming, however, and denigrates Langdon's aspirations to becoming a painter. That evening, while drinking in the local tavern with friend Sam Livermore (Lester Matthews), Langdon makes indiscreet remarks disparaging Wiseman Clagett (Montagu Love), the king's attorney, and the Indian agent, Sir William Johnson, unaware that Clagett is sitting in the next room with another official. \n\nFacing arrest for his comments, Langdon fights the two men with the help of &quot;Hunk&quot; Marriner (Walter Brennan), a local woodsman and friend, before they both escape into the woods.\n\nAs they flee westward, Langdon and Marriner stop in a backwoods tavern for something to drink. There they meet a man in a green uniform who treats them to a drink called &quot;Flip&quot; which is similar to hot buttered rum, after they help him with a drunk American Indian. After a night of drinking, the two men wake up at Fort Crown Point, where they are told that the man they had met was Major Rogers (Spencer Tracy), the commander of Rogers' Rangers. Needing Langdon's mapmaking skills, Rogers recruits the two men for his latest expedition, one to destroy the hostile Abenakis tribe and their town of St. Francis far to the north.\n\nSetting out at dusk, Rogers' force rows north using whale boats on Lake Champlain. Traveling by night, they successfully evade river patrols by French forces but are forced to send several soldiers back to the fort after a confrontation with Mohawk scouts who were dismissed by Rogers. During the confrontation, a powder keg explodes which injures some of his force. However, Rogers not only sends back the injured to Crown Point, but the disloyal Mohawks provided him by Sir William Johnson (Frederick Worlock), and a number of his men who didn't obey orders to avoid a confrontation with the Mohawks. Although his force is depleted, the rangers move onto their objective. Concealing their boats for a much later return, the force marches northward through swampland, avoiding dry land wherever possible to conceal their movements. When informed by his Stockbridge Indian scouts left to watch over the boats that the French have captured their boats and extra supplies, Rogers revises his plan and sends an injured officer back to Fort Crown Point requesting the British to send supplies to old Fort Wentworth, where the returning rangers will meet them.\n\nAfter making a human chain to cross an unbridged river, the rangers reach St. Francis. The force succeeds in their attack, setting fire to the dwellings and cutting the Abenakis off from retreat. When the battle is over, however, the rangers find only a few baskets of parched corn with which to replenish their dwindling provisions. Worse, as Marriner is searching the destroyed village, he comes across a prostrate Langdon suffering from a bullet wound in his abdomen. Facing hostile forces and a long march with only meager supplies, the rangers set out on their course to Wentworth, trying to evade the French and Indians pursuing them. Their initial objective is Lake Memphremagog, with the injured Langdon bringing up the rear.\n\nTen days later, Rogers' men reach the hills just above Lake Memphremagog, where they hope to find food by stopping to hunt and fish. Encountering signs of French activity, Rogers prefers to press on to Fort Wentworth a hundred miles distant, but the men vote to split up into four parties and fan out in search of game to eat. Game proves scare, though; worse, two of the detachments are ambushed by the French and most of the men killed.\n\nAfter persevering through harsh conditions, Rogers and the remaining fifty men finally reach the fort, only to find it unoccupied and in a state of disrepair. The hoped-for British relief column has not arrived. Though personally despairing, Rogers attempts to rally the men, who are on the verge of collapse. As Rogers attempts to perk up their flagging spirits with a prayer, they hear the fifes and drums of approaching British boats with the supplies. Reporting that the Abenakis are destroyed, the British do Rogers' men the honor of presenting their firearms and shouting &quot;Huzzah&quot;. After returning to Portsmouth, Langdon reunites with Elizabeth while Rogers' Rangers are given a new mission: to find the Northwest Passage. \n\nRoger's fires them up with a brief speech telling them of all the wonders they will see while they march towards the first point of embarkation, a little fort called &quot;Detroit.&quot; He passes by Langdon and Elizabeth to say goodbye where Elizabeth informs him that she and Langdon are headed for London where she is hopeful he will learn to become a great painter. \n\nRogers bids them farewell and marches down the road and off into the sunset.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 125 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]\nDuration: 125 mins","torrent":{"xt":"urn:btih:ae6f3d0b0252e3239cd45a54be732d55c203bdbc","amp;dn":"Northwest+Passage+%281940%29+Xvid+1cd+-+Spencer+Tracy%2C+Robert+Young+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae6f3d0b0252e3239cd45a54be732d55c203bdbc","infoHashBuffer":{"type":"Buffer","data":[174,111,61,11,2,82,227,35,156,212,90,84,190,115,45,85,194,3,189,188]},"announce":[],"urlList":[]}}