{"title":"Byzantine Art by David Talbot Rice (Penguin Art Ebook).pdf","uid":11757375,"size":79553649,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af4c7a7075b1650296d10b97dd1c7216013b8f59&amp;dn=Byzantine+Art+by+David+Talbot+Rice+%28Penguin+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"STBGD","files":1,"time":1426454173,"description":"Byzantine Art\nPenguin Books | 1968 | English | 610 pages | PDF | 76 MB\n\nThis, the best short account of Byzantine art in English, has been thoroughly revised since its first publication over thirty years ago. Professor Talbot Rice has now brought his text fully up to date for this new edition, in which a lavish selection of fresh illustrations is accompanied by eight plates in colour. Byzantine art is of fundamental importance for understanding the story of European (and particularly Slavonic) art and culture and the Christian influences underlying them. This book furnishes an outline which is both readable as a narrative and handy for reference. Professor Talbot Rice covers the period from the foundation of Constantinople in A.D. 330 to the conquest of eastern Europe by the Turks in the fifteenth century. His chapters embrace the full range of Byzantine art, from Justinian's magnificent cathedral of Sancta Sophia to all the mosaics, wall paintings, illuminated manuscripts, sculptures, metalwork, enamels, and ceramics in which the Christian tradition of the east successfully fused the classical and oriental styles","torrent":{"xt":"urn:btih:af4c7a7075b1650296d10b97dd1c7216013b8f59","amp;dn":"Byzantine+Art+by+David+Talbot+Rice+%28Penguin+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af4c7a7075b1650296d10b97dd1c7216013b8f59","infoHashBuffer":{"type":"Buffer","data":[175,76,122,112,117,177,101,2,150,209,11,151,221,28,114,22,1,59,143,89]},"announce":[],"urlList":[]}}