{"title":"Battlefields Vol. 1-6 (2009-2011) [Dynamite]","uid":7816509,"size":377359062,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b02b133dc1222d1c5f0ef601771fad6d55573228&amp;dn=Battlefields+Vol.+1-6+%282009-2011%29+%5BDynamite%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackcanary","files":-1,"time":1352674822,"description":"English | CBZ | 6 Issues\n\nBattlefields Vol. 1-6\nPublisher:  Dynamite Entertainment\nPublication Date: February 2009 - January 2011\n\nWritten by Garth Ennis\n\nBattlefields Vol. 1 - The Night Witches (2009)\nBattlefields is the next series of Garth Ennis' war books. Late summer, 1942. As the German army smashes deep into Soviet Russia and the defenders of the Motherland retreat in disarray, a new bomber squadron arrives at a Russian forward airbase. Its crews will fly flimsy wooden biplanes on lethal night missions over German lines, risking fiery death as they fling themselves against the invader- but for these pilots, the consequences of capture will be even worse. For the pilots of the 599th Night Bomber Regiment are women. In the deadly skies of the Eastern front, they will become a legend- known, to friend and foe alike, as the Night Witches.\n\nBattlefields Vol. 2 - Dear Billy (2009)\nMore incredible stories from Garth Ennis as his &quot;BATTLEFIELDS&quot; series continues exclusively from DYNAMITE ENTERTAINMENT! For this second mini-series - DEAR BILLY - Garth is joined by artist Peter Snejbjerg and cover artist John Cassaday for a haunting tale of wartime in 1942. 1942: In the tropical splendour of the South China sea, as the Second World War spreads across the far east, a young woman finds herself in paradise... and then in hell. Nurse Carrie Sutton is caught up in the Japanese invasion of Singapore, suffering horrors beyond her wildest nightmares- and survives. Now she attempts to start her life anew, buoyed up by a growing friendship with a wounded pilot- only for fate to deliver up the last thing she ever expected. Carrie at last has a chance for revenge... but should she take it? In the midst of a world torn apart by war, you can fight and you can win- but you still might not get the things you truly want. Featuring the entire three issue series!","torrent":{"xt":"urn:btih:b02b133dc1222d1c5f0ef601771fad6d55573228","amp;dn":"Battlefields+Vol.+1-6+%282009-2011%29+%5BDynamite%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b02b133dc1222d1c5f0ef601771fad6d55573228","infoHashBuffer":{"type":"Buffer","data":[176,43,19,61,193,34,45,28,95,14,246,1,119,31,173,109,85,87,50,40]},"announce":[],"urlList":[]}}