{"title":"Hidden Secrets - Part 39 - Wars in the Heavens","uid":12218691,"size":10944181350,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b0b287dbc0869a4c5849793a4858b7a5b1cb48af&amp;dn=Hidden+Secrets+-+Part+39+-+Wars+in+the+Heavens&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":70,"time":1439306987,"description":" Aliens are from Hell:\nA great Documentary by Michale,Hur, (shieldoftheson) With facinating footage, and pictures of things of the past, as well as the present, Have we been told the Truth about UFO's and Aleins? Is the government covering something up? If so why? Do they know something they aren't telling us. Or is it the eliet, or possibly a combination of both? You decide.\n\nThis documentary is full of photos, recordings, interviews, etc.  Watch to see what the government is hiding from you and learn about the moon bases, alien shapeshifters, and much more... including real NASA footage of fallen angels in space &amp; a look into ancient structures on the moon.\n--------------------------------------------------------------------------------------------------------\n\nUFO Photos - Parts 1 &amp; 2:\nInsider knowledge on ufos, aliens, bases on other planets &amp; other anomalies.  Learn about real UFO, Alien and Moon/Mars Base Photos and the astronauts' encounters with these structures, creatures and anomalies.  Real-life Christian Ghost Hunter, Michael Hur, discusses the analysis of these events with in-depth insider commentary.\n--------------------------------------------------------------------------------------------------------\n\nExposing The Illuminati Egyptian Occult Magick:\nNov 21, 2014 - &quot;Prophecy in the news&quot; exposes the Illuminati Egyptian Magick in Hollywood, government and other organizations along with its biblical roots.  Many may know of the satanic &quot;all-seeing eye&quot;, the golden calf or apis  bull, and other symbolism, but where did they originate and what god do they represent?  This short video provides good insight of the spiritual battle (as satan esteems himself to &quot;be like the most high&quot;) that the modern world now faces.\n---------------------------------------------------------------------------------------------------------\n\nDemon Magicians Episode 7 - Conclusion and Outtakes:\nThis video series discloses the demon magic used by the most famous magicians.  Learn from various magician acts and occult writings that expose these magician acts that amaze the populace.\n---------------------------------------------------------------------------------------------------------\n\nDemons Are Real:\nIn this documentary Michael Hur, Chirstian theologian &amp; ghost hunter will discuss how to avoid being hunted from an evil spirit.  He exposes some major dont's to avoid when others experience such demonic activity.  Included is actual shocking footage of Sirens, Fairies, Darkshadow Demons, and truelife Nephilim birthing pods under major U.S. cities happening today, right now!!\n\nFor anyone who experiences demonic activity, you are probably not a Christian.  However in the outside chance you are, remember being aprat of Christ, these demons have no hold on you nor the ability to harm you.  If they are somehow summoned by some witch onto your premises, pray to our Lord and savior Jesus Christ for help.\n\nBack in the times of Adam, God gave domain of this world to Adam and his offspring of Adam.  Call aloud upon Jesus Christ, our Lord and Savior, and pray to him to uphold his promises for his flock and provide immediate assistance by sending his Holy Angels to help rid these evil creatures/Demons from your presence.  Remind him of his promises given in the Bible and to Adam and this being your domain and that these demons are not wanted here.  Request his help immediately for protection and revokation of these entities.  Ask for the Holy Angels to smite the demon and send him back into the Pit.  Although you may or may not visually see the Holy Angels, they will come for the glory of Jesus and fulfill God's promise.  God Bless!\n----------------------------------------------------------------------------------------------------------\n\nBabylon The Great and Globalism (New World Order):\nThis documentary exposes the threat to liberty of all freedom made when an apostate power supplants the word of God for the traditions of men. The Messiah spoke out against the false leaders of his day and we as his followers must do the same","torrent":{"xt":"urn:btih:b0b287dbc0869a4c5849793a4858b7a5b1cb48af","amp;dn":"Hidden+Secrets+-+Part+39+-+Wars+in+the+Heavens","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0b287dbc0869a4c5849793a4858b7a5b1cb48af","infoHashBuffer":{"type":"Buffer","data":[176,178,135,219,192,134,154,76,88,73,121,58,72,88,183,165,177,203,72,175]},"announce":[],"urlList":[]}}