{"title":"Donnachadh McCarthy 'Saving The Planet Without Costing The Ea","uid":4621376,"size":39499236,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0be476739c024fb54160c95d440daab06dbd2f4&amp;dn=Donnachadh+McCarthy+%5C%27Saving+The+Planet+Without+Costing+The+Ea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kavokei","files":1,"time":1231045592,"description":"&quot;Donnachadh McCarthy - Saving The Planet Without Costing The Earth\n\nNo.1 Environmental Bestseller\nAmazon April 2006\n\nFeatured as an Easy Self-Eco-Audit in the BBC series &quot;It's not easy being green&quot; with Dick Strawbridge, spring 2006.\n\nSynopsis\nIn &quot;Saving the Planet Without Costing the Earth - 500 simple steps to a greener lifestyle&quot; author Donnachadh McCarthy lays out the case for urgent environmental action in a whole range of areas from home maintenance to your workplace and from reducing waste to tackling energy use.\n\nHe relates his own experiences in making his lifestyle more planet-friendly in each area, which helps bring the global arguments down to an accessible human level.\n\nAt the end of each chapter he lists simple practical steps that you can take in your own life. He also provides a really easy do-it-yourself environmental audit to help you get started and to monitor your success in implementing a greener lifetstyle.\n\nHe concludes the book with a fascinating description of how he moved from being a classical ballet dancer to being a passionate environmentalist through an unplanned trip into the heart of the Amazon Forest, where he spent time with the Yanomami Indians.\n\nOver 70% of the over 500 suggestions will either cost you nothing or will actually save you money. As Donnachadh says: &quot;Saving the planet does not have to cost the earth&quot;.\n\nDonnachadh has set a clear example in his own life with his own home in Peckham being the first private house in London to sell solar electricity to the national grid. His home is also the first home in London to receive planning permission to install a grid connected domestic windmill and over 75% of his water needs are supplied by a rain harvester on his roof.&quot;\n\n","torrent":{"xt":"urn:btih:b0be476739c024fb54160c95d440daab06dbd2f4","amp;dn":"Donnachadh+McCarthy+%5C%27Saving+The+Planet+Without+Costing+The+Ea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0be476739c024fb54160c95d440daab06dbd2f4","infoHashBuffer":{"type":"Buffer","data":[176,190,71,103,57,192,36,251,84,22,12,149,212,64,218,171,6,219,210,244]},"announce":[],"urlList":[]}}