{"title":"The Doors-Live At The Matrix '67(2008)[EAC-FLAC][TWR127]","uid":4862527,"size":723242693,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b13b0c86a0ced2cea6254cb76b1fd59d16fc1310&amp;dn=The+Doors-Live+At+The+Matrix+%5C%2767%282008%29%5BEAC-FLAC%5D%5BTWR127%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thewall68","files":45,"time":1240328191,"description":"Releaser: thewall\n\nExtractor: EAC 0.99 prebeta 4  \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD \nArtwork:  Full Scans 300dp \n\n\n\n\nProduct Description\n\n\nRhino and Bright Midnight Archives present Live At The Matrix 1967, the latest instalment in The Doors' acclaimed series of archival concert releases. This two-disc addition to the band's live canon contains two club shows witnessed by few but bootlegged by many. Restored and carefully mastered from first-generation tapes acquired by Elektra Records and The Doors 40 years ago, these historic shows never sounded better. The collection, featuring cover art by legendary San Francisco artist Stanley Mouse.\n\nWhere the previous three Bright Midnight Archives releases documented The Doors' final tour in 1970, Live At The Matrix 1967 rewinds to the band's early days for a pair of shows at a San Francisco club in March 1967. Only a handful of people showed up, so Jim Morrison, John Densmore, Robby Krieger, and Ray Manzarek played for each other, exploring song arrangements and jamming on a few blues favourites. Ironically, only a few weeks after the Matrix shows, the band's second single, Light My Fire, would make them famous, selling a million copies on its way to topping the chart during The Summer of Love. &quot;It was early 1967 and The Doors were about to enter the consciousness of the nation. And this is the way it sounded,&quot; Manzarek writes in the album's liner notes. \n\nIn spite of the empty room, the band is fully engaged, using the time to give The End and Back Door Man extra lyrics and extended sections. &quot;This is probably the closest we've come to a true document of The Doors without constraints,&quot; says Bruce Botnick, the album's producer and the band's long-time co-producer and engineer.\n\nThe band performs much of its self-titled debut on the first disc, including Soul Kitchen, Alabama Song (Whisky Bar), and the first single, Break On Through (To The Other Side). Along with those early originals, the band indulges its love of the blues with Bo Diddley's Who Do You Love, Muddy Waters' I'm A King Bee, and Allen Toussaint's Get Out Of My Life, Woman, which has never appeared on any previous Doors albums. The second disc offers a glimpse of the band mapping out its future, working out early versions of several songs from upcoming albums: Crawling King Snake (LA Woman); Summer's Almost Gone (Waiting For The Sun); and nearly half of the songs from The Doors' second album, Strange Days.\n\n\nOk ok my friends, the quality on this cd isn't stellar, but its still the doors! \n\n\n\nTrack Listing\n\nDisc One\n\n1. &quot;Break On Through (To The Other Side)&quot;\n2. &quot;Soul Kitchen&quot;\n3. &quot;Money&quot;\n4. &quot;The Crystal Ship&quot;\n5. &quot;Twentieth Century Fox&quot;\n6. &quot;I'm A King Bee&quot;\n7. &quot;Alabama Song (Whisky Bar)&quot;\n8. &quot;Summer's Almost Gone&quot;\n9. &quot;Light My Fire&quot;\n10. &quot;Get Out Of My Life Woman&quot;\n11. &quot;Back Door Man&quot;\n12. &quot;Who Do You Love&quot;\n13. &quot;The End&quot;\n\nDisc Two\n\n1. &quot;Unhappy Girl&quot;\n2. &quot;Moonlight Drive&quot;\n3. &quot;Woman Is A Devil/Rock Me&quot;\n4. &quot;People Are Strange&quot;\n5. &quot;Close To You&quot;\n6. &quot;My Eyes Have Seen You&quot;\n7. &quot;Crawling King Snake&quot;\n8. &quot;I Can't See Your Face In My Mind&quot;\n9. &quot;Summertime&quot;\n10. &quot;When The Music's Over&quot;\n11. &quot;Gloria&quot; \n\t\t\n\n\t\t","torrent":{"xt":"urn:btih:b13b0c86a0ced2cea6254cb76b1fd59d16fc1310","amp;dn":"The+Doors-Live+At+The+Matrix+%5C%2767%282008%29%5BEAC-FLAC%5D%5BTWR127%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b13b0c86a0ced2cea6254cb76b1fd59d16fc1310","infoHashBuffer":{"type":"Buffer","data":[177,59,12,134,160,206,210,206,166,37,76,183,107,31,213,157,22,252,19,16]},"announce":[],"urlList":[]}}