{"title":"BBC Proms 2016, Prom 32 - Esa-Pekka Salonen conducts Schoenberg,","uid":15690052,"size":225931124,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b144e26295aca9222dda137f92cc343f2fbf3fb0&amp;dn=BBC+Proms+2016%2C+Prom+32+-+Esa-Pekka+Salonen+conducts+Schoenberg%2C&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RoaElson","files":6,"time":1472394002,"description":"BBC Proms 2016, Prom 32 - Esa-Pekka Salonen conducts Schoenberg, Dutilleux and Mahler\r\n\r\nThe Philharmonia and Esa-Pekka Salonen play Schoenberg, Dutilleux and Mahler.\r\n\r\nSchoenberg: A Survivor from Warsaw \r\nDutilleux: The Shadows of Time\r\nMahler Symphony No 1 in D major\r\n\r\nDavid Wilson-Johnson (narrator)\r\nPhilharmonia Voices (men's voices) \r\nPhilharmonia Orchestra \r\nEsa-Pekka Salonen, conductor\r\n\r\nMahler's First Symphony isn't just the opening chapter of the composer's spiritual autobiography, it's also an awakening in itself. From hushed strings and woodwind cuckoos, it breaks into a forthright stride towards, eventually, a blazing affirmation of camaraderie and confidence.\r\n\r\nEsa-Pekka Salonen conducts the symphony here with his own Philharmonia Orchestra, following meditations on loss from Arnold Schoenberg and centenary composer Henri Dutilleux, whose The Shadows of Time was inspired by the diaries of Anne Frank and written to mark 50 years since the end of the Second World War.\r\n\r\nPROMS EXTRA: After Auschwitz\r\nIn front of a small audience Eva Schloss, step-sister of Anne Frank, discusses her memoir 'After Auschwitz' in which she relates the trauma of fleeing her comfortable home in Vienna to escape Nazi persecution, to the relative safety of Amsterdam where she meets amongst many others a young, vivacious Anne Frank. Amsterdam stays safe only until the Nazis invade at which point her family are forced to go into into hiding. Betrayed by Nazi double agents working for the Resistance, Eva and her family are sent in cattle trucks to Auschwitz-Birkenau where her mother and she are separated from her beloved father and brother. After a gruelling eight months barely surviving the horrors of the concentration camp and where both mother and daughter only narrowly escape being sent to the gas chambers Eva and her mother are two of the lucky few to still be alive when the Russians come to liberate the camp in January 1944.\r\n\r\nA long, eventful journey home brings them eventually back to Amsterdam where they hope beyond hope to be reunited with the rest of their family. But Eva and her mother must confront the tragic truth that her father and brother are dead just as Anne Frank's father Otto must bear the loss of his whole family. Eva's mother and Otto eventually marry and dedicate their lives to the memory of Anne Frank and all the countless other children who perished during the Holocaust. Eva Schloss carries this work on tirelessly today.\r\n\r\nAfter reading several extracts from her memoir, After Auschwitz, Eva responds to audience members questions about what they have heard.\r\n\r\n\r\n\r\nMedia info:\r\n\r\nGeneral\r\nFormat : MPEG Audio\r\nOverall bit rate mode : Constant\r\nOverall bit rate : 320 Kbps\r\n\r\nAudio\r\nFormat : MPEG Audio\r\nFormat version : Version 1\r\nFormat profile : Layer 3\r\nMode : Joint stereo\r\nBit rate mode : Constant\r\nBit rate : 320 Kbps\r\nChannel(s) : 2 channels\r\nSampling rate : 48.0 KHz\r\nCompression mode : Lossy\r\nWriting library : LAME3.98r\r\nEncoding settings : -m j -V 4 -q 3 -lowpass 20.5","torrent":{"xt":"urn:btih:b144e26295aca9222dda137f92cc343f2fbf3fb0","amp;dn":"BBC+Proms+2016%2C+Prom+32+-+Esa-Pekka+Salonen+conducts+Schoenberg%2C","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b144e26295aca9222dda137f92cc343f2fbf3fb0","infoHashBuffer":{"type":"Buffer","data":[177,68,226,98,149,172,169,34,45,218,19,127,146,204,52,63,47,191,63,176]},"announce":[],"urlList":[]}}