{"title":"Bathsheba [The Wives of King David, #03] - Jill Eileen Smith","uid":14414395,"size":874523,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b15cad182355059f9bce6aa71260de017be3ae13&amp;dn=Bathsheba+%5BThe+Wives+of+King+David%2C+%2303%5D+-+Jill+Eileen+Smith&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1461478888,"description":"Bathsheba is a woman who longs for love. With her husband away fighting the king's wars, she battles encroaching loneliness--which makes it all too easy to succumb to the advances of King David. Will one night of unbridled passion destroy everything she holds dear? Can she find forgiveness at the feet of the Almighty? Or has her sin separated her from God forever?\r\n\r\nWith a historian's sharp eye for detail and a novelist's creative spirit, Jill Eileen Smith brings to life the passionate and emotional story of David's most famous--and infamous--wife. You will never read the story of David and Bathsheba the same way again.\r\n\r\n&quot;Thoroughly engrossing. Jill Eileen Smith receives my highest recommendation as an author of biblical fiction.&quot;--Kim Vogel Sawyer, award-winning author of My Heart Remembers\r\n\r\n&quot;Bathsheba is Jill Eileen Smith's finest work to date. It vividly portrays the devastation caused by selfish passion and betrayal, and the incredible blessing of repentance and restoration through God's grace.&quot;--Jill Stengl, award-winning author of Wisconsin Brides\r\n\r\n&quot;This well-researched and beautifully crafted story will resonate in your heart and mind long after you've read the final page. An excellent read with a message that transcends time.&quot;--Judith Miller, author of the Daughters of Amana series","torrent":{"xt":"urn:btih:b15cad182355059f9bce6aa71260de017be3ae13","amp;dn":"Bathsheba+%5BThe+Wives+of+King+David%2C+%2303%5D+-+Jill+Eileen+Smith","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b15cad182355059f9bce6aa71260de017be3ae13","infoHashBuffer":{"type":"Buffer","data":[177,92,173,24,35,85,5,159,155,206,106,167,18,96,222,1,123,227,174,19]},"announce":[],"urlList":[]}}