{"title":"Salt - Auscultate [1996][EAC,log,cue.FLAC]","uid":9194048,"size":293543708,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b351e6ad9fd18a05ec84ce79b28759b4fa41646c&amp;dn=Salt+-+Auscultate+%5B1996%5D%5BEAC%2Clog%2Ccue.FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1384449113,"description":"Artist: Salt\nRelease: Auscultate\nReleased:  1996\nLabel:  Island\nCatalog#: PRCD 7167-2\nFormat: FLAC / Lossless / Log(100%) / Cue\nCountry: SW\nStyle: rock\n\n\n\n\n01 - Impro\n02 - Honour Me\n03 - Beauty\n04 - God Damn Carneval\n05 - Obsession\n06 - Bluster\n07 - Lids\n08 - So\n09 - Witty\n10 - So I Ached\n11 - Flutter\n12 - Sense\n13 - Undressed\n\n\n\nNot to be confused with salt of the Veruca variety.  Let me tell you, this Swedish trio is a bitch to search for online.  Chances are, you haven't heard of Salt.  They had a minor hit in 1996 (a hard-driving number called &quot;Bluster&quot;wink.gif, but aside from that solitary glint of success, they were virtual unknowns in America.  And it's easy to see why.  &quot;Bluster&quot; appeared on Auscultate, their major label debut.  1996 was an unfortunate year to be admitted to rock radio, especially when you consider that Salt specialized in streamlined post-grunge.  If they had emerged two years prior, they might have found a far-reaching fanbase.  Take Veruca Salt, for instance.  I'm not suggesting that they were overweening trendhoppers (personally, I adore VS), but they came around at just the right time.\n\nSalt was consigned to obscurity from the get-go.  After releasing a kickass collocation of b-sides and rarities in 1997, they quietly disbanded.  Today, frontwoman Nina Ramsby is a bald pop songstress/activist in her country of origin.  I'm pretty sure that she's a lesbian.  Of course, it's completely irrelevant, but I've noticed that there were quite a few 90's bands spearheaded by bulldyke nightingales (Salt, Skunk Anansie, Smashing Pumpkins, et al.).  I'm grateful that I stumbled upon &quot;Bluster&quot; during a late-nightadventure.  It's a shame that this record didn't catch on with...well, anyone.  It's fucking solid.  As with the bulk of &quot;meat and potatoes&quot; rock outfits from this glorious decade, it obliterates modern day fluff.\n\nSo what exactly does Salt sound like?  To my ears, they come off as a cross between the heavier end of Juliana Hatfield's sonic spectrum and Melissa Auf der Maur's solo material.  Barebones, yet well-executed.  Ramsby milks acres of mileage out of simple chord progressions and mid-range vocal melodies.  The trick?  Songcraft.  Y'know, the thing that most bands ignore entirely.  A discerning apperception of music theory is practically worthless without songwriting chops.  I don't know about you, but I like being able to remember a tune.  Fret not, headbangers!  Salt does not forsake rasping, sabulous guitars for sweet accessibility.  I believe that &quot;tubular&quot; is the word I'm looking for.\n\nOkay, standout tracks.  &quot;Honour Me&quot; sums up Auscultate in four minutes flat.  It showcases Ramsby's mellifluous voice, dazzling harmonies and a crunchy rhythm section.  &quot;Goddamn Carnival&quot; will stay in your head for days.  &quot;Lids&quot; is a soothing ballad that builds to a circumrotary crescendo.  &quot;Undressed,&quot; the kinetic album closer, is currently my favorite track.  It's hard to explain, so you really need to hear it yourself.  The promotional clip for &quot;Bluster&quot; is easy to find, and it rocks.  Again, you need to hear it yourself.  Do you enjoy straightforward hard rock with a 90's bent?  Fucking check out Salt.  For your information, the 1997 b-side compilation is entitled Delay Me Down and Make Me Wah Wah, give or take an exclamation point..","torrent":{"xt":"urn:btih:b351e6ad9fd18a05ec84ce79b28759b4fa41646c","amp;dn":"Salt+-+Auscultate+%5B1996%5D%5BEAC%2Clog%2Ccue.FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b351e6ad9fd18a05ec84ce79b28759b4fa41646c","infoHashBuffer":{"type":"Buffer","data":[179,81,230,173,159,209,138,5,236,132,206,121,178,135,89,180,250,65,100,108]},"announce":[],"urlList":[]}}