{"title":"Canyon.Passage.1946.1080p.BluRay.x264.AC3-SARTRE","uid":12481347,"size":2561073570,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:b38bd4950c49a1dbbbc5a0020554cb253edb887d&amp;dn=Canyon.Passage.1946.1080p.BluRay.x264.AC3-SARTRE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sartre7","files":7,"time":1443051297,"description":"Dana Andrews -- in one of the best performances of his career -- plays Logan Stuart, a bold, ambitious general store and freight company owner based in the mining settlement of Jacksonville, OR, in 1856. He and his best friend, local banker and express company owner George Camrose (Brian Donlevy), share an attraction for young, beautiful Lucy Overmire (Susan Hayward). \r\n\r\nHowever, that's all the two men share -- Stuart sees life in the Oregon territory as a challenge, to be worked out and overcome with thought and time, with the opportunity to build something lasting and significant in the process. Camrose only sees the opportunity to get rich fast and live easy, and he's addicted to gambling at the local saloon. What no one knows is that he's been doing his gambling with the gold dust that the miners have left on deposit in his vault -- and he's been losing. He wants to get out of the territory, to someplace like San Francisco, and plans to take Lucy away. Stuart, by contrast, is as much a frontiersman as a businessman, and so much a part of the community and so trusted and liked that he might even be a potential political leader, if he ever had the time and the willingness to settle down and stay put. \r\n\r\nHe finds consolation over his loss of Lucy in an engagement to Caroline Marsh (Patricia Roc), a daughter of an Englishman who came to Oregon only to see her father killed by Indians, who lives with the homesteading family of Ben Dance (Andy Devine) and his wife (Dorothy Peterson) and their children. Out of friendship, and also a little guilt over the fact that he would love to be engaged to Lucy, Stuart gives Camrose the money to get even, but Camrose can't resist one last card game, and not only loses what Stuart gave him, but the gold dust of one miner -- who shows up unexpectedly in town that night, planning on getting his dust the next day. \r\n\r\nWhen the man turns up drowned, Camrose is accused of murder; Stuart stands by his friend, but he's found guilty and the miners, led by hot-headed young Johnny Steele (Lloyd Bridges), plan on hanging him, and shooting anyone who tries to get in the way. But before his fate can be settled, an Indian war starts over the killing of a young Native American woman, and the lives of every white settler in and around Jacksonville are suddenly endangered. There's all of that, plus four songs (including &quot;Old Buttermilk Sky&quot;) from Hoagy Carmichael (who does a great acting job), all convincingly woven into the drama along with one of the music legend's best acting performances.\r\n\r\n\r\n\r\nSTARS.........: Dana Andrews, Brian Donlevy, Susan Hayward\r\nDIRECTOR......: Jacques Tourneur\r\nWRITERS.......: Ernest Haycox (story), Ernest Pascal (screenplay)\r\nGENRE.........: Action | Western | Romance\r\nRATING........: 7.0/10  1145 votes\r\nIMDB LINK.....: http://www.imdb.com/title/tt0038395\r\nRUNTIME.......: 1h 31mn\r\nSIZE..........: 2.38 GiB\r\nVIDEO CODEC...: x264 (  )\r\nRESOLUTION....: 1488x1080\r\nBITRATE.......: 3500 Kbps (2-Pass)\r\nFRAMERATE.....: 23.976 fps\r\nAUDIO.........: English AC3 2.0 Mono 224kbps\r\nSOURCE........: 1080p\r\nSUBTITLES.....: English\r\nCHAPTERS......: Yes\r\nENCODED BY....: Sartre\r\nENCODE DATE...: 2015-09-21\r\n\r\n\r\n\r\n \nhttp://imagizer.imageshack.com/img673/2693/HtRCqQ.jpg \nhttp://imagizer.imageshack.com/img673/2562/AtlAwF.jpg","torrent":{"xt":"urn:btih:b38bd4950c49a1dbbbc5a0020554cb253edb887d","amp;dn":"Canyon.Passage.1946.1080p.BluRay.x264.AC3-SARTRE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b38bd4950c49a1dbbbc5a0020554cb253edb887d","infoHashBuffer":{"type":"Buffer","data":[179,139,212,149,12,73,161,219,187,197,160,2,5,84,203,37,62,219,136,125]},"announce":[],"urlList":[]}}