{"title":"Harlem Is Nowhere by Sharifa Rhodes-Pitts","uid":9653314,"size":1741321,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4b8be24f884bcac321b4645c30617961468464f&amp;dn=Harlem+Is+Nowhere+by+Sharifa+Rhodes-Pitts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":3,"time":1393130899,"description":"\nHarlem is Nowhere: A Journey to the Mecca of Black America by Sharifa Rhodes-Pitts\n\n&quot;No geographic or racial qualification guarantees a writer her subject....Only interest, knowledge, and love will do that--all of which this book displays in abundance.&quot; (Zadie Smith, Harper's)\nA finalist for the 2011 National Book Critics Circle Award in Autobiography, and a New York Times Notable Book of the Year.\n\nFor a century Harlem has been celebrated as the capital of black America, a thriving center of cultural achievement and political action. At a crucial moment in Harlem's history, as gentrification encroaches, Sharifa Rhodes-Pitts untangles the myth and meaning of Harlem's legacy. Examining the epic Harlem of official history and the personal Harlem that begins at her front door, Rhodes-Pitts introduces us to a wide variety of characters, past and present. \n\nAt the heart of their stories, and her own, is the hope carried over many generations, hope that Harlem would be the ground from which blacks fully entered America's democracy.\nRhodes-Pitts is a brilliant new voice who, like other significant chroniclers of places-Joan Didion on California, or Jamaica Kincaid on Antigua-captures the very essence of her subject.\n\nGenre: Non Fiction | Memoir | History","torrent":{"xt":"urn:btih:b4b8be24f884bcac321b4645c30617961468464f","amp;dn":"Harlem+Is+Nowhere+by+Sharifa+Rhodes-Pitts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4b8be24f884bcac321b4645c30617961468464f","infoHashBuffer":{"type":"Buffer","data":[180,184,190,36,248,132,188,172,50,27,70,69,195,6,23,150,20,104,70,79]},"announce":[],"urlList":[]}}