{"title":"Coast to Coast AM - 10 - 26 - 10 - Economy &amp; Stock Trading","uid":5960256,"size":55379011,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b53377bcb2d24283518ac3b98c0cde8e66edbb5c&amp;dn=Coast+to+Coast+AM+-+10+-+26+-+10+-+Economy+%26+Stock+Trading&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xAlkaline13x","files":4,"time":1289928220,"description":"Economy &amp; Stock Trading\n \nDate: 10-26-10\nHost: George Noory\nGuests: Catherine Austin Fitts, Chris Kacher, Joshua P. Warren\n\nIn the first half of the show, economist Catherine Austin Fitts joined George in the LA studio to discuss our critical juncture in the economy. This retail season she sees shoppers being more cautious, buying utilitarian rather than luxury items. Companies and enterprises that figure out how to do more with less will have growth opportunities, she said, adding that people need to connect their passion with their work, in this post-bubble economy.\n\nAs portrayed in the new documentary, Inside Job, there have been numerous types of fraud perpetrated by the financial industry-- including foreclosure, origination, servicing &amp; securitization frauds. &quot;Now it's coming out that people were taking the same loan and putting it in ten different security pools, without documentation,&quot; she revealed. Fitts also talked about how financial wars take place between America and other countries, with covert ops used to manipulate prices of various commodities.\n\nThird hour guest, stock trader Chris Kacher shared some of his trading techniques, which he based on William O'Neil's methodology of looking at a company's fundamentals as well as the &quot;technicals&quot; (chart patterns of a company's stock). Through this, Kacher created a &quot;market timing algorithm,&quot; which allowed him to prosper, and then get out of the market during low ebbs. He suggested that current stock prices could rise much higher, and because the US dollar has been devaluated, it is wise to invest in commodities.\n\nHeadless Horsemen\nLast hour guest, paranormal investigator Joshua P. Warren talked about the lore of headless horsemen, and various ghost cases (see article below) that involved horses. Such a horseman was described by author W. Harrison Ainsworth in 1843: &quot;when you've seen Hearne the hunter, he is a wild spectral object, possessing a slight resemblance to a human being, clad in the skin of a deer...surrounded by a blue phosphoric light.&quot; Warren also announced that he is opening a new museum in Asheville at the site of an old jail/gallows.","torrent":{"xt":"urn:btih:b53377bcb2d24283518ac3b98c0cde8e66edbb5c","amp;dn":"Coast+to+Coast+AM+-+10+-+26+-+10+-+Economy+%26+Stock+Trading","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b53377bcb2d24283518ac3b98c0cde8e66edbb5c","infoHashBuffer":{"type":"Buffer","data":[181,51,119,188,178,210,66,131,81,138,195,185,140,12,222,142,102,237,187,92]},"announce":[],"urlList":[]}}