{"title":"Salad - Drink Me [1995]","uid":9414976,"size":347965627,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b568d466b113bcb102cc7b5383aca01729c5336d&amp;dn=Salad+-+Drink+Me+%5B1995%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1388417689,"description":"Clearly more interesting, more varied, more wild, less formulaic, and just plain wagon-loads better than the OK Echobelly and Sleeper, and far more original and less nostalgic than Elastica, Salad get a little notice but far less than their six singles and album suggest they are due. Best of all and most importantly, while all those other bands lose something with repeated playings, Salad's impact just grows stronger and stronger. Perhaps their first three singles -- compiled in 1994 on the LP Singles Bar -- are a little on the crude side, but since the release of &quot;Your Ma&quot; this Brighton quartet have really come on. Theirs is a mildly dark and twisted take on post-punk guitar rock; the occasional noise elements never interfere with their strong songs, but always add an unpredictable and screwy air that draws the ear. Even better, they are blatantly unafraid to plumb the quieter tones and inject large dollops of warmth and prettiness to the soul-searching words singer Marijne writes. The best example of this, &quot;Motorbike to Heaven,&quot; is one the singles of 1995, perfectly recorded by the talented Mark Freegard, mixing his usual post-shoegaze glimmer shimmer with the group's freewheeling guitars and Marijne's arousing reaction to a parting. Sweet, strong, and only slightly sorrowful, this bubbling brook is so nice and yet really hits. Likewise, the bubbling cauldron of &quot;Drink the Elixir,&quot; which might be a less nutso Pixies if they were more in control all the time, is powerfully catchy, and their untamed singer sounds hot and smooth at the same time. The rest of the LP seesaws between a gaggle of styles approximated by the four singles, with equally pleasing results. Anyway you look at it, this is an inspired, special group, one that will still be worth playing when writers have long forgotten any of these other more-hyped groups ever existed. (4/5)","torrent":{"xt":"urn:btih:b568d466b113bcb102cc7b5383aca01729c5336d","amp;dn":"Salad+-+Drink+Me+%5B1995%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b568d466b113bcb102cc7b5383aca01729c5336d","infoHashBuffer":{"type":"Buffer","data":[181,104,212,102,177,19,188,177,2,204,123,83,131,172,160,23,41,197,51,109]},"announce":[],"urlList":[]}}