{"title":"Killer Surf : The Best Of The Challengers  (60's Instrumental","uid":4852290,"size":94548943,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b5fd02812bbec5bae7a090f1f18c4f3c6b7f350e&amp;dn=Killer+Surf+%3A+The+Best+Of+The+Challengers++%2860%5C%27s+Instrumental&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":36,"time":1239917967,"description":"Killer Surf : The Best Of The Challengers  (60's Instrumental Surf Rock) \nCD (1994) To Mp3 VBR 148-184 mbit/s\nIncluded: CD Front Cover and this Info\n\nReview  by Cub Koda  allmusic.com\nClocking in at 30 tracks, this is a top-heavy collection of surf sides the Challengers cut for the GNP/Crescendo label. As the group never really had a hit, this is arguably all the Challengers you might ever need for the collection. But it is grade-A surf music, extremely well played with various session ringers like Hal Blaine, Jim Keltner, Steve Douglas, and Paul Johnson brought in on various numbers. \n\nThe Challengers:\nThe Challengers were an instrumental surf rock band in the 1960s, located in Los Angeles. They started early in the game and helped make the genre popular. Their debut album Surfbeat is the biggest selling surf album of all time and almost single-handedly brought surf from California to the rest of the world.\n\nThe band was formed out of the ashes of The Belairs. The Belairs were just high schoolers at the time, but had a hit with &quot;Mr. Moto.&quot; Their potential was cited by many, but, ironically, it was an argument about use of the then-new Fender Reverb Unit that led to their breakup. The Belairs were originally formed by two guitarists, Eddie Bertrand and Paul Johnson, both 16 years old at the time they recorded &quot;Mr. Moto&quot;. In early 1963. Eddie Bertrand heard Dick Dale using the Fender Reverb unit, and wanted to start incorporating heavy reverb into the Belairs' songs, since he felt reverb was the sound that would come to define Surf Music. Even at 17, Johnson was something of a &quot;stick-in-the-mud&quot; and told Bertrand that the Belairs had done quite well without reverb, and HE didn't see any reason at all to begin using it. The argument escalated until Bertrand finally left the band, which then broke up for good shortly after. Johnson confirmed this story in the liner notes he contributed to the Belairs reunion album released in 1986.\n\nDuring their peak years, from late 1960 to Summer 1963, the Belairs had TWO drummers who played gigs with the band alternately, original Mouseketeer, Dickie Dodd, and another local school chum, Richard Delvecchio, who adopted the stage name, Richard Delvy, and who like a minor Mike Curb, began a career of managing and producing local bands, ultimately recording numerous Southern California bands in the latter part of the 1960s.\n\nThe year before the Belairs breakup, Delvy left the Belairs to form a new band. From The Belairs, he brought only Jim Roberts (keyboards) with him, and recruited Randy Nauert (bass guitar). For guitar, Glenn Grey was brought in for lead and Don Landis for rhythm, With Nick Hefner on Saxophone, they became The Challengers. They played at high school and local dances and such, and eventually earned enough to rent a jazz studio, World Pacific, to record. Nick Hefner played on only one track. In about three and a half hours, they had an album. Surfbeat was released in January 1963 and quickly went up the charts. Just months earlier, The Beach Boys' released a vocal single, &quot;Surfing Safari&quot; and some months after the Challenger's &quot;Surfbeat&quot; release, Dick Dale's first album was released. The surf culture was becoming a national phenomenon and The Challengers helped put it in full gear. The album contained songs that were early influences on surf rock, including numbers by The Fireballs and Duane Eddy.\n\nThe Challengers moved on and continued to record albums. During the recording of On The Move, Hefner, Grey and Landis all left the band. Hefner was replaced by Phil Pruden, while Art Fisher and Eddie Fournier filled in the guitar spot. In 1964, they released the album K-39. The title track became a big hit and is their best-known song. The group continued their career, recording several albums a year, shocking by today's &quot;one album every two years&quot; pattern. They also had their own TV show, Surf's Up. LA cartoonist Rick Griffin, who later designed posters for groups during the psychedelic period, drew several cartoons for the band featured on the LP sleeves.\n\nIn 1965, as music changed, so did The Challengers. They began recording more pop-oriented music, like an instrumental version &quot;Kicks&quot; by Paul Revere &amp; The Raiders. By 1966, they had gone the way of all other surf bands,and stopped performing live, but still continued recording and releasing albums. A 1970 release of the band was titled, fittingly Where Were You In The Summer Of '62.\n\nThe Challengers were involved with former Bel-Airs guitarist Paul Johnson, who also was involved with PJ &amp; the Galaxies. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Challengers_(band)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Challengers_(band)&lt;/a&gt;\n\nTracklist:\n01. Lanky Bones\n02. Telstar\n03. Duck Waddle\n04. A Taste Of Honey\n05. Kami-Kaze\n06. Pipeline\n07. Scratch\n08. The Work Song\n09. The Wedge\n10. Surf-Ari\n11. Rebel Rouser\n12. Collision Course\n13. Memphis\n14. Camel Back\n15. Penetration\n16. Sidewalk Surfer\n17. Tequila\n18. Small Fry\n19. Raunchy\n20. Cruel Sea\n21. Lonely Bull\n22. Mr. Moto\n23. The Man From Uncle\n24. Out Of Limits\n25. Wipe Out\n26. Roller Derby\n27. Happy Guitars\n28. Walk, Don't Run\n29. Kicks\n30. K-39","torrent":{"xt":"urn:btih:b5fd02812bbec5bae7a090f1f18c4f3c6b7f350e","amp;dn":"Killer+Surf+%3A+The+Best+Of+The+Challengers++%2860%5C%27s+Instrumental","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5fd02812bbec5bae7a090f1f18c4f3c6b7f350e","infoHashBuffer":{"type":"Buffer","data":[181,253,2,129,43,190,197,186,231,160,144,241,241,140,79,60,107,127,53,14]},"announce":[],"urlList":[]}}