{"title":"John Zorn - Alhambra Love Songs (2009)","uid":5890626,"size":265188200,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b67740a6d92544a0b78f06670b77ababac44be74&amp;dn=John+Zorn+-+Alhambra+Love+Songs+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mariorg","files":-1,"time":1287187424,"description":"Tzadik Records: &lt;a href=&quot;\nhttp://www.tzadik.com/index.php?catalog=7374&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tzadik.com/index.php?catalog=7374&lt;/a&gt;\n\nPersonnel\n~~~~~~~~\n* Rob Burger: piano\n* Greg Cohen: bass\n* Ben Perowsky: drums\n\nReview\n~~~~~~ &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?sql=10:h9fwxzq0ldhe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?sql=10:h9fwxzq0ldhe&lt;/a&gt;\nby Thom Jurek\n\nFor a change, the descriptor insert included in a Tzadik release isn't all\nhype. Alhambra Love Songs does indeed contain &quot;some of the most beautiful and\nsoothing music Zorn has ever written.&quot; This 11-cut set is an eclectic homage of\nsorts to the San Francisco Bay area and the musicians who have and continue to\nmake it their home. Written for a piano trio consisting of Rob Burger, bassist\nGreg Cohen (who alternates between upright and electric), and drummer Ben\nPerowsky, what's most important to remember when popping this into the deck is\nthat these are indeed &quot;songs.&quot; They all have direct melodic themes, lyric\nharmony, and follow a linear trajectory from one place to another. Zorn puts\nthat in the listener's ears on the very first cut, &quot;Mountain View,&quot; dedicated to\nVince Guaraldi. It doesn't merely nod to the late pianist and composer of the\nCharlie Brown television themes, it evokes him directly, utilizing his sense of\nlithe, lyric theme and simple rhythmic sensibility in a hummable melody. It's\ndelightful. &quot;Pacifica,&quot; dedicated to mystic Harry Smith, is more elliptical and\nmysterious in presentation, but just as melodic and accessible. And that's the\npoint. The Tzadik insert also namechecks Ramsey Lewis and Henry Mancini as well\nas the words &quot;easy listening mode,&quot; but these influences aren't all that\npronounced. But this doesn't fall into the category of one of Zorn's challenging\nseries of recordings, either. It is simply a set of gorgeous songs with a\nvariety of jazz, television, cinematic, and landscape themes written into their\nmelodies, all dedicated to various musicians, composers, actors, poets, and\nother persona whom Zorn holds in high regard. Some may wonder initially if this\nfits in best with The Gift or Dreamers, and it sounds nothing like either\nrecording. These tunes -- be it the tender &quot;Half Moon Bay&quot; dedicated to poet and\ntranslator Lyn Hejinian, or &quot;Moraga,&quot; scored for Clint Eastwood, which evokes\nboth his cinematic work as an actor and his work as a composer, or the ever so\nbrief and utterly lovely &quot;Miramar,&quot; for Terry Riley, which envelope the listener\nin pulsing rhythmic repetition before whispering itself out on the individual\nnotes of its chords -- all have the same effect: one of complete listening\npleasure. These small tunes will get inside your head and remain there,\nprompting you to listen to this set over and again. Each track is different from\nthe last in theme, mood, and construction, but follows its thematic strategy\nalmost to a fault. The band is fantastic. Burger's percussive touch on the keys\nis a plus. He never hits too hard, but he's a very rhythmic player. Add to this\nthe brushwork of Perowsky and the always inventive, sensitive, and often subtle\nwork of Cohen, and you have a unit that can swing when the tune calls for it,\nlet a piece breathe, or playfully get inside it. Alhambra Love Songs is a gem,\nand will literally bring joy to anyone who gives it an honest listen.\n\n\n01 - Mountain View (for Vince Guaraldi) 5:08\n02 - Novato (for Mike Patton) 3:52\n03 - Pacifica (for Harry Smith) 3:58\n04 - Benicia (for Paul Canales) 3:48\n05 - Half Moon Bay (for Lyn Hejinian) 4:38\n06 - Moraga (for Clint Eastwood) 4:17\n07 - Tamalpais (for Elissa Guest) 4:08\n08 - Larkspur (for Willie Winant) 3:36\n09 - Alhambra Blues (for Mo Siegel) 4:26\n10 - Miramar (for Terry Riley) 1:19\n11 - Tiburon (for David Lynch) 5:19\n\nAll compositions by John Zorn","torrent":{"xt":"urn:btih:b67740a6d92544a0b78f06670b77ababac44be74","amp;dn":"John+Zorn+-+Alhambra+Love+Songs+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b67740a6d92544a0b78f06670b77ababac44be74","infoHashBuffer":{"type":"Buffer","data":[182,119,64,166,217,37,68,160,183,143,6,103,11,119,171,171,172,68,190,116]},"announce":[],"urlList":[]}}