{"title":"Danny Johnson-The Last Road Home","uid":15472446,"size":213941840,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b6b4f6820559cb18de32c4733b89d8a01258e855&amp;dn=Danny+Johnson-The+Last+Road+Home&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twocows","files":63,"time":1470152753,"description":"\n\r\n\r\nFrom Pushcart Prize nominee Danny Johnson comes a powerful, lyrical debut novel that explores race relations, first love, and coming-of-age in North Carolina in the 1950s and '60s. At eight years old, Raeford &quot;Junebug&quot; Hurley has known more than his share of hard lessons. After the sudden death of his parents, he goes to live with his grandparents on a farm surrounded by tobacco fields and lonesome woods. There he meets Fancy Stroud and her twin brother, Lightning, the children of black sharecroppers on a neighboring farm. As years pass, the friendship between Junebug and bright, compassionate Fancy takes on a deeper intensity. Junebug, aware of all the ways in which he and Fancy are more alike than different, habitually bucks against the casual bigotry that surrounds them--dangerous in a community ruled by the Klan. On the brink of adulthood, Junebug is drawn into a moneymaking scheme that goes awry--and leaves him with a dark secret he must keep from those he loves. And as Fancy, tired of saying yes'um and living scared, tries to find her place in the world, Junebug embarks on a journey that will take him through loss and war toward a hard-won understanding. At once tender and unflinching, The Last Road Home delves deep into the gritty, violent realities of the South's turbulent past, yet evokes the universal hunger for belonging","torrent":{"xt":"urn:btih:b6b4f6820559cb18de32c4733b89d8a01258e855","amp;dn":"Danny+Johnson-The+Last+Road+Home","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6b4f6820559cb18de32c4733b89d8a01258e855","infoHashBuffer":{"type":"Buffer","data":[182,180,246,130,5,89,203,24,222,50,196,115,59,137,216,160,18,88,232,85]},"announce":[],"urlList":[]}}