{"title":"Mayo Thompson - Corky's Debt To His Father - 1970 [V0]","uid":9503037,"size":73623910,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b8120e499d4ecae43ea2446739992bb1f5c4c247&amp;dn=Mayo+Thompson+-+Corky%27s+Debt+To+His+Father+-+1970+%5BV0%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1390259862,"description":"This austere song-cycle is a collection of tunes addressing youth, sexuality and human morays in an utterly unique fashion. Barely released in its day (1970), Corky's remains one of the pinnacles of excellence in the career of Mayo and his Red Krayola.\n\n====\n\n&quot;I first heard the sudden unbelievable wave-rolling sound of this strange, acoustic, old time cartoon band singin 'I'm a student of human nature' in '94 in good ol' Memphis, TN. Played to me by a giant man with an exploding pillow of blond curls wearing overalls. Wot the fuck was this? I was 22 and getting a fast-paced indie rock education after dropping out of college mid-semester a few months earlier. Was I wasting my parents money when I called from the Blues City Cafe and told them I had moved across the country? Ah, yes it's true, I surely was. But here on the turntable was a suitable replacement for the out-of-state tuition throw to the breeze - a corduroy-professorial-erotic-swinger vibe pouring off a re-issued LP!? Who is this massively turned on man singing about Shakespeare? The picture of the man on the back said it all. I could not have imagined this existed at all. But wot does it sound like? To me, his record has sonic values of the 60's but sounds distinctively weirder than anything I've heard from that decade. And wot an incredible bit of luck there, on the decade's cusp.&quot; - Mike Donovan","torrent":{"xt":"urn:btih:b8120e499d4ecae43ea2446739992bb1f5c4c247","amp;dn":"Mayo+Thompson+-+Corky%27s+Debt+To+His+Father+-+1970+%5BV0%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8120e499d4ecae43ea2446739992bb1f5c4c247","infoHashBuffer":{"type":"Buffer","data":[184,18,14,73,157,78,202,228,62,162,68,103,57,153,43,177,245,196,194,71]},"announce":[],"urlList":[]}}