{"title":"Coast to Coast AM April 06 2013","uid":8355136,"size":58030847,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b82b42d33bda8ed840aed1bcf0a7728d662d851f&amp;dn=Coast+to+Coast+AM+April+06+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1365470407,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t04-06-13\nHost: \tJohn B. Wells\nGuests: \tWhitley Strieber, Chuck Bergman\n\nJoining John B. Wells, author Whitley Strieber discussed his own contact experience with &quot;the visitors,&quot; the prevalence of these close encounters, and the confirming evidence that has been ignored by the media and scientific communities. &quot;Something is penetrating our lives and we are pretending it doesn't exist, institutionally,&quot; he said, noting that in any given week his website receives 15 to 20 such reports. Even though these encounters are widespread there is very little scientific work being done to understand what is really happening, Strieber lamented. He further suggested that the intelligence community is silent on the topic because they do not want to be held accountable for their failure to protect us.\n\nStrieber detailed the work done by Southwest Research Institute's William Mallow, one of the few scientists willing to research alleged alien implants. In one particular case, Mallow received a baffling object from implant removal specialist Dr. Roger Leir. According to Strieber, the curious item emitted a radio signal and, despite being composed of 99% iron, was inexplicably x-ray invisible when placed in a diffraction machine. He also spoke about a strange piece of material sent to Art Bell that was made of layers of bismuth and magnesium foam, his own apparently mobile implant, and the close encounters people have had at his cabin.\nPsychic Investigations\n\nIn the first hour, retired police officer and psychic medium Chuck Bergman briefly commented on the mysterious death of 9/11 conspiracy author Philip Marshall and last year's tragic shooting at Sandy Hook Elementary. Bergman said his psychic investigations are most effective when he is either at the location of the incident or with a family member of the victim. He also described how he communicates with the dead to solve crimes as well as provided details from his work on a missing person's case that turned out to be a murder.\nWebsite(s):\n\n    unknowncountry.com\n    chuckbergman.com\n\nBook(s):\n\n    Solving the Communion Enigma\n    The Secret of Orenda\n    The Key\n    The Psychic Cop\n    The Everything Guide to Evidence of the Afterlife\n\n","torrent":{"xt":"urn:btih:b82b42d33bda8ed840aed1bcf0a7728d662d851f","amp;dn":"Coast+to+Coast+AM+April+06+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b82b42d33bda8ed840aed1bcf0a7728d662d851f","infoHashBuffer":{"type":"Buffer","data":[184,43,66,211,59,218,142,216,64,174,209,188,240,167,114,141,102,45,133,31]},"announce":[],"urlList":[]}}