{"title":"Damn Nation [Graphic Novel]","uid":8621884,"size":84898556,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b8c163e07caffe045e1289df0f26e4f40d19c70b&amp;dn=Damn+Nation+%5BGraphic+Novel%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RobbieDee","files":-1,"time":1372393376,"description":"- Contains the Damn Nation graphic novel, which collects the original 3 issue miniseries. Published by Dark Horse Comics.\n\nGenre: Vampire/Horror\n\n**I don't own or take credit for any of the content contained within this torrent, all credit goes to the creator(s) of the comic.**\n\n\nDescription:\n\nThe United States' borders and ports are locked down against a terrible threat. However, the barbed wire and infantries are not positioned to keep an enemy out, but to protect the rest of the world from a vampire plague that's spread over every inch of the country.\n\nAndrew Cosby, the creator of UPN's Haunted and the Sci-Fi network original series Eureka, and producer of the film version of Matt Wagner's Mage, teams with rising star and Eisner Award-nominee J. Alexander (Queen and Country) for a vampire epic of global proportions. Most of the living have fled the U.S., but a group of scientists remain behind, working on a cure. Now that they've succeeded, a military operation is launched from the President's current offices in the U.S. Embassy in London, to save the cure from the encroaching undead-but the real motivations of the military remain in question.\n","torrent":{"xt":"urn:btih:b8c163e07caffe045e1289df0f26e4f40d19c70b","amp;dn":"Damn+Nation+%5BGraphic+Novel%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8c163e07caffe045e1289df0f26e4f40d19c70b","infoHashBuffer":{"type":"Buffer","data":[184,193,99,224,124,175,254,4,94,18,137,223,15,38,228,244,13,25,199,11]},"announce":[],"urlList":[]}}