{"title":"Dr David Duke. My awakening. Jewish supremacism audiobook","uid":11243844,"size":2911820567,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ba62bead8b8b484f44e9fb86028484687f4f0fb5&amp;dn=Dr+David+Duke.+My+awakening.+Jewish+supremacism+audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ausdiobooktorrents","files":51,"time":1413706135,"description":"Dr David Duke is a historian Phd. He is a christian and writes on jewish supremacism and Israel.\n &lt;a href=&quot;\nhttp://davidduke.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://davidduke.com/&lt;/a&gt;\n\nI dont agree with everything he believes (he believes evolution, see creation.com for good articles on creation evolution) but his audiobook is a good introduction to the jewish topic and jewish influence in politics/the media/other areas of society. Apparently jewish people do not like the white race of people maybe because our religious heritage is Christianity so apparently through their lobbying group the Israel lobby they influence politicians to change laws and encourage immigration to dilute out the white race with other races of people. This is what they are doing to USA/UK and Australia per the occidentalobserver website and David Dukes articles, i dont believe it is so much just for the point of race mixing but of mixing the religions associated with each race (ie Islam religion is associated with the arabic race) so they can dilute out christianity. Dr Duke covers this. Occidental observer.com is another website with articles related to jewish influence in society. If you are a christian the sign of christianity is the CROSS not the 'star of David' that is judaism religions sign because \n\nRevelation 22:16\n\nI Jesus have sent mine angel to testify unto you these things in the churches. I am the root and the offspring of David, and the bright and morning star.\n\nSo the hexagram of the jewish people is the IMITATION star of David because they blaspheme Jesus\n\n\nSome more bible verses\n\n\n\n1 thessalonians 2\n\n14 For ye, brethren, became followers of the churches of God which in Judaea are in Christ Jesus: for ye also have suffered like things of your own countrymen, even as they have of the Jews:\n\n15 Who both killed the Lord Jesus, and their own prophets, and have persecuted us; and they please not God, and are contrary to all men:\n\n16 Forbidding us to speak to the Gentiles that they might be saved, to fill up their sins alway: for the wrath is come upon them to the uttermost.\n\n\n\nActs 7:43\n\nYea, ye took up the tabernacle of Moloch, and the star of your god Remphan, figures which ye made to worship them: and I will carry you away beyond Babylon\n\n\n\nAmos 5:26\n\nBut ye have borne the tabernacle of your Moloch and Chiun your images, the star of your god, which ye made to yourselves.\n\n\n\n\nGalatians 3:28\n\nThere is neither Jew nor Greek, there is neither slave nor free, there is no male and female, for you are all one in Christ Jesus","torrent":{"xt":"urn:btih:ba62bead8b8b484f44e9fb86028484687f4f0fb5","amp;dn":"Dr+David+Duke.+My+awakening.+Jewish+supremacism+audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba62bead8b8b484f44e9fb86028484687f4f0fb5","infoHashBuffer":{"type":"Buffer","data":[186,98,190,173,139,139,72,79,68,233,251,134,2,132,132,104,127,79,15,181]},"announce":[],"urlList":[]}}