{"title":"Star Wars: Deleted Magic Revisited","uid":4971835,"size":4773160699,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bb01c69865b04fb74ba125a25910e3275bf75b64&amp;dn=Star+Wars%3A+Deleted+Magic+Revisited&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tygerbug","files":127,"time":1245800871,"description":"An unofficial, not for profit DVD.\n\nSupport the official releases by Lucasfilm ..... especially if they ever\nrelease any of this material in DVD quality.\n\n\nDeleted scenes. Alternate footage. Editing secrets of the Star Wars\n trilogy.\n\n\nIn March 2005, I created a DVD called Deleted Magic and released\n it for free, on a non-profit basis, on the internet. It was very \npopular. I'm told that Clive Young's book Homemade Hollywood \ncalled it &quot;The best documentary ever made on the making of Star \nWars.&quot;\n\nIn 2009, I decided to revisit the major deleted scenes of Star Wars\n. Most of these scenes had only been released in low quality, 12 \nframes per second, on CD-ROMs in the late 90s. I used the \nprogram Twixtor to generate new frames and restore these scenes\n to 24 frames per second - not a perfect solution during fast \nmotion, but jaw-droppingly successful during dialogue scenes, and\n an improvement that is like night and day. I combined a multitude \nof new sources within the same frame to restore the Jabba the Hutt \nscene. I animated a shot of Luke and a Treadwell droid, and a shot \nof Ben attacking with his lightsaber during the Cantina sequence. I \nhave restored these scenes to a quality never seen before, and \nplaced them on this disc for you, edited into the original, \nunchanged Deleted Magic feature documentary from 2005. Enjoy. \n\n-Garrett Gilchrist, June 23rd, 2009\n\nWith many thanks to:\n\nMark Johnson\nBrad Cook\nPeter Lopez\nJambe Davdar (Jabba the Hutt scene)\n\nA note that the special features also appear in slightly better quality \nthan on the original Deleted Magic ... ripped directly from other fine \nfan DVDs. The 1977 crawl does not appear this time round due to \ndisc space (I had intended to use the version from my own Star \nWars Classic Edition 2.0).\n\nSlightly different menu music this time round.\n\nYou might find subtle references to two of my other fan DVD \nprojects.\n\nThe object of Deleted Magic Revisited was to recreate my original\n Deleted Magic DVD from 2005, but with new versions of five major\n deleted scenes. I had edited these scenes in 16x9 aspect ratio to \npreserve their quality. However, the original Deleted Magic was \nedited in a 4x3 aspect ratio, due to the many different sources \nused in the film, and the onscreen captions. \n\nSo, it was impossible to place the new material into the film seamlessly. Instead, there's an ugly jump as to another track as your DVD player switches ratios.\n\nI tried to place these switches in inconspicuous places, reediting \nsome material from the original Deleted Magic in 16x9 to make the\n transitions easier. Not a perfect solution - in fact it shows the\n slightly ropey quality of the original Deleted Magic! Murky black\nlevels etc. The new material looks a bit shinier/better.\n\n  I've recreated the functionality of the original Deleted Magic DVD,\n not an easy task, as it's a very complex DVD full of subtitles, photo \ngalleries, many chapters and tracks, &quot;stories&quot;, alternate audio, \ndifferent versions of things ... I retyped the extra subtitles, \nrecreated the image galleries, etc.\n\nEnjoy this new version!\n\n","torrent":{"xt":"urn:btih:bb01c69865b04fb74ba125a25910e3275bf75b64","amp;dn":"Star+Wars%3A+Deleted+Magic+Revisited","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb01c69865b04fb74ba125a25910e3275bf75b64","infoHashBuffer":{"type":"Buffer","data":[187,1,198,152,101,176,79,183,75,161,37,162,89,16,227,39,91,247,91,100]},"announce":[],"urlList":[]}}