{"title":"Audible Rip - H Beam Piper - Little Fuzzy","uid":8155965,"size":115804535,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bb630a1931963cbae7c3ef1873ea448c96ed8db9&amp;dn=Audible+Rip+-+H+Beam+Piper+-+Little+Fuzzy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"brianleb","files":59,"time":1361168633,"description":"Little Fuzzy\nFrom Wikipedia, the free encyclopedia\nJump to: navigation, search\nLittle Fuzzy\nLittleFuzzy.jpg\n1962 Avon edition cover\nAuthor(s) \tH. Beam Piper\nCountry \tUnited States\nLanguage \tEnglish\nGenre(s) \tScience Fiction\nPublisher \tAvon\nPublication date \t1962\nMedia type \tPrint (Hardcover &amp; Paperback)\nISBN \t0-441-48498-0\nFollowed by \tFuzzy Sapiens\n\nLittle Fuzzy is the name of a 1962 science fiction novel by H. Beam Piper, and is now in public domain. It is generally seen as a work of juvenile fiction. It was nominated for the 1963 Hugo Award for Best Novel.\n\nThe story revolves around determining whether a small furry species discovered on the planet Zarathustra is sapient. Along the way a gentle kind of libertarianism that emphasizes sincerity and honesty is advocated.\n\nDuring a book signing at Strand Book Store, Piper alleged that the Little Fuzzy series was inspired by an acquaintance named Kevin &quot;Fuzzy&quot; Sheffield. Piper and Sheffield first met while in a common literary club in central Oregon. They exchanged names and kept in loose contact for several years thereafter. When asked about Sheffield, Piper described him as &quot;a bizarre character, capable of writing little more than a couple of vaguely-legible remarks in each letter. While I'm sure he's full of insight and great ideas, it seems impossible to effectively communicate with him on a conventional human level...terribly nice fellow however.&quot;[citation needed]\n\nThe book was followed by a sequel, Fuzzy Sapiens (original title The Other Human Race) published in 1964, the same year that Piper committed suicide in November.\n\nIn the wake of Piper's suicide, rumor spread of a lost &quot;second sequel&quot;; eventually Ace Books hired William Tuning to write one; he produced the critically acclaimed Fuzzy Bones. Tuning announced plans to follow up on Bones; however, at this point, Piper's lost manuscript was discovered, and published as Fuzzies and Other People.\n\nAce also hired Ardath Mayhar to write Golden Dreams: A Fuzzy Odyssey, which tells the events of Little Fuzzy from the viewpoint of the Fuzzies (or Ga'shta, as they call themselves) rather than the humans.\n\nA new volume in the series, Fuzzy Ergo Sum by Wolfgang Diehr, was published by Pequod Press and made available onin April 2011. A second book, Caveat Fuzzy was released in August 2012.\n\nIn 2011, John Scalzi published Fuzzy Nation, which he described as a &quot;reboot&quot; of Piper's original.","torrent":{"xt":"urn:btih:bb630a1931963cbae7c3ef1873ea448c96ed8db9","amp;dn":"Audible+Rip+-+H+Beam+Piper+-+Little+Fuzzy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb630a1931963cbae7c3ef1873ea448c96ed8db9","infoHashBuffer":{"type":"Buffer","data":[187,99,10,25,49,150,60,186,231,195,239,24,115,234,68,140,150,237,141,185]},"announce":[],"urlList":[]}}