{"title":"Seeders","uid":12287806,"size":57846904,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bcf81bb7730de69c3e134febbeec61bcdfdedba5&amp;dn=Seeders&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dauphong","files":1,"time":1440499877,"description":"The Game\nSeeders is a puzzle-platformer with tight and responsive controls and some really challenging puzzles. If you share my opinion that most recent games in the genre have been too easy on the puzzles - then this game is for you. This game will make you stop and think and sometimes you will want to pull your hair out or throw the monitor out through the window. But you'll keep coming back until you solve it all.\n\nThe game engine allows you to experiment with the world and try different approaches until you find one that works. Some of the puzzles can be solved in multiple different ways. Checkpoints are abundant and it's always easy to go for one more try. In the first chapter there are subtle clues in the environment like billboards or signs on walls that should give you hints.\nThe Story\nYou ride on a jet-powered skateboard on a mission to find your lost friend. As you progress deeper into unknown territory, strange things start to happen and you begin to unveil a mystery. To prevent any spoilers, I will let you discover the details on your own. All I can say is that it does involve aliens and the Seeders have got something to do with that.\nFeatures\n\n    single player adventure\n    local co-op with additional puzzles designed for two players\n    original soundtrack\n    support for various controllers\n    support for older graphics cards and computers\n    over 100 unique puzzles including switches, sensors, doors, elevators, movable blocks, lasers, mirrors, driving vehicles, flying a spaceship, manipulating gravity and your enemies","torrent":{"xt":"urn:btih:bcf81bb7730de69c3e134febbeec61bcdfdedba5","amp;dn":"Seeders","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcf81bb7730de69c3e134febbeec61bcdfdedba5","infoHashBuffer":{"type":"Buffer","data":[188,248,27,183,115,13,230,156,62,19,79,235,190,236,97,188,223,222,219,165]},"announce":[],"urlList":[]}}