{"title":"Find My Phone v4.8","uid":8723265,"size":1800850,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:be13ff3107bd241414105217076b2ba5816d259f&amp;dn=Find+My+Phone+v4.8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1374461295,"description":"\nFind your lost, stolen, or misplaced phone with the original device recovery app for Android. Find My Phone is an important security app that you want to have on your phone, as it provides a means of recovering a lost or stolen device. Note that is not an anti-virus app; we focus on one task - device recovery and finding your phone - and do it well.\n\nFeatures:\n\n* If you lose your phone, just send it a text message and Find My Phone will reply to you with its current address, and a Google Maps link to your phone's location.\n* Text your phone and have it ring at maximum volume (even if is on silent) to locate by ear.\n* Find out how much battery is remaining\n* Get notified if somebody changes your SIM card\n* Track from the web by having your phone email back it's location\n* New: Remotely wipe your phone \n* NO ADS!\n\nInstructions:\n\n1. Install Find My Phone. Enable GPS in Settings.\n2. Text '01234' to your phone and start tracking it.\n3. Text '56789' to your phone to make it ring until you find it.\n\nAlready lost your phone?\n\nIf you're phone has Android v3.0 or below (many do), you can remotely install Find My Phone from Google Play.\n\nGPS off?\n\nFind My Phone can automatically turn on GPS for v2.2 and below.\n\nDon't have another phone to text from?\n\nNo problem. Use a free online SMS service like Google Voice or textem.net to send the text, and your phone will email it's location to you.\n\n*NEW* Remote Wipe (Factory Reset)\nRemotely wipe your phone if you think your device might be in the wrong hands. (Requires on-device set up).\n*NEW* Device Administration\n\nGranting device administration rights to Find My Phone enables many important features, including: remote wiping, locking your phone, and preventing unauthorized uninstallation of the app. Note that this requires on-device set up.\n\nAbsolutely NO ADS.\nNo registration.\nJust works!\n\nWhat's New:\n\nSupport for device administration and remote wipe\nChanged default triggers to be numeric\nNote: If you have any custom text messaging apps installed, like Go SMS Pro or Handcent, then you may need to configure their settings. Instructions available on website.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.mango.findmyphone&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.mango.findmyphone&lt;/a&gt;\n","torrent":{"xt":"urn:btih:be13ff3107bd241414105217076b2ba5816d259f","amp;dn":"Find+My+Phone+v4.8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be13ff3107bd241414105217076b2ba5816d259f","infoHashBuffer":{"type":"Buffer","data":[190,19,255,49,7,189,36,20,20,16,82,23,7,107,43,165,129,109,37,159]},"announce":[],"urlList":[]}}