{"title":"Bert Jansch...Toy Balloon(1998)[FLAC]","uid":5716803,"size":223180155,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:bebd9e6dcca31f094fd84ec7ea05ee615daf9954&amp;dn=Bert+Jansch...Toy+Balloon%281998%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":17,"time":1280138102,"description":"The fact that Bert Jansch continues to produce superb records more than 30 years into his career is proof not only of his talent, but of his longevity, and Toy Balloon follows up on the excellent When the Circus Comes to Town to show that his touch -- both as a writer and guitarist -- remains sure. &quot;She Moves Through the Fair&quot; is a traditional piece that's been tackled by almost everybody, but in his hands it becomes beautifully meditative and hypnotic, the perfect lead-in to the gentle love song &quot;All I Got.&quot; And that, in turn, makes a nice foil for the title cut; written for a little girl, its lyrics are perfect for a young one. It's certainly notable that the best tracks on the album are those Jansch performs solo. He has great backing, including former Dire Straits man Pick Withers on drums and the legendary Pee Wee Ellis on sax (who gets to shine on &quot;Just a Simple Soul&quot;), but where it's all Jansch, as intimate as sitting in his living room, the album comes most alive. He doesn't need to make his guitar work flashy, he has nothing to prove, and he knows his voice is far from a perfect instrument. But he can still make each song an evocative experience, as on Jackson C. Frank's &quot;Carnival.&quot; Above all it's the sound of someone who's not only come to terms with his life, but it happy with himself, and able to look outside to his dreams of Erin on &quot;Born and Bred in Old Ireland.&quot; With the new outlook, his writing has continued to mature, and take a quantum leap for the introspection, and frequent self-pity that categorized Jansch's '80s work, it's hard to believe he could have written something as carefree as &quot;Sweet Talking Lady&quot; before, for example. But Toy Balloon shows that, not only can someone return to form, but continue from strength to strength. ~ Chris Nickson, All Music Guide\n\n\n1 Carnival 4:25 \n2 She Moved Through the Fair 4:55 \n3 All I Got 3:16 \n4 Bett's Dance 2:46 \n5 Toy Balloon (for Little Anna-Rebecca) 3:32 \n6 Waitin and Wonderin 4:14 \n7 Hey Doc 2:45 \n8 Sweet Talking Lady 3:58 \n9 Paper Houses 3:01 \n10 Born and Bred in Old Ireland 3:10 \n11 How It All Came Down 4:40 \n12 Just a Simple Soul 3:54 \n\nCredits of Toy  Balloon\nPick Withers Drums \nMarcus Cliffe Guitar (Bass)\n Jackson C. Frank Performer \nLaura B Producer. Effects, Engineer \nJanie Romer Vocals (Background) Johnny Hodge Harmonica, Slide Guitar \nPee Wee Ellis Saxophone \nJay Burnett Keyboards, Engineer, Producer \nB.J. Cole Pedal Steel \nBert Jansch Guitar, Arranger, Vocals\n\ncd ripped by dBpoweramp\n\nplease seed","torrent":{"xt":"urn:btih:bebd9e6dcca31f094fd84ec7ea05ee615daf9954","amp;dn":"Bert+Jansch...Toy+Balloon%281998%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bebd9e6dcca31f094fd84ec7ea05ee615daf9954","infoHashBuffer":{"type":"Buffer","data":[190,189,158,109,204,163,31,9,79,216,78,199,234,5,238,97,93,175,153,84]},"announce":[],"urlList":[]}}