{"title":"X-Men - Hellfire Club (2000) - Charlie Adlard artist of The Walk","uid":7836223,"size":40600235,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:bee02c06946e708319961b5bc516c31f1c9c3783&amp;dn=X-Men+-+Hellfire+Club+%282000%29+-+Charlie+Adlard+artist+of+The+Walk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1353194916,"description":"This four-issue miniseries published by Marvel Comics in 2000 features the origins of the Inner Circle of the Hellfire Club, a group of villains introduced by Chris Claremont and John Byrne in 1980. Emma Frost, the Inner Circle's White Queen, had already become a main character in the series Generation X, but would become a key member of Grant Morrison's NEW X-MEN in 2001, the year after X-MEN: HELLFIRE CLUB was published.\n\nWritten by Ben Raab, the X-MEN: HELLFIRE CLUB miniseries featured the art of Charlie Adlard, who would become the longtime artist on THE WALKING DEAD. (He has drawn issues #7 to #104 to date.) HELLFIRE CLUB is not only a chance to see interior art by Adlard in full color, it's one of just three Adlard projects did for Marvel.\n\nThe cover of the first issue, probably as a sales gimmick, was drawn by Adam Kubert. Adlard pencils and inks #1-4 and covers on #2-4.\n\n\nI enjoyed this miniseries, but I don't have the ability to summarize the complicated story. I can say it weaves through Marvel history with appearances including a Colonial-era Captain America, Dormammu, Archangel, Union Jack, Sage (as Tessa) and the Sentinels. Some woman who's probably Jean Grey's great-grandma is introduced, as is the shapeshifting, bisexual dad of Sebastian Shaw. No kidding!\n\nOh, and I dedicate this torrent to the douchebag on TPB who commented that Adlard's most recent art &quot;sucks balls.&quot; ALL CREDIT GOES TO THE ORIGINAL SCANNER!","torrent":{"xt":"urn:btih:bee02c06946e708319961b5bc516c31f1c9c3783","amp;dn":"X-Men+-+Hellfire+Club+%282000%29+-+Charlie+Adlard+artist+of+The+Walk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bee02c06946e708319961b5bc516c31f1c9c3783","infoHashBuffer":{"type":"Buffer","data":[190,224,44,6,148,110,112,131,25,150,27,91,197,22,195,31,28,156,55,131]},"announce":[],"urlList":[]}}