{"title":"Baruch Spinoza - Philosophical Works (7 books)","uid":10175042,"size":55341645,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf113022572adcbae84c8da5f4d24f53ddae4fe2&amp;dn=Baruch+Spinoza+-+Philosophical+Works+%287+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1400453896,"description":"\nBARUCH SPINOZA (1632-1677) was a Dutch philosopher whose work established the foundations of the 18th-century Enlightenment.  Raised in the Portuguese Jewish community in Amsterdam, he developed highly controversial ideas regarding the authenticity of the Hebrew Bible and the nature of the Divine.  He was ostracized by the Jewish religious authorities and his books were later put on the Catholic Church's Index of Forbidden Books.  His philosophical accomplishments and moral character prompted 20th-century philosopher Gilles Deleuze to name him &quot;the 'prince' of philosophers.&quot;\n\nHis magnum opus, the posthumous ETHICS (1667), in which he opposed Descartes's mind-body dualism, has earned him recognition as one of Western philosophy's most important thinkers.  In the Ethics, according to Roger Scruton, &quot;Spinoza wrote the last indisputable Latin masterpiece, and one in which the refined conceptions of medieval philosophy are finally turned against themselves and destroyed entirely.&quot;\n\nThe THEOLOGICAL-POLITICAL TREATISE, published anonymously in 1670, was one of the most controversial texts of the early modern period.  A powerful defense of secular and constitutional government, it is also a masterpiece of Scriptural interpretation that laid the groundwork for modern Biblical criticism.\n\n\nThe following books are a mix of PDF and/or ePUB formats as indicated:\n\n* THE CHIEF WORKS OF SPINOZA (Dover, 1951-1955).  2 volumes.  Translated with an Introduction by R.H.M. Elwes. -- ePUB\n\n* THE COMPLETE WORKS (Hackett, 2002).  Translated by Samuel Shirley; edited, with Introductions, by Michael L. Morgan. -- PDF\n\n* [THE ETHICS].  Translated by R.H.M. Elwes.  Included in the volume THE RATIONALISTS (Anchor, 1960), with works by Descartes and Leibniz. -- PDF\n\n* THE ETHICS / TREATISE ON THE EMENDATION OF THE INTELLECT / SELECTED LETTERS (Hackett, 1992).  Translated by Samuel Shirley; edited, with Introductions, by Seymour Feldman. -- ePUB\n\n* A SPINOZA READER: &quot;The Ethics&quot; &amp; Other Works (Princeton University Press, 1994).  Edited and translated by Edwin Curley. -- PDF\n\n* THEOLOGICAL-POLITICAL TREATISE (Cambridge University Press, 2007).  Edited by Jonathan Israel; translated by Michael Silverthorne and Jonathan Israel. -- PDF + ePUB\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                     &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:bf113022572adcbae84c8da5f4d24f53ddae4fe2","amp;dn":"Baruch+Spinoza+-+Philosophical+Works+%287+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf113022572adcbae84c8da5f4d24f53ddae4fe2","infoHashBuffer":{"type":"Buffer","data":[191,17,48,34,87,42,220,186,232,76,141,165,244,210,79,83,221,174,79,226]},"announce":[],"urlList":[]}}