{"title":"The Sun Blues Box: Blues, R&amp;B And Gospel Music In Memphis 19","uid":11514944,"size":2989089484,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bf8e6f936d3ad1c7f99422726884b71cb66a72b5&amp;dn=The+Sun+Blues+Box%3A+Blues%2C+R%26amp%3BB+And+Gospel+Music+In+Memphis+19&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1416441018,"description":"eac secure with cues and logs\n\nThe Sun Blues Box: Blues, R&amp;B And Gospel Music In Memphis 1950-1958\n\n(10-CD LP-sized Box Set with 184 page hardcover book, 307 tracks and over 830 minutes of music) Now, in conjunction with SUN's sixtieth anniversary, BEAR FAMILY is releasing three genre-defining box sets.\n\nTHE SUN BLUES BOX is one of them. It is the last word on the SUN and pre-SUN blues recordings. Nearly 30 years after the original Sun Blues Box was released on LP, it's back on CD with so much more than was on the original set. Recently discovered music from well-known artists... and incredible artifacts like Sam Phillips narrating a radio commercial for a West African herbalist who would soon be jailed for selling bogus patent medicine. Recordings produced by Phillips but issued on Chess, RPM, TRUMPET and other labels were unavailable in 1983, but are now included. Researcher Steve LaVere finally allowed the world to hear the SUN audio and see the SUN-related photos he collected back in the late 1960s. In fact, the entire blues research community came together to make this a once-in-a-lifetime blues experience!\n\nSo don't believe that the story of SUN RECORDS has been told until you hear a priceless audio fragment that might be SUN #176... the only SUN record that has never been heard, or seen the scrap of paper where Sam Phillips figured out his tiny income for 1952, or hear African-American gay nightclub singer Rudi Richardson sing rock 'n' roll! This is the story of the most lauded record label of all time told as only BEAR FAMILY can tell it!\n\nThis is the story of ten years that changed the world of popular culture!","torrent":{"xt":"urn:btih:bf8e6f936d3ad1c7f99422726884b71cb66a72b5","amp;dn":"The+Sun+Blues+Box%3A+Blues%2C+R%26amp%3BB+And+Gospel+Music+In+Memphis+19","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf8e6f936d3ad1c7f99422726884b71cb66a72b5","infoHashBuffer":{"type":"Buffer","data":[191,142,111,147,109,58,209,199,249,148,34,114,104,132,183,28,182,106,114,181]},"announce":[],"urlList":[]}}