{"title":"Save.The.Green.Planet.2003.DVD9","uid":8572996,"size":10546789054,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bfe982ea7cbc15ed0b85ff33368d09838e5ded7c&amp;dn=Save.The.Green.Planet.2003.DVD9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MasterKush","files":-1,"time":1371207872,"description":" IMDb Link........: http://www.imdb.com/title/tt0354668/\n\n Genre............: Thriller / Drama /  Comedy\n Distributor......: Tartan Asia Extreme\n Year.............: 2003\n Country..........: Korea\n Director.........: Joon-Hwan Jang\n\n Source...........: DVD9 Retail\n DVD Format.......: PAL\n DVD Size.........: DVD9\n Programs used....: CloneDVD\n Screen Format....: Widescreen\n Audio Language...: Korean\n Audio Format.....: DD 2.0, DD 5.1, DTS\n Subtitles........: English\n\n Menu.............: [x] Untouched\n                    [ ] Stripped\n\n Video............: [x] Untouched\n                    [ ] Re-encoded\n\n DVD Extras.......: [x] Untouched\n                    [ ] Re-encoded\n                    [ ] Stripped\n                    [ ] None on source\n\nUploader's Comments:\n\nSave The Green Planet, DISC 1 of a 2 Disc Special Edition Set\n\nDisc 1 features:\n* Director Commentary\n* Original Trailer\n\nDirector/Writer: Jeong Jun-hwan.\nAudio Tracks: Korean (Dolby Digital 5.1),(DTS),(Stereo)\nScreen Format: Widescreen 1.85:1, 113 (minutes)\nSubtitles: English, Korean\n\nDisc 2 features:\nAmong other things;\n* The Lazy Mirror - A short film by Jeong Jun-Hwan\n* 9 deleted scenes with director commentary\n* Making of documentary\n* 8 Cast And Crew Interviews\n\nDescription::\nIt's not often that a movie comes along that combines the twin themes of saving our precious, beautiful world and the hideous torture of a (possibly extra-terrestrial) businessman at the hands of a lunatic. Such is the totally bonkers concept behind Save The Green Planet, the debut film from writer/director Jang Jun-kwan - and proof that no matter how many warped movies you've seen through the years, you can always guarantee that a new one will come a long to top them all. The fact that this particular piece of cult craziness hails from Korea only adds to its delicious and exotic flavour.\n\n\nSo, what's it about? It's not just torture, although that does form the buld of the plot. Save The Green Planet actually boasts a remarkably eclectic script, mixing science fiction, drama, comedy and camp into a stody so nuts it's a wonder squirrels aren't chasing it. There's a violent revenge theme, as Byung-Gu [Shin Ha-Kyun] unconsciously blames his hapless victim for the hospitalisation of his mother, even as he convinces himself he's torturing him to save the world. There's a detective story, which focuses on the attempts of down-on-his-luck Inspector Choo [Lee Jae-yong] to track down the missing businessman. There's a love story, as Byung-Gu's innocent, tightrope-walking girlfriend [Jeong-min Hwang] gets drawn into his dangerous world... and then there's an alien invasion story, which is the root of poor Kang Man-shik's [Yun-shil Baek] predicament. Is he an alien or isn't he? Torture is the only way to know for sure...\n\n\nWhat's compelling about this scenario is that, even though Byung-Gu torments his victim to protect Earth and life as we know it, we're pretty sure that Greenpeace wouldn't approve of his actions. (In fact, we'd just like to state categorically in print that we do not, in any way, condone the use of torture to reveal whether that bloke who lives across the street from you is actually an alien from Andromeda in disguise. Don't do it. Or if you do, don't sue us when the coppers cart you away.)\n\n\nYou see, we all know that Earth is a messed-up world; you name it - pollution, corruption, death, disease, reality TV - evil is here and it's not going away. Which is why Byung-Gu, ostensibly the villain of the piece, is still oddly sympathetic: he's just trying to do what he thinks is right.\nHe wants to save the world, and if that means he has to kidnap random members of the population and torture them in painfuil (and often daft) ways to achieve that, then he'll bloddy well do it. Byung-Gu - who never once fails to convince, thanks to a powerhouse performance by Ha-Kyn Shin - has a sick knack for torture, ruthlessly concocting fiendish devices and methods to get his victims to confess their otherworldly origins. Whether he loses his own humanity in order to save humanity is up to the viewer to decide. Byung-Gu is just an ordinary man in extraordinary circumstances; and what would we do in a similar situation...? For startes, we'd probably dump that silver anal device. At least, let's hope so.\n\n\nFacing Byung-Gu's attempts to uncover the truth about the alleged alien plot is the unfortunate Kang Man-Shik, played with phenomenal gravitas by Yun-shik Baek. He's a rich and powerful industrialist whose determination not to let this maniac destroy his life is admirable, if ultimately hopeless. Often gaining the sympathy of the audience - despite quite obviously being a bit of a git - he manages to retain his dignity, even when reduced to wearing a dress or suffering bee sting ointment applied to strange parts of his body. Not since Dustin Hoffman's misadventures with a dentist in Marathon Man has one man suffered so much for the camera, and his agonies give Save The Green Planet a macabre edge that remarkably manage4s to sit comfortably with the humour.\n\n\nThat's what's so great about this film: despite its craziness, despite the gruelling horror of the torture scenes, the convincing drama of the police investigation and the high camp of Byung-Gu's convictions, the audience is still left satisfied and - dare we say - heartwarmed when the movie ends. Save The Green Planet has a message, a method to its madness. And to still be able to pluck at bittersweet heartstrings after all the story's rampant lunacy is the mark of a genius filmmaker. Jang Jun Hwan has crashed into world cinema in an explosion of bee sting balm and UFOs. Watch his work closely... and while you're at it, keep watching the skies, too.\n\nJayne Dersley","torrent":{"xt":"urn:btih:bfe982ea7cbc15ed0b85ff33368d09838e5ded7c","amp;dn":"Save.The.Green.Planet.2003.DVD9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfe982ea7cbc15ed0b85ff33368d09838e5ded7c","infoHashBuffer":{"type":"Buffer","data":[191,233,130,234,124,188,21,237,11,133,255,51,54,141,9,131,142,93,237,124]},"announce":[],"urlList":[]}}