{"title":"Natale.a.Rio.2008.iTALiAN.LD.CAM.XviD-MoON[volpebianca]","uid":4593981,"size":730093568,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c041b58551c1adf03792566ad0b07df024e13e69&amp;dn=Natale.a.Rio.2008.iTALiAN.LD.CAM.XviD-MoON%5Bvolpebianca%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ivanone","files":1,"time":1229937714,"description":"Natale a Rio\n\nTitolo originale:  \tNatale a Rio\nNazione:  \tItalia\nAnno:  \t2008\nGenere:  \tCommedia\nDurata:  \t110'\nRegia:  \tNeri Parenti\nSito ufficiale:  \twww.nataleariodejaneiro.it\n\nCast:  \tChristian De Sica, Massimo Ghini, Michelle Hunziker, Fabio De Luigi, Paolo Conticini, Ludovico Fremont, Emanuele Propizio\nProduzione:  \tAurelio De Laurentiis &amp; Luigi De Laurentiis\nDistribuzione:  \tFilmauro\nData di uscita:  \t19 Dicembre 2008 (cinema)\n\nTrama:\nFabio (Fabio De Luigi) ÃƒÂ¨ da sempre innamorato della sua collega Linda (Michelle Hunziker), ma senza il coraggio di rivelarsi. A causa di uno scambio di indirizzi elettronici, Fabio pensa che Linda lo abbia notato e addirittura invitato a passare con lei le vacanze di Natale in Brasile. Ma quando si presenta in aeroporto, si accorge dell'equivoco: Linda sta partendo con il suo fidanzato segreto Gianni (Paolo Conticini) e per di piÃƒÂ¹ il motivo del viaggio ÃƒÂ¨ presentarlo al padre che vive in Brasile da molti anni. Non potendo piÃƒÂ¹ tirarsi indietro, Fabio ÃƒÂ¨ costretto a partire come terzo incomodo. Una volta arrivati a destinazione, Gianni cade in tentazione e si lancia in un avventura amorosa con una bella brasiliana. Scoperto da Linda, viene immediatamente lasciato. La ragazza non vuole tuttavia rivelare al padre di essere stata nuovamente presa in giro da un uomo e chiede a Fabio di fingere di essere il suo futuro marito. Mai proposta poteva essere piÃƒÂ¹ allettante per Fabio, che mette in atto ogni trucco e stratagemma per prolungare il periodo della finzione. Ma il ritorno di Gianni pentito rischia di far fallire il suo sogno d'amore... Paolo (Christian De Sica) e Mario (Massimo Ghini), due divorziati cinquantenni, hanno organizzato una vacanza lussuosissima a Rio de Janeiro per le feste di Natale. Ignorano, tuttavia, che i loro figli Piero (Ludovico Fremont) e Marco (Emanuele Propizio) hanno prenotato un viaggio low-cost per la stessa destinazione. A causa dell'omonimia tra padri e figli, le due vacanze vengono scambiate, cosÃƒÂ¬ mentre i figli si godono ville di lusso e auto superaccessoriate, i padri finiscono in un comico vagabondare, tra ostelli pulciosi e auto sgangherate, per le strade piÃƒÂ¹ malfamate di Rio de Janeiro. Paolo e Mario realizzano che c'ÃƒÂ¨ stato un errore e tentano con ogni mezzo di rientrare in possesso della loro vacanza. A complicare le cose ci si mette anche il fatto che le mamme di Piero e Marco, all'insaputa di figli ed ex mariti, si trovano a Rio per un'operazione di chirurgia plastica. Tra equivoci ed inaspettate coincidenze padri e figli si incontreranno e si scontreranno in avventure travolgenti...","torrent":{"xt":"urn:btih:c041b58551c1adf03792566ad0b07df024e13e69","amp;dn":"Natale.a.Rio.2008.iTALiAN.LD.CAM.XviD-MoON%5Bvolpebianca%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c041b58551c1adf03792566ad0b07df024e13e69","infoHashBuffer":{"type":"Buffer","data":[192,65,181,133,81,193,173,240,55,146,86,106,208,176,125,240,36,225,62,105]},"announce":[],"urlList":[]}}