{"title":"David Estes - Slip Trilogy (Slip, Grip, Flip) EPUB","uid":11767620,"size":1662833,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c175d6e0bd1442e421a0ea6e477a988c712e5709&amp;dn=David+Estes+-+Slip+Trilogy+%28Slip%2C+Grip%2C+Flip%29+EPUB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"montar0","files":10,"time":1426922285,"description":"Slip Trilogy by David Estes\n\nIn EPUB format, DRM free.\n\n---\n\nBOOK 1 - Slip\nSomeone must die before another can be born...\n\nAs sea levels rise and livable landmasses shrink, the Reorganized United States of America has instituted population control measures to ensure there are sufficient resources and food to sustain the growing population. Birth authorization must be paid for and obtained prior to having a child. Someone must die before another can be born, keeping the country in a population neutral position at what experts consider to be the optimal population. The new laws are enforced by a ruthless government organization known as Pop Con, responsible for terminating any children resulting from unauthorized births, and any illegals who manage to survive past their second birthday, at which point they are designated a national security threat and given the name Slip.\n\nBut what if one child slipped through the cracks? What if someone knew all the loopholes and how to exploit them? Would it change anything? Would the delicate resource balance be thrown into a tailspin, threatening the lives of everyone?\n\nAnd how far would the government go to find and terminate the Slip?\n\nIn a gripping story of a family torn apart by a single choice, Slip is a reminder of the sanctity of a single life and the value of the lives we so often take for granted.\n\n---\n\nBOOK 2 - Grip\nIn a tumultuous world of population control, one illegal child has slipped through the cracks. Now, as a teenager, Benson Kelly has escaped certain death at the hands of the Department of Population Control, only to find himself the symbol of a rebellion, something he never intended.\n\nWhile trying to survive one day at a time, Benson seeks to unravel the tangled knot of secrets left behind when his father died, the key to which has something to do with his mother, Janice Kelly, recently escaped from the insane asylum.\n\nAs the rebel group known as the Lifers continue to use brute force to send a message to the government, Benson's twin, Harrison Kelly, seeks to exploit a loophole that could be the key to freedom for his brother. All that's required is a simple act of murder.\n\nMeanwhile, Population Control's attack dog, a sadistic cyborg known as The Destroyer, closes in on Benson and his family. His directive: Kill them all.\n\nFaith, family and love will be pushed to the limits in the GRIPping sequel to Slip.\n\n---\n\nBOOK 3 - Flip\nIn a scared and broken world where someone must die before another can be born, one family has been torn apart by fate and a ruthless government, only to find themselves suddenly thrust back together with one chance to save their struggling nation.\n\nBenson and Harrison Kelly and their newfound allies within the rebel consortium are finally fighting back, but the Department of Population Control and its ultimate weapon, known as the Destroyer, won't rest until they're all dead. The task will take them into the belly of the beast and force them to face a secret about their past that will change everything.\n\nMeanwhile, the leader of the Lifers, Jarrod, has a new weapon, in the form of an angry, desperate twelve-year-old boy, and he won't hesitate to use him to destroy an entire city as part of a hidden agenda only just starting to be revealed.\n\nThe fate of humanity hinges on a series of impossible choices made by those with nothing to lose. One family. One chance to flip everything they know on its head. One action-packed finale that will leave you breathless","torrent":{"xt":"urn:btih:c175d6e0bd1442e421a0ea6e477a988c712e5709","amp;dn":"David+Estes+-+Slip+Trilogy+%28Slip%2C+Grip%2C+Flip%29+EPUB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c175d6e0bd1442e421a0ea6e477a988c712e5709","infoHashBuffer":{"type":"Buffer","data":[193,117,214,224,189,20,66,228,33,160,234,110,71,122,152,140,113,46,87,9]},"announce":[],"urlList":[]}}