{"title":"Naruto shippuden ultimate ninja 4 PS2 ntsc","uid":7668797,"size":3462384979,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:c189cf94d4c98de5f71ac5f6fc5668d1bd60013c&amp;dn=Naruto+shippuden+ultimate+ninja+4+PS2+ntsc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"sadx","files":1,"time":1348511728,"description":"Set two and a half years after Naruto left the Hidden Leaf Village to undergo a strict training regiment with his mentor Jiraiya, Ultimate Ninja 4: Naruto Shippuden lets players experience this new storyline for the first time. Returning to help recover his rival Sasuke from the evil Orochimaru, Naruto is reunited with all his old friends, only to find that a mysterious organization known as Akatsuki now poses an even more ominous threat to the Village. \nUltimate Ninja 4: Naruto Shippuden features several unique game modes that offer different experiences as players immerse themselves in the world of ninja. The new Master Mode combines role-playing and action-platforming elements, telling the story of how Naruto came to return to the Hidden Leaf Village after his training with Jiraiya; an original narrative arc that fans won't find anywhere else. Players can collect items in this mode to unlock characters in Free Battle Mode, featuring the series' trademark one-on-one ninja battles for one or two players. Packed with new Naruto Shippuden characters such as Deidara, Sasori and Chiyo as well as updated versions of fan favorites such as Gaara, Kakashi and Sakura, the game features 52 total playable characters to take into battle. \n\nESR tested. Extracts to ISO \n\nFile format: NTSC\n\nIF using ESR on FMCB please patch with ESR disc patcher.\n\nRemember to seed.","torrent":{"xt":"urn:btih:c189cf94d4c98de5f71ac5f6fc5668d1bd60013c","amp;dn":"Naruto+shippuden+ultimate+ninja+4+PS2+ntsc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c189cf94d4c98de5f71ac5f6fc5668d1bd60013c","infoHashBuffer":{"type":"Buffer","data":[193,137,207,148,212,201,141,229,247,26,197,246,252,86,104,209,189,96,1,60]},"announce":[],"urlList":[]}}