{"title":"Do re mi fa so la si do korean movie (2008)","uid":6503748,"size":735944704,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c2ff4bf153b272770c206a6e6872b07b1343ba21&amp;dn=Do+re+mi+fa+so+la+si+do+korean+movie+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"nishanta_07","files":1,"time":1309307866,"description":"Based on the Internet novel of the same and written by Yeo-ni Gui, &quot;Do Re Mi Fa So La Ti Do&quot; is a touching love story with bittersweet elements. Jung-won wears a funny dragon suit, while working at the amusement park, and pours soda on Eun-kyoo, because of his taunts. A short while later, Jung-won finds out that Eun-kyoo has moved into the house next to hers. Eun-kyoo now threatens to tell Jung-won's parents that she works a part time job. To keep Eun-kyoo quiet, Jung-won agrees to carry his guitar for a week. Jung-won then starts developings feelings for Eun-kyoo, who is the lead singer in a band called Do Re Mi Fa So La Ti Do. Eun-kyoo also starts to develop similar feelings for Jung-won. The two soon become a couple. With an odd twist of fate, Jung-won goes to the bands rehearsal room and meets a familiar person from her past, a boy named Hui-won. Their relationship makes everything make more complicated. 10 years ago, Jung-won and Hui-won were close friends, but because of a personal matter stopped talking to each other completely. Jung-won is now surprised to learn that her ex-close friend is now best friends with her boyfriend. Will their relationships survive?\nFlixster Users\n\n\nCast\n\nCha Ye Ryeon as Jung Won\nJang Geun Suk as Eun Gyu\nJung Eui-chul as Hee Won\nIm Joo Hwan as Jung Won's brother\nHan Soo Yun\nLee Eon Jeong\nPark Min Ji\nKim Hye Ok","torrent":{"xt":"urn:btih:c2ff4bf153b272770c206a6e6872b07b1343ba21","amp;dn":"Do+re+mi+fa+so+la+si+do+korean+movie+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2ff4bf153b272770c206a6e6872b07b1343ba21","infoHashBuffer":{"type":"Buffer","data":[194,255,75,241,83,178,114,119,12,32,106,110,104,114,176,123,19,67,186,33]},"announce":[],"urlList":[]}}