{"title":"Identity and the Lifecycle - Erik Erikson","uid":8219196,"size":5225280,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c30dec0abc2cc5e22f903c1e695e3a8d96c96db3&amp;dn=Identity+and+the+Lifecycle+-+Erik+Erikson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UnviolentPeacemaker","files":3,"time":1362432507,"description":" &lt;a href=&quot;http://www.nytimes.com/learning/general/onthisday/bday/0615.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.nytimes.com/learning/general/onthisday/bday/0615.html&lt;/a&gt;\n\nThe Difinitive theory of healthy psychological development throughout life to the dominant stage...\n\nGENERATIVITY, the adult stage, where the healthy adult devotes their life to the wellbeing of the next geration.\n\nFrom the New York Times\n\n... He was best known for the theory that each stage of life, from infancy on, is associated with a specific psychological struggle that contributes to a major aspect of personality.\n\nThat represented a quantum leap in Freudian thought, suggesting that the ego and the sense of identity are shaped over the entire life span and that experiences later in life might help heal the hurts of early childhood.\n\nMr. Erikson's influence, compounded by clinical studies of children, a teaching post at Harvard University, popular lectures and best-selling books on Mohandas K. Gandhi and Martin Luther, pervaded many layers of society, from education to medicine to law to biography to psychiatry to lowbrow culture...\n\n... As a pioneer in the study of the life cycle, Mr. Erikson saw it consisting of these eight crucial stages:\n*Infancy, or the oral sensory stage, in which the emotional conflict is between basic trust and mistrust.\n*Muscular-anal, in which autonomy conflicts with shame and doubt.\n*Locomotor-genital, where the conflict lies between initiative and guilt\n*Latency, in which the positive component is industry and the negative is inferiority.\n*Adolescence, where the identity crisis, or role confusion, normally occurs.\n*Young adulthood, in which intimacy vies with isolation.\n*Adulthood, in which the crisis poles are generativity and stagnation.\n*And maturity, or old age, when despair threatens ego integrity....","torrent":{"xt":"urn:btih:c30dec0abc2cc5e22f903c1e695e3a8d96c96db3","amp;dn":"Identity+and+the+Lifecycle+-+Erik+Erikson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c30dec0abc2cc5e22f903c1e695e3a8d96c96db3","infoHashBuffer":{"type":"Buffer","data":[195,13,236,10,188,44,197,226,47,144,60,30,105,94,58,141,150,201,109,179]},"announce":[],"urlList":[]}}