{"title":"Private Gold 91 - Evil Geishas Hotel (2007,xvid) - anal, DP","uid":4737855,"size":1466947584,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c3574596fcf1782c45377173fc5c8ae148ea65ba&amp;dn=Private+Gold+91+-+Evil+Geishas+Hotel+%282007%2Cxvid%29+-+anal%2C+DP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"corfitez","files":2,"time":1235399788,"description":"Private Gold 91 - Evil Geishas Hotel (2007,xvid)\n\n\n\n\n\n\nscreens CD1 + CD2  (+ large DVD-covers):\n  &lt;a href=&quot;\nhttp://sinexx.blogbugs.org/7523269/Evil-Geishas-Hotel---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sinexx.blogbugs.org/7523269/Evil-Geishas-Hotel---screens.html&lt;/a&gt;\n\n\n\n\n\nFrom the DVD:\nBehind the doors to the hotel Sacrament everyone feels the grip of ther most extreme sexual desires. \nDJ Misty (Lady May) steps in for six sizzling scenes of hardcore with a fetish edge. From a double-ended dildo encounter with busty Natalia Zeta, to men in costumes filing all Lady May's tight holes... \nRaw lingering camera work, smoking performances by evil geishas Claudia Rossi and Suzie Diamond, brought to you by X-Off, Private's hot new director.\n\nActresses\n\n    * Claudia Rossi [Anal Facial]\n    * Lady Mai [Anal Facial DP Bald]\n    * Miercoles [LezOnly Bald]\n    * Natalia Zeta [LezOnly Bald]\n    * Suzie Diamond [Facial]\n\nActors\n\n    * George Uhl\n    * Jorge Fernandez\n    * Olivier Sanchez\n\n \n   \nScene Breakdowns\n\n    * Scene 1. Lady Mai, Miercoles\n    * Scene 2. Lady Mai, Natalia Zeta\n    * Scene 3. Jorge Fernandez, Lady Mai, Suzie Diamond\n    * Scene 4. Claudia Rossi, George Uhl, Lady Mai\n    * Scene 5. George Uhl, Jorge Fernandez, Lady Mai\n    * Scene 6. Claudia Rossi, Olivier Sanchez, Suzie Diamond\n    * Scene 7. Lady Mai, Olivier Sanchez\n\n\nAKA: Private Gold 91\nDistributor:  Private\nDirector:  X-Off\nReleased:  2007\n\nFormat:     AVI\nDuration:   01.31:12\nSource:     DVDRip\nFormat:     AVI\nVideo codec: XviD\nAudio codec: MPEG Audio (mp3)\nVideo:       XVID 704x336 29.97fps 2065Kbps\nAudio:       MPEG Audio Layer 3 48000Hz stereo 104Kbps\n\n\n\nREVIEW:\n\n\nThe Story:\n\nLady May plays an accomplished DJ, who is on the verge of signing a major distribution deal, but she has a problem . . . she has lost her inspiration and the only way she can regain it is to enter the Hotel Sacrament and pass before seven doors of &quot;sacrament&quot; (but in reality only five). With only a few hours left before her major concert, she has made the decision to go for broke and spin the wheel of destiny and entering the gauntlet of sexual desires!\n\nThe Sex:\n\nScene 1: Lady May and Natalia Zeta\n\nAfter finding the deserted hotel, Lady May rings the bell at the concierge before entering the first door. The cute Filipina gets nice and horny when she decides to get on the red satin sheets. She feels a strange presence in the air as she succumbs to a fantasy where two men with blowdryers get her hot and steamy for her encounter with the sexy demon, Natalia Zeta. Once she awakens from her strange dream, she sees the lovely Spanish beauty Natalia Zeta. This close encounter leads to a brief sapphic session complete with a dual-edge dildo session where both of them get fucked simultaneously.\n\nLady May walks out unscathed by the first encounter, but as she enters the hotel corridor, she gets frightened by the Evil Geishas played by Claudia Rossi and Suzie Diamond. Meanwhile, Mierkoles, Lady May's lesbian lover, pays a visit to her manager and has a brief vocal altercation regarding Lady May's whereabouts.\n\n\nScene 2: Lady May and Suzie Diamond\n\nLady May walks into the next room where she sees a lifeless nude couple covered with plastic. She unravels the plastic and looks at the guy's dick and starts sucking on it, which makes the couple full of life. Suzie Diamond, who's wearing a blonde wig, gets fucked hard doggie style while Lady May watches. After Suzie rides him, Lady May finishes him off with a fervent WET blowjob session. This lovely Pinay gets the job done with great head including deepthroating, which results in a nice facial!\n\nShe awakes in a daze and sees that she's in an abandoned room with no signs of the couple. She picks herself up from her knees and heads to the next room where she sees the tanned Claudia Rossi!\n\n\nScene 3: Lady May and Suzie Diamond\n\nClaudia Rossi begins to play with herself fingering her asshole while her other hand diddles with her pussy. Lady May is turned on by Claudia's ripe ass and so she puts on a strap-on and fucks her from behind. There is genuine heat between the two as Lady May goes to work on her! After the strap-on session, Lady May performs oral sex on her. While this takes place, one of the male demons inserts his member into Lady May's asshole! This is a very hot scene as you can see how just how tight this Filipina's ass. The demon goes back and forth with the anal spelunkering until he spreads his load all over both ladie's ass cheeks.\n\nAgain, Lady May awakens finds herself in a deserted room. Meanwhile, her manager has hired a squad of man to rescue her from the haunted hotel. But, before going there, he has to pay his respects to a mute witch doctor, who performs a ceremony that's supposed to protect them from the evils they will encounter at the hotel.\n\n\nScene 4: Lady May\n\nAt this point, Lady May is slightly cracking under the stress, but still manages to go on to the next room located at the end of the corridor. She's greeted by two demonds dressed up as rabbits, which may appeal to your inner &quot;cosplay&quot; fetish! She immediately strips down and shows off her nice tanned ass before she makes them hard with some devastating fellatio! Soon, the costumes are off and the men take turns fucking her and getting sucked by her. This threesome leads to a very hot double penetration sequence! Then, it continues with one splooging his load off on her face and throat while the other fucks her in the missionary position until he gets off as &quot;super-soaker&quot; cumshot that sprays her abdomen. This is one hot scene proving that she's one hot firecracker!\n\nMeanwhile, her manager and his gun-wielding mercenaries along with the mute witch doctor enter the haunted hotel. Unfortunately, they don't know that they are heading into a deathtrap when the Evil Geishas pick them off one by one. Even with their heavy firepower, they are no match for the rose-petal throwing Evil Geishas. As a result, the manager is the only one that makes it out of the hotel alive. While he's catching his breath, a mysterious man appears who tells her manager that he's going to save Lady May. He walks into the bloodied corridors where the Evil Geishas are waiting to unleash the same terror minutes ago. Unfortunately for them, he also has unearthly powers as he's able to inflict some damage to the Evil Geishas. The Evil Geishas played by Claudia Rossi and Suzie Diamond lure him into a room.\n\n\nScene 5: Claudia Rossi and Suzie Diamond\n\nThe Evil Geishas plan on seducing the mysterious stranger and then kill him. The sex is pretty tame in comparison to the other scenes because there's no anal, but there is good chemistry throughout. After fucking both of the lovely ladies, he unloads his &quot;holy cum&quot; on them, which results in them vanishing into thin air!\n\nWhen he enters the corridor, he's met by the newly-christened Evil Geisha Lady May. At first, he looks like he's about to succumb to Lady May's newly acquired powers, but he's able to get ahold of her from behind and shape-shift the scenery turning the corridor into a bed where he's about to exorcise the demon out of her with some &quot;holy sex!&quot;\n\n\nScene 6: Lady May\n\nHe takes her from behind and starts pumping away initiate exercising the demon out of her. Like the previous scene, this is purely a vaginal scene, but there's a lot intense moments. This leads to fucking in the cowgirl position before the sex returns to the doggie position. It doesn't take too long until the mysterious man cums on her body thereby exorcising the evil spirits that have occupied Lady May. The mysterious hero shapeshifts and reveals her real identity as Mierkoles, Lady May's lover who started all this talk about going to the hotel.\n\nWhen the two ladies walk out of the haunted hotel, they are welcomed by Lady May's manager and henchmen. He asks her to choose whether she wants to be the star that she's been waiting for or whether she'll stay with Mierkoles. Lady May, the astute business lady, decides easily to stick with her manager because she wants the moolah and the glory. Mierkoles does not like this one bit and tells them to leave!\n\n\n\nFinal Thoughts: \nI was really impressed with X-Off's work. The good acting and the great sex combined with the pleasant special effects resulted in a well-executed movie production. The story kept me involved, which is an oddity in the world of porn . . . but it's happened recently with this flick as well as in Tom Herold's &quot;Fucker Takes All.&quot; I like what X-Off brings to PRIVATE and I expect to see more high-quality productions in the future. The pretty Filipina, Lady May, is a little firecracker and she equals or surpasses the sexual arsenal of Priva. I have no qualms giving this a HIGHLY RECOMMEND. \nIs it still early to say that PRIVATE is experiencing a new golden age with the likes of X-Off and Tom Herold at the helm along with PRIVATE's established directors?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n.\n","torrent":{"xt":"urn:btih:c3574596fcf1782c45377173fc5c8ae148ea65ba","amp;dn":"Private+Gold+91+-+Evil+Geishas+Hotel+%282007%2Cxvid%29+-+anal%2C+DP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3574596fcf1782c45377173fc5c8ae148ea65ba","infoHashBuffer":{"type":"Buffer","data":[195,87,69,150,252,241,120,44,69,55,113,115,252,92,138,225,72,234,101,186]},"announce":[],"urlList":[]}}