{"title":"The Weakerthans...Left and Leaving(2000)[ FLAC]","uid":6773316,"size":358004934,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c3dad06b15dec6614d3d0fad4b26d821fc59703d&amp;dn=The+Weakerthans...Left+and+Leaving%282000%29%5B+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":16,"time":1319644476,"description":"[img]http://image.allmusic.com/00/amg/cov200/dre200/e220/e220900ux2w.jpg[/img]\n[color=Beige]Left and Leaving [2000] Sub City Records 646 [/color] \n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1 Everything Must Go\n2 Aside\n3 Watermark\n4 Pamphleteer \n5 This Is a Fire Door Never Leave Open\n6 Without Mythologies\n7 Left and Leaving\n8 Elegy for Elsabet\n9 History to the Defeated\n10 Exiles Among You\n11 My Favorite Chords\n12 Slips and Tangles\n\nThe personal remains the political whichever way you want to cut it. Winnipeg's Weakerthans embody this ethic better than most on their second and long-awaited follow-up to their 1998 debut, Fallow. Splitting from Winnipeg's more punk Propagandhi, John Samson is following a more melodic and introspective path while retaining much of the politics. Constructed of vignettes of precise moments in time and place which manage nonetheless to speak volumes, Left and Leaving deftly mixes social commentary with folk and punk rock. This is an intelligent, literate album, and Samson a wordsmith the likes of Elvis Costello or Ron Sexsmith. There is the nice turn of phrase with the line &quot;I am your pamphleteer&quot; referring as much to an absent loved one as to the listener, and on &quot;Aside,&quot; Samson sings that he relies &quot;a bit too heavily on alcohol and irony.\n&quot; While &quot;Exiles Among You&quot; describes the disposed among us whom we step over and dare not make eye contact with, the album is never heavy-handed, but simply illustrative of another way of life, the path not chosen or hopefully avoided, especially on tunes like &quot;This Is a Fire Door.&quot; Left and Leaving is as well-played an album as it is written. Produced by Ian Blurton, musically Left and Leaving is equal parts agit folk and punk-pop. There are dashes of the Rheostatics, a touch of Bob Mould, and a tasty Neil Young guitar solo on &quot;Elegy for Elsabet.&quot; Coming out of the blue collar city of Winnipeg, the images ring \ntrue, reminding us that in this fevered era of technology, the people who actually produce the stuff consumed remain much as they always have, rarely seen and rarer still heard. \n\ncd ripped by EAC\n\nplease seed\n\n[url]http://dickthespic.org/[/url]\n\n","torrent":{"xt":"urn:btih:c3dad06b15dec6614d3d0fad4b26d821fc59703d","amp;dn":"The+Weakerthans...Left+and+Leaving%282000%29%5B+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3dad06b15dec6614d3d0fad4b26d821fc59703d","infoHashBuffer":{"type":"Buffer","data":[195,218,208,107,21,222,198,97,77,61,15,173,75,38,216,33,252,89,112,61]},"announce":[],"urlList":[]}}