{"title":"Free Translate [MinTRoX]","uid":9432641,"size":606531,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:c420f4d5626526871bb367a9d2320fd480a40783&amp;dn=Free+Translate+%5BMinTRoX%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MinTRoX","files":1,"time":1388835655,"description":"his is an easy and quick free text translator. Suitable for mobiles and tablets.\nIt translates from and to 40 different languages and more, speaking the written words to get the right understanding.\nIf usually is used to translate from Spanish to English and vice versa, it can be used for a lot of different languages too.\nThis app is totally free, but you need an internet connection to receive the information from the translation server.\n\n\nNow the supported languages are:\n(en) English, (es) Spanish, (pt) Portuguese, (de) German, (hu) Hungarian, (ar) Arabic, (id) Indonesian, (bg) Bulgarian, (ca) Catalan, (it) Italian, (cs) Czech, (ja) Japanese, (zh-CHS) Chinese (simp), (lv) Latvian, (zh-CHT) Chinese (trad), (lt) Lithuanian, (ko) Korean, (ms) Malay, (ht) Haitian, (no) Norwegian, (da) Danish, (fa) Persian, (sk) Slovak, (pl) Polish, (sl) Slovenian, (ro) Romanian, (et) Estonian, (ru) Russian, (fi) Finnish, (sv) Swedish, (fr) French, (th) Thai, (el) Greek, (tr) Turkish, (he) Hebrew, (uk) Ukrainian, (hi) Hindi, (ur) Urdu, (mww) Hmong Daw, (vi) Vietnamese, (nl) Dutch.\n\nThis is the first version of this free translate app, therefore it can have some errors, we are grate full if you help us to find them and we try to make it better as soon as possible.\nIn the future translator versions we will add of can read text from the webcam, listen it trough the microphone and others features.\nWe have added an icon with a shortcut to a useful internet explorer browser to bring you a better online experience.\nIf the translator like you, we thank if you can give us a good rating to get better.\nThank you very much for using our translator!\n\nSize : 630k (After Installation)\nCurrent Version : 5.0\nRequires Android : 2.2 and up\n","torrent":{"xt":"urn:btih:c420f4d5626526871bb367a9d2320fd480a40783","amp;dn":"Free+Translate+%5BMinTRoX%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c420f4d5626526871bb367a9d2320fd480a40783","infoHashBuffer":{"type":"Buffer","data":[196,32,244,213,98,101,38,135,27,179,103,169,210,50,15,212,128,164,7,131]},"announce":[],"urlList":[]}}