{"title":"The Northern Pikes - It's A Good Life 2003 [FLAC]  Kitlope","uid":6607171,"size":242533940,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c474171148008fde2d1f319fd748e846ff7f355e&amp;dn=The+Northern+Pikes+-+It%5C%27s+A+Good+Life+2003+%5BFLAC%5D++Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kitlope","files":14,"time":1313446383,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 1 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: C474171148008FDE2D1F319FD748E846FF7F355E\nFile Size: 231.29 MB\nYear: 2003\nLabel: Independent\nCatalog #: no catalog\n\n\n\n\nI just recently found this album and I had already just upped the discography so I'll make this a separate torrent. Look for the Northern Pikes discography in FLAC for all their other releases. Here's a couple of links to help:\n\n\nDemonoid:\n\n\n\nThe Pirate Bay: http://thepiratebay.se/torrent/6483620/The_Northern_Pikes_-_Discography_and_Solo_[FLAC]_-_Kitlope\n\n\n\n\nEnjoy!\n\n\nKit \n\n\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nThe Northern Pikes are a Canadian rock band formed in Saskatoon, Saskatchewan in 1984. The original members were Bryan Potvin, Jay Semko, Merl Bryck and Glen Hollingshead. Hollingshead left the band in 1985, and was replaced by Don Schmid in 1986. The band was active until 1993 and subsequently reunited in 1999.\n\nThe Northern Pikes released two independent EPs before being signed to Virgin Records in 1986, &quot;The Northern Pikes&quot; (1984) and &quot;Scene in North America&quot; (1985). Their first album for the label, Big Blue Sky, included the Semko-penned &quot;Teenland&quot;, the band's first significant hit. The follow-up album Secrets of the Alibi contained two more minor Canadian hits, &quot;Wait for Me&quot; and &quot;Let's Pretend&quot; (both by Semko), as well as the slightly bigger hit &quot;Hope Go Astray&quot;, written by Potvin.\n\nTheir 1990 album, Snow in June became their biggest seller in Canada and the US. That album's lead single, &quot;She Ain't Pretty&quot;, was the band's biggest hit, and was written by Potvin. An innovative music video for that song received heavy play on MuchMusic and was nominated for a Juno Award. Overall, the band has been nominated for 5 Juno Awards, but have yet to record a win.\n\nIn 1992, the band released Neptune. The album's biggest hit, &quot;Believe&quot;, was again written by Potvin. After touring to support the album, they announced their retirement as a group in July 1993.\n\nIn 1999, Virgin Records asked the band members for their input on a &quot;greatest hits&quot; package. The band decided to do a short promotional tour following the release of Hits and Assorted Secrets 1984-1993, but found themselves enjoying the more relaxed independence of making their own schedule that they continued touring. They have since released three independent albums, including Truest Inspiration (2001) and It's a Good Life (2003), as well as the aptly titled Live (2000).\n\nIn 2005, the band struck up a musical collaboration with Les Stroud. Throughout 2005 and 2006 they performed together live several times, but a promised collaborative album never materialized.[1]\n\nIn 2006, the band was expected to release a hybrid collection of songs from Truest Inspiration and It's a Good Life under the name Beautiful Music. It was to include a bonus DVD of footage from the recording of Truest Inspiration and some promo clips from It's a Good Life. However, this has yet to see the light of day.[2]\n\nBryck left the band in 2007, and long-time auxiliary keyboard player Ross Nykiforuk was promoted to full membership in his stead. The band's website currently promises a new studio release for 2012.\n\n\n\n\n\nIt's A Good Life 2003\n\n\nIt's A Good Life is the seventh studio album by The Northern Pikes released in 2003. Like their previous studio album, it was released independently.\n\nThe first single from the album was &quot;It's a Good Life&quot; in 2003, followed by &quot;Underwater&quot; in 2004. A promotional video was also made for &quot;Underwater&quot;, the band's first since &quot;Everything&quot; in 1993.\n\nThe album ends with the song &quot;Blame The Song&quot; which is a tongue-in-cheek tune about the power of a hit song. Not only is the song credited to all four members of the band (a rarity for them), but the lyrics refer to the specific band members in the second last verse (sung by Bryan Potvin): &quot;Jay and Merl drinkin' margaritas/Donnie's in the kitchen cookin' chicken fajitas/I'm sittin' here swattin' West Nile mosquitos/Blame the Song&quot; and the final verse refers specifically to their career: &quot;The Things I Do For Money/I'll never understand/Why I'm 40 years old and still playin' in this band/I guess it's got somethin' to do with 'Teenland'/Blame the Song&quot;. The band's first hit in Canada was &quot;Teenland&quot; which was followed by another hit called &quot;The Things I Do For Money&quot;.\n\n\nTracks: \n\n\n1.\t&quot;It's A Good Life&quot; (Jay Semko)\n2.\t&quot;Don't Hate Me&quot; (Bryan Potvin)\n3.\t&quot;Underwater&quot; (Merl Bryck)\n4.\t&quot;Foolish Pride&quot; (Potvin)\n5.\t&quot;End Of Our Year&quot; (Bryck, Potvin,Semko)\n6.\t&quot;Dandelions&quot; (Semko)\n7.\t&quot;Innocence Hides From You&quot; (Potvin)\n8.\t&quot;Tomorrow&quot; (Semko)\n9.\t&quot;Swim Into The Rhythm&quot; (Bryck)\n10.\t&quot;Blame The Song&quot; (Bryck, Potvin,Schmid, Semko)\n\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:c474171148008fde2d1f319fd748e846ff7f355e","amp;dn":"The+Northern+Pikes+-+It%5C%27s+A+Good+Life+2003+%5BFLAC%5D++Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c474171148008fde2d1f319fd748e846ff7f355e","infoHashBuffer":{"type":"Buffer","data":[196,116,23,17,72,0,143,222,45,31,49,159,215,72,232,70,255,127,53,94]},"announce":[],"urlList":[]}}