{"title":"Irenicon by Aidan Harte (The Wave Trilogy #1)","uid":10047035,"size":1666927,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c48895d9a4e7c1eef657aa74a76090667f16aea4&amp;dn=Irenicon+by+Aidan+Harte+%28The+Wave+Trilogy+%231%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":2,"time":1398548461,"description":"\nThe river Irenicon was blasted through the middle of Rasenna in 1347 and now it is a permanent reminder to the feuding factions that nothing can stand in the way of the Concordian Empire. The artificial river, created overnight by Concordian engineers using the Wave, runs uphill. \n\nBut the Wave is both weapon and mystery; not even the Concordians know how the river became conscious - and hostile. But times are changing. Concordian engineer Captain Giovanni is ordered to bridge the Irenicon - not to reunite the sundered city, but to aid Concord's mighty armies, for the engineers have their sights set firmly on world domination and Rasenna is in their way. Sofia Scaglieri will soon be seventeen, when she will become Contessa of Rasenna, but her inheritance is tainted: she can see no way of stopping the ancient culture of vendetta which divides her city. \n\nWhat she can't understand is why Giovanni is trying so hard to stop the feuding, or why he is prepared to risk his life, not just with her people, but also with the lethal water spirits - the buio - that infest the Irenicon. Times are changing. And only the young Contessa and the enemy engineer Giovanni understand they have to change too, if they are to survive the coming devastation - for Concord is about to unleash the Wave again...\n\nGenre: Fantasy","torrent":{"xt":"urn:btih:c48895d9a4e7c1eef657aa74a76090667f16aea4","amp;dn":"Irenicon+by+Aidan+Harte+%28The+Wave+Trilogy+%231%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c48895d9a4e7c1eef657aa74a76090667f16aea4","infoHashBuffer":{"type":"Buffer","data":[196,136,149,217,164,231,193,238,246,87,170,116,167,96,144,102,127,22,174,164]},"announce":[],"urlList":[]}}