{"title":"Mermaid in a Manhole (Gineau Pig 4)","uid":4813635,"size":522111023,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c4b8e378ee3e42364b2a895c7bed25caf2dd8936&amp;dn=Mermaid+in+a+Manhole+%28Gineau+Pig+4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FatFuckFrank","files":2,"time":1238467908,"description":"The Guinea Pig series is one of the most infamous examples of what is seen as the depraved nature of Japanese popular culture.\n\nThe tapes gained notoriety in Japan during the late 1980s and early 1990s when the first five films of the series were found showcased in the 5,763 videotape collection of Japanese serial killer Tsutomu Miyazaki, who reportedly re-enacted scenes from the films as a part of his crimes. Because of the constant controversy surrounding the series, it has now been deemed illegal in Japan to produce any movies with the &quot;Guinea Pig&quot; label.\n\nThe story concerns a painter whose wife has recently left him. He devotes all his time and attention to his art, venturing into the sewers beneath his house in search of inspiration for his paintings, which all depict scenes of decay and disease. Once this sewer was a river, where the painter played as a child and where he once believed to have seen a mermaid. On one of his treks he realises his beliefs were right when he finds the mermaid, trapped in the stinking sewer. When the river ran dry, she explains, she was unable to get back to sea and hid in the sewer system. Her skin badly infected by waste and pollution after years of living in the sewer, she begs the painter to help her. He decides to take her to his house, where he puts her in his bathtub and proceeds to paint her.\n\nHer condition worsens and after a while festering sores start erupting all over her body. Though both of them know death is inevitable, the mermaid asks the artist to document her decay in his painting. This he does and the bond between the two grows stronger as her situation deteriorates. When the sores increase, he adjusts his portrait accordingly, even when the infection turns into a grotesque mutation that covers her entire body. When he fails to find the right paint to truthfully depict the colours of her infections, she tells him to slice open the boils with a razor blade and use the abundantly flowing puss instead.\n\nThe Mermaid in the Manhole is a perverted fairy tale\n\n[img]http://www.mandiapple.com/snowblood/images/mermaid/dyouneedaplaster.jpg[/img]\n\n[img]http://www.mandiapple.com/snowblood/images/mermaid/bath.jpg[/img]\n[img]http://www.mandiapple.com/snowblood/images/mermaid/6thformartproj.jpg[/img]\n[img]http://www.mandiapple.com/snowblood/images/mermaid/roygbiv.jpg[/img]\n\n\n\nwww.fatfuckfrank.org","torrent":{"xt":"urn:btih:c4b8e378ee3e42364b2a895c7bed25caf2dd8936","amp;dn":"Mermaid+in+a+Manhole+%28Gineau+Pig+4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4b8e378ee3e42364b2a895c7bed25caf2dd8936","infoHashBuffer":{"type":"Buffer","data":[196,184,227,120,238,62,66,54,75,42,137,92,123,237,37,202,242,221,137,54]},"announce":[],"urlList":[]}}