{"title":"Noctropolis","uid":6907715,"size":271524438,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c59f128aaf349da439fd09c52a2608628dae2064&amp;dn=Noctropolis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"esharoth","files":3,"time":1324661028,"description":"Title: Noctropolis\nGenre: adventure / point&amp;click / 3rd-person\nReleased: 1994\nDeveloper: Flashpoint Productions\nPublisher: Electronic Arts\nDescription:\nPeter Grey is a lonely bookstore owner who also happens to be a huge fan of the &quot;Darksheer&quot; comic book series. Darksheer is a Batman-esque superhero: one who doesn't have any actual superpowers, triumphing over evil thanks to his inventiveness and courage. Together with his partner Stiletto, a former supervillain converted to the side of the good guys, he is the sworn protector of Noctropolis, a city where it's always nighttime because of a permanent ash cloud that hangs over it, the result of a volcanic environmental catastrophe which occurred decades before.\n\nOne night, as Peter is leafing through the newest issue of &quot;Darksheer&quot; to hit the stands, a courier brings him a package which eventually transports him into the city of Noctropolis, where he has to take the role of Darksheer himself. Coincidentally enough, his arrival as Darksheer occurs at the same time as five of the superhero's deadliest arch-villains decide to gang up on him after they are mysteriously released from incarceration. It turns out that the real Darksheer had disappeared several weeks prior to Peter's arrival. It's up to the unlikely hero to find out who released the criminals, while simultaneously trying to keep them from wreaking havoc across the city of Noctropolis - and maybe, in the process, find a way back to the real world.\n\nBonus content: artworks, comic, install guide, manual, soundtrack.\n\nHow to play:\n1) Download the game;\n2) Mount or burn disc image;\n3) Run setup.exe to install (it will start automatically if you have autorun enabled);\n4) Play the game without the disc using the desktop or start menu shortcuts.\n\n! Notice\nThe install guide included in the Bonus Content.zip archive is a copy of the document that came with the original game. It is severely outdated and has no relevance to how you install the game on modern PCs.","torrent":{"xt":"urn:btih:c59f128aaf349da439fd09c52a2608628dae2064","amp;dn":"Noctropolis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c59f128aaf349da439fd09c52a2608628dae2064","infoHashBuffer":{"type":"Buffer","data":[197,159,18,138,175,52,157,164,57,253,9,197,42,38,8,98,141,174,32,100]},"announce":[],"urlList":[]}}