{"title":"All Angels - Starlight EP (2010)","uid":6601020,"size":45591000,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c5acc8e2cd3755b25e387342dd2daafe1079872b&amp;dn=All+Angels+-+Starlight+EP+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"piratetorrent1989","files":5,"time":1313212209,"description":"All Angels are a British/Maltese classical crossover group formed in 2006, consisting of Daisy Chute, Rachel Fabri, Melanie Nakhla and Charlotte Ritchie The group's style is classical crossover music and close harmony arrangement, with a repertoire spanning classical, choral, opera and pop including Franz Schubert's Ellens dritter Gesang, Agnus Dei (the choral arrangement of Samuel Barber's Adagio for Strings) and the Sancta Maria intermezzo from Pietro Mascagni's Cavalleria rusticana, along with the Flower Duet from LÃƒÂ©o Delibes' LakmÃƒÂ© and the Barcarolle from Jacques Offenbach's The Tales of Hoffmann, plus pop songs such as Robbie Williams' Angels, Fleetwood Mac's Songbird, Coldplay's The Scientist, True Colours, Goodnight my Angel (Billy Joel) Muses' Starlight and Prince's Nothing Compares 2 U. They have also performed the National Anthem at Twickenham and at the England vs. USA football match in Wembley Stadium in the summer of 2008.\nThey recorded their first three albums with Universal and have over 1 million sales. Their self-titled debut album, All Angels was released in 2006, and their second album, Into Paradise was released on 26 November 2007. A third album Fly away was released in January 2010. Songs on this album include Norah Jones's Come Away With Me, Send In The Clowns, Bob Dylan's Blowin' In The Wind, Eric Whitacre's Sleep, and a duet with The Harlem Gospel Choir on I'll Fly Away. They have sold over 1,000,000 albums to date. All Angels are managed by TCB Group.\nThey undertook a UK tour supporting Katherine Jenkins in Summer 2009 and completed an arena tour later that year with Young Voices.","torrent":{"xt":"urn:btih:c5acc8e2cd3755b25e387342dd2daafe1079872b","amp;dn":"All+Angels+-+Starlight+EP+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5acc8e2cd3755b25e387342dd2daafe1079872b","infoHashBuffer":{"type":"Buffer","data":[197,172,200,226,205,55,85,178,94,56,115,66,221,45,170,254,16,121,135,43]},"announce":[],"urlList":[]}}