{"title":"Ultimate Dreams (1998) XXX DVDRip","uid":12158529,"size":708614190,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c64fe876dcc431cee09cbfa421b7a1e77cbdc712&amp;dn=Ultimate+Dreams+%281998%29+XXX+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Ctrlme","files":3,"time":1437831607,"description":"Ultimate Dreams (1998) XXX DVDRip\n-----------------------------------------\nScreenshot(s):   &lt;a href=&quot;\nhttp://imgctrl.com/image/CUT&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/CUT&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/CUV&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/CUV&lt;/a&gt;\n\nResolution: 448x320\nDuration:81 min\nAvg Bitraye: 1160 kb/s\n\nIn Jim Power's Filth we met the jaded, cynical and sexually depraved millionaire movie producer Johnathan Morgan. In this scorching prequel we get to see how Mr. Morgan got that way. Morgan is married to Tabitha Stevens. Eventually, the marriage becomes a sexual test of wills, and Jonathan, ultimately suffers deeply. The closing scene with Tabitha, Shayla LaVeaux and Alex Sanders is incredibly hot, featuring Steven's first-ever on-screen backdoor session, but it also seals the doom of the marriage. Well-wrought psycho-drama with a blazing sexual lineup.\n\nPretty blonde Tabitha opens, walking along the water at the beach. She is reflecting on her life. She is married to a big time Hollywood director, but can't shake the incomplete feeling she has. As she strolls across the sand, Tabitha remembers her first time with Richard. Thankfully, we get to travel back in her memories to witness the occasion. Richard (Jonathan Morgan) takes her in his arms and caresses her body through her sexy lingerie. There is plenty of kissing and touching here as it takes several minutes before Morgan even lies his bride down. Follow that with a generous helping of pussy eating and have a scene that may actually have women still interested. Tabitha rewards Jonathan and all the male viewers by giving him a super blowjob. That beautiful face is a great start, and the way she uses a lot of tongue (and what a tongue it is.) to slick up his shaft is porn perfection. We get a very nice insertion show while she lowers herself down for some reverse cowgirl, followed by some spirited fucking. After taking a deep pounding doggy style, Tabitha lies on her back to take it mish for a while. You have to love the great facial expressions as Jonathan gives her everything he's got, filling her shaved pussy with prick. She uses some great dirty dialog to coax Morgan to fire his load towards her pretty face. Most of it misses the mark and ends up on her neck, but Tabitha rubs his cock all over her mouth, licking the last drops off his head.\n\nLater that night, Tabitha dreams of a beautiful mystery woman, Shayla LaVeaux. Before fans of hot lesbian sex unzip and whip it out, be warned, this is just a tease. Just as things start to heat up on the butcher block, Tabitha wakes up from her hot dream. (Damn, I hate when that happens.)\n\nTabitha's husband has his own way to escape his everyday life. He works on the script for his new film and with some help, creates a hot three way for Tatiana and a pair of studs. After they bounce her around the would be plot of their movie, she lands in a frat house, looking smashing. The two jocks decide to show her some special plays, and the next thing she knows, there is a cock in her mouth and one in her pussy. (Honest, I don't know how it happened, I just blinked and his dick was in me....) Tatiana handles a pair of cocks like it's no problem at all and looks great the whole time. One at a time, the guys fuck her in mish, making those wonderfully real tits shake all over the place. After a long, nicely paced three way, the guys blast off on her chest.\n\nTabitha is still not satisfied. She wants her life to be more like the scripts Jonathan writes. Of course, he is doing more than writing, actually getting involved in some wild adventures of his own. With the help of buddy John Decker, he gets into some serious four way sex with Shayla and Cristie Lake. No offense to Cristie, but pairing her in a scene with Shayla really isn't fair. No matter how hard she tires, with her high energy sex, Cristie just can't steal the spotlight from her gorgeous costar. Shayla takes center stage the moment she takes a dick in her mouth and doesn't relinquish it for even a moment until that gorgeous face of hers gets covered in spunk.\n\nMorgan is still working on the script, and has his lead character taken to a sex club. Although we are presented a well shot, MTV style orgy, I have to admit I was personally bored by the whole thing. Sure, Kiss and Lovette have a few good sexual moments, but there was just too much going on to enjoy anything much. Compared to the other scenes in this video, this is pretty much a waste of tape.\n\nTabitha is still lost in her fantasy world, and that goodness for that. She is led naked to a room where, a rubber clad Nici Sterling is servicing Wilde Oscar and Mickey G. From the second Nici gets on her knees, there is no doubt that this is going to be the very best scene in the video. Nici looks so good taking both dicks in her mouth it's a wonder they don't pop wads right then and there. Instead, while Tabitha looks on, playing with her own sweet slit, Nici gets her honey pot filled with prick. The guys take turns, one fucking, the other being sucked for a while, before Nici lowers her body down for some reverse cowgirl anal that will blow that layer of dust right off your TV screen. Great close ups during the anal, but Nici isn't happy until both cocks are in her body at once, giving us some scorching DP. The only to cap of a scene like this if for Nici to take a super double does of protein based face cream. Yep, the best thing in the movie for sure.\n\nThe final scene comes with Tabitha masturbating in the bathtub. It's a nice way to close things out, and leads perfectly to the happy ending for Tabitha. She finally gets to be with Shayla and that means we get a pair of hot blondes double teaming Alex Sanders. Watching them share his cock in their mouths is quite hot stuff and Tabitha is able to hold her own with Shayla in a way that I would not have thought possible. After sampling both pussies, Alex slaps on a condom and gives Tabitha some gentle anal probing. The girls share the facial and everyone lives happily ever after.\n\n   Ctlme Ultra Fast Speeds / SpeedTest Proof\n----------------------------------------------- &lt;a href=&quot;\nhttp://www.speedtest.net/result/4529516639.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.speedtest.net/result/4529516639.png&lt;/a&gt;","torrent":{"xt":"urn:btih:c64fe876dcc431cee09cbfa421b7a1e77cbdc712","amp;dn":"Ultimate+Dreams+%281998%29+XXX+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c64fe876dcc431cee09cbfa421b7a1e77cbdc712","infoHashBuffer":{"type":"Buffer","data":[198,79,232,118,220,196,49,206,224,156,191,164,33,183,161,231,124,189,199,18]},"announce":[],"urlList":[]}}