{"title":"Four.Corners.In.Google.We.Trust.288p.LDTV.WEBRIP.[MPup]","uid":12978492,"size":151138507,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c6c11072823c853f664da2918c6f5f9f6ca1303a&amp;dn=Four.Corners.In.Google.We.Trust.288p.LDTV.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"makinapufterpup","files":1,"time":1450011796,"description":"Four.Corners.2013.09.09.In.Google.We.Trust.288p.LDTV.WEBRIP.[MPup]\r\nLow-Definition Television (LDTV) ABC iview WEBRIP: 640x360\r\n\r\nFormat: MPEG-4\r\nSize: 512x288 (with vertical black bars)\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 44.1 KHz\r\n\r\nEvery hour of every day, our digital interactions are being recorded and logged. We live in the age of 'big data', where seemingly mundane information about how we go about our lives has enormous value.\r\n\r\n[img]http://extraimago.com/images/2015/12/13/86cbbe4d96818d0bc0b3669dce8fb702.jpg[/img]\r\n\r\nNext on Four Corners, with the help of expert data trackers, we follow the information trail of an ordinary Australian family. We follow their data over a typical day, watching as it is surreptitiously recorded by government agencies and private organisations.\r\n\r\nWho gathers the information, what are they doing with it and what are your legal rights?\r\n\r\nThe internet has brought us conveniences once unimaginable. You can shop online, diagnose illnesses, and send 'selfies' whenever you want. But it isn't all one way traffic. Every time you use a search engine like Google, or access an 'app' on your smartphone, your activity is logged by companies around the world - many you've never even heard of.\r\n\r\nThat sometimes intensely personal data is either used or sold to make money.\r\n\r\nAt one level this could be to your advantage. Marketing and advertising is ever more accurately tailored to your wants and needs.\r\n\r\n&quot;The sort of products you're buying can tell a marketer an awful lot about what else you're likely to buy, you know, what model of car you're likely to buy, the political party you're likely to vote for, you know, what sort of job you're likely to have.&quot; John Ostler, Data Marketer\r\n\r\nBut where does it end, and what are the consequences? Is your information secure? Not always, Four Corners reveals.\r\n\r\nIf your user patterns are valuable and being sold on the open market, should you have a say in it? Should you be told who your data is going to, and exactly how it is being used? If your data is being matched with other data for more valuable results, should you be informed?\r\n\r\nFour Corners' investigation reveals that not only are we being tracked online by marketers but Australia's own government agencies are secretly monitoring our digital travels.\r\n\r\nOn the road, devices in your car are being logged to register your movements.\r\n\r\nWhen you pass by a police car you will be surprised to discover what modern technology is discovering about you.\r\n\r\nThis kind of information is already being used in court cases, but public officials can access your data without a warrant and without your knowledge:\r\n\r\n&quot;That is one of the areas of law reform that we have to, I think, take the greatest interest in. Which agencies can access this material? What can they do with it? And where on earth are the courts… where's the legal oversight that applies to a regular search warrant?&quot; Scott Ludlam, Greens Senator\r\n\r\nThe digital detectives are in shopping centres too, where your movements can be tracked to provide a physical profile of where you go and what you do. Millions of Australians hold supermarket loyalty cards. The data you give away to get them is now being cross-referenced with data from banks to better predict your behaviour.\r\n\r\nCompanies like Google andknow more about you than your family or your best friends. How did we get to this point and should we care?\r\n\r\nNo political party has ever explicitly sought your permission for this to happen.\r\n\r\nIt is a situation that alarms many experts:\r\n\r\n&quot;I don't think any social system, any government, can survive knowing everything about its citizens without ultimately that being corrupted.&quot; Danny O'Brien, Privacy Advocate","torrent":{"xt":"urn:btih:c6c11072823c853f664da2918c6f5f9f6ca1303a","amp;dn":"Four.Corners.In.Google.We.Trust.288p.LDTV.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6c11072823c853f664da2918c6f5f9f6ca1303a","infoHashBuffer":{"type":"Buffer","data":[198,193,16,114,130,60,133,63,102,77,162,145,140,111,95,159,108,161,48,58]},"announce":[],"urlList":[]}}