{"title":"Kylesa - Ultraviolet (2013) [FLAC]","uid":8535872,"size":273807403,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c6f631e5c061c25f304dca7c0158c103dcddd8e0&amp;dn=Kylesa+-+Ultraviolet+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1370268796,"description":"\n  Kylesa - Ultraviolet (2013) [FLAC]\n\n  Released: 2013\n  Duration: 38:52\n  Genre: Pop/Rock\n  Style: Heavy Metal\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Exhale \n  02 Unspoken\n  03 Grounded \n  04 We're Taking This \n  05 Long Gone \n  06 What Does It Take \n  07 Steady Breakdown\n  08 Low Tide\n  09 Vulture's Landing \n  10 Quicksand \n  11 Drifting \n\n  Giving the powerfully thick sludge of their earlier work, when Kylesa released the stunningly psychedelic Spiral Shadow in 2010, it was evident that the band had tapped into something powerful. On their sixth album, Ultraviolet, it's clear the band are still channeling the same mind-expanding cosmic energies that helped to make their last album such a revelation. With a sound that's not only spacy but spacious, Kylesa continue to push their sound into the stratosphere, opting for atmosphere where they once would have erected a monumental wall of murky guitars. While it would be easy to see this change as the band reining in their sound, it's probably more appropriate to say that they've tamed it so as to make better use of its monumental power rather than just letting it thrash about destroying things. \n\n  More incredible than the band's heady transformation, however, is that they've managed to come through it without losing a lot of the heaviness that put them on the map in the first place. Sure, there's not an unending torrent of sludge coming down the pipe anymore, but the focus shown on Ultraviolet really shows off Kylesa's newfound ability to deliver power with purpose, making the heavier moments of songs like &quot;We're Taking This&quot; and &quot;Steady Breakdown&quot; feel even heavier when played against their more psychedelic passages. With such a layered and melodic sound, Ultraviolet represents a further refinement of the new direction they've been heading in, making it not only the bands most accessible work to date, but also their most purposefully written and solidly constructed, putting it in the running for the best album of their career.","torrent":{"xt":"urn:btih:c6f631e5c061c25f304dca7c0158c103dcddd8e0","amp;dn":"Kylesa+-+Ultraviolet+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6f631e5c061c25f304dca7c0158c103dcddd8e0","infoHashBuffer":{"type":"Buffer","data":[198,246,49,229,192,97,194,95,48,77,202,124,1,88,193,3,220,221,216,224]},"announce":[],"urlList":[]}}