{"title":"The Chevelles - Rollerball Candy (1995)","uid":6877505,"size":401800052,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c83242c8d7f33d39df4bf655b79e8f17d1220f66&amp;dn=The+Chevelles+-+Rollerball+Candy+%281995%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1323512091,"description":"Rollerball Candy was released by Running Circle in early 1995. The album was more varied than Gigantic taking in elements of punk &quot;Delirium&quot; through to melodic ballad &quot;Fall&quot;. At 15 tracks in total it was a longish album for a pop group but in essence was tailor-made for Spanish rock n roll fans which perfectly suited Running Circle.\nInitial sales of the record in Spain and Portugal were encouraging. Running Circle had a large network of contacts in both countries and therefore could be bought throughout the country. Response from Spanish press and radio was excellent. The record received strong reviews in established Spanish rock zines like Ruta 66, Beaten Generation and La Musica where the band were compared to DM3 and The Dubrovniks.\nThe sales and promotion of Rollerball Candy was more slower in Australia, with no formal distribution the band relied on sales at shows and a handful of Perth and eastern states record stores. With no one working for the band in the eastern states many fans of the band in places like Sydney and Melbourne were unaware that Rollerball Candy had even been released. It had also become apparent that Running Circles worldwide distribution campaign was floundering. There was no evidence that the disc had was being distributed outside of Spain and no promotion to support any distribution.","torrent":{"xt":"urn:btih:c83242c8d7f33d39df4bf655b79e8f17d1220f66","amp;dn":"The+Chevelles+-+Rollerball+Candy+%281995%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c83242c8d7f33d39df4bf655b79e8f17d1220f66","infoHashBuffer":{"type":"Buffer","data":[200,50,66,200,215,243,61,57,223,75,246,85,183,158,143,23,209,34,15,102]},"announce":[],"urlList":[]}}