{"title":"Process_Lasso_Pro_5.1.1.2_Final.rar","uid":7437120,"size":4741493,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c84a5061900ae491c63a8524a2dd6dc1b2bb6405&amp;dn=Process_Lasso_Pro_5.1.1.2_Final.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cowboy1966","files":1,"time":1342114320,"description":"\nBitsum Technologies Process Lasso Pro 5.1.1.2 Final (x86/x64) | 4.5 MB\n\n\nProcess Lasso is a unique new technology that will, amongst other things, improve your PC's responsiveness and stability. Windows, by design, allows programs to monopolize your CPU without restraint -- leading to freezes and hangs. Process Lasso's ProBalance (Process Balance) technology intelligently adjusts the priority of running programs so that badly behaved or overly active processes won't interfere with your ability to use the computer!\n \n\nProcess Lasso also offers an assortment of ways to take full control of how your CPUs are allocated to running programs. You can choose at what priority processes should run, and which CPUs (cores) should be assigned to them. You can also disallow certain programs from running, log all programs run, and so much more (see list below).\n \nOnce you install Process Lasso, it'll just start working. More advanced users can tweak the configuration, but you needn't touch anything to have it instantly improve your system responsiveness and prevent stalls in high load situations.\n \nFor network admins, Proces Lasso works wonderfully on Terminal Servers and in multi-user environments. We have many clients that have been using Process Lasso on their Terminal Servers for years.\n \nBest of all, Process Lasso is written in native C++, not .NET. This means it consumes very few system resources - considerably less than any similar software.\n \nProcess Lasso Features\n Prevent processes from monopolozing the CPU(s)\n ProBalance dynamic priority optimization\n CPU throttling (new)\n Save process priorities for future instances\n Save process CPU affin\n \nVersion 5 -- jump to post-release changes\n \n* New Process Watchdog feature (restart, terminate, or change affinity if process if exceeds X CPU or VM usage)\n * Improved integration with Vista and Windows 7 - start elevated (high rights) without any UAC elevation prompts\n * Better support for multi-user environments\n * Faster GUI open from system tray\n * Better GUI support for systems with up to 32 CPUs\n * Ability to override hard-coded ProBalance exclusions\n * Even MORE multi-threaded than before\n * Even more intelligent and efficient core engine\n * Substantially improved system tray balloon tips with event grouping and more (disabled by default)\n * New process restraint history (and current status) column in GUI\n * New inter-process communication framework handles all communication between instance(s) of the core engine and GUI\n * New, simpler licensing system using activation codes\n * No more timed nag screen (single screen, click Skip)\n \nHome Page - http://bitsum.com/index.php","torrent":{"xt":"urn:btih:c84a5061900ae491c63a8524a2dd6dc1b2bb6405","amp;dn":"Process_Lasso_Pro_5.1.1.2_Final.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c84a5061900ae491c63a8524a2dd6dc1b2bb6405","infoHashBuffer":{"type":"Buffer","data":[200,74,80,97,144,10,228,145,198,58,133,36,162,221,109,193,178,187,100,5]},"announce":[],"urlList":[]}}