{"title":"Coast to Coast Am May 24, 2013 - UFO and ET Disclosure","uid":8510531,"size":56675740,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c9c79912c931e6096abdd6a5f111211c18cb823b&amp;dn=Coast+to+Coast+Am+May+24%2C+2013+-+UFO+and+ET+Disclosure&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1369568666,"description":"Note: These are the MP3 files provided by Coast to Coast AM's website. I am curious to see which format people enjoy better. Do you like the previous bumper music version? Or would you rather have it as the original mp3s. Let me know in the comments please! \nSo far, MP3 version wins!\n\nCurtecy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\nDate:\n05-24-13\nHost:\nGeorge Knapp\nGuests:\nStephen  Bassett,                   Open  Lines\nFilling in for George Noory, George Knapp welcomed UFO disclosure activist, Stephen Bassett, for a discussion on the Citizen Hearing on Disclosure and how close we are from finally being told the truth about extraterrestrials engaging the planet. He praised the amount of positive press the hearing generated, noting in particular a piece in The New York Times. Bassett said he hoped coverage of the annual event would create a chain reaction, stirring newspapers to dig deeper into the issue and perhaps even triggering a Congressional hearing. The historically low approval ratings for Congress might be substantially improved if they honestly looked into the events and evidence, he suggested. \nBassett stated unequivocally that he thinks the collective body of proof clearly points to an extraterrestrial intelligence behind UFO-related sightings. Phenomena such as unknown craft traveling at 10,000-15,000 mph in the 1940s and numerous encounters with alien-looking beings simply cannot be explained by human activity, he proposed. There have been over one million written accounts over the last 25 years of direct interaction with extraterrestrials, he noted. In addition, Bassett believes there is technology within military black programs that has been derived directly from alien technology. He also commented on several witness accounts presented at the hearing, including a gripping deathbed video testimony by an alleged former CIA official. Filmmaker Jeremy Corbell, appearing briefly in the third hour, spoke about the 15-minute clip in which the anonymous agent talks about his experiences dealing with aliens, their craft and a government cover-up.  \nThe remainder of the program was devoted to Open Lines.\nWebsite(s):\n paradigmresearchgroup.org\n citizenhearing.org\n","torrent":{"xt":"urn:btih:c9c79912c931e6096abdd6a5f111211c18cb823b","amp;dn":"Coast+to+Coast+Am+May+24%2C+2013+-+UFO+and+ET+Disclosure","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9c79912c931e6096abdd6a5f111211c18cb823b","infoHashBuffer":{"type":"Buffer","data":[201,199,153,18,201,49,230,9,106,189,214,165,241,17,33,28,24,203,130,59]},"announce":[],"urlList":[]}}