{"title":"The Poetics of Grammar and the Metaphysics of Sound and Sign","uid":4735037,"size":3979435,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca43b5ca3cb194800b2998ab55cff0e09f42db98&amp;dn=The+Poetics+of+Grammar+and+the+Metaphysics+of+Sound+and+Sign&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"VasiaZozulia","files":-1,"time":1235238498,"description":"This book examines the seemingly universal notion of a grammatical cosmos. Individual essays discuss how many of the great civilizations provide cognitive maps that emerge from a metaphysical linguistics in which sounds, syllables and other signs form the constructive elements of reality. The essays address cross-cultural issues such as: Why does grammar serve as a template in these cultures? How are such templates culturally contoured? To what end are they applied - i.e., what can one do with grammar - , and how does it work upon the world? The book is divided into three sections that deal with the metaphysics of linguistic creation; practices of encoding and decoding as a means of deciphering reality; and language in the widest sense as a medium for self- and cultural transformation. Contributors include: Jan Assman, Sara Sviri, Michael Stone, M. Finkelberg, Yigal Bronner, Martin Kern, Brouria Bitton-Ashkelony, Dan Martin, Jonathan Garb, Tom Hunter, David Shulman, and Sergio La Porta. ","torrent":{"xt":"urn:btih:ca43b5ca3cb194800b2998ab55cff0e09f42db98","amp;dn":"The+Poetics+of+Grammar+and+the+Metaphysics+of+Sound+and+Sign","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca43b5ca3cb194800b2998ab55cff0e09f42db98","infoHashBuffer":{"type":"Buffer","data":[202,67,181,202,60,177,148,128,11,41,152,171,85,207,240,224,159,66,219,152]},"announce":[],"urlList":[]}}