{"title":"Zoom Player MAX 9.0.2 + Patch RCG","uid":10063680,"size":15381469,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cac1877820d7f2c54419fcd52d3c413dfc97e0dc&amp;dn=Zoom+Player+MAX+9.0.2+%2B+Patch+RCG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flau_bert","files":-1,"time":1398772639,"description":"================\n[INFO:]\n================\n\nZoom Player MAX 9.0.2 + Patch RCG | 5.31 MB\n\nZoom Player is the most Powerful, Flexible and Customizable Media Player application for the Windows PC platform. Based on our highly-touted Smart Play technology, more media formats play with less hassle, improved stability and greater performance.\n\nBehind Zoom Player's classic media player look, hides a powerful Media Center application designed with a simple 5-Key (up/down/left/right/select) fullscreen navigation interface. The 5-Key system provides simple navigation with advanced interfaces. Interface such as the Media Library, File Browser, Playlist, Color Control, Audio Equalizer, Bookmarks, Play History and many more. Zoom Player's media center simplicity makes it ideal for users with no previous computer experience.\n\nWith Zoom Player, you can instantly Convert any PC into a Home Entertainment Center (HTPC) with no specialized hardware requirement or operating system. Zoom Player runs with every version of Windows.\n\nUtilizing Zoom Player's modular design and flexibility, you can easily design a safe viewing environment, limiting or extending functionality, making it ideal for both newbies and professionals.\n\nZoom Player is fully scalable, supporting the latest media formats and interfaces. New features are incorporated constantly with release schedules and feature integration clearly announced on our support Forum, Twitter and Facebook pages.\n\n   Install Center:\n\nZoom Player's Install Center quickly scans your system for missing or outdated media components and automatically present you with an installation list of recommended updates, keeping your system up to date with the latest technology.\n\n   Supported Video Formats:\n\nDVD, BluRay (Decrypted Main Movie playback), Matroska (MKV), MPEG2 Transport (TS/TP/TSP/TRP/M2T/M2TS/MTS/PVA/TOD), H.264 &amp; AVCHD (MPEG4 AVC), XVID, DIVX, AVI, Flash Video (FLV), Windows Media (WMV/ASF), QuickTime (MOV/HDMOV), Ogg Movie (OGM), Theora (OGV), Real Media (RM/RMVB), VideoCD (VCD), Super VideoCD (SVCD), MPEG (MPG), MPEG2 Program (M2V/VOB/MOD), MPEG4 (SP/ASP), MPEG4 ISO (MP4), Media Center DVR (DVR-MS), CamCorder (MOD/TOD), Digital Video (DV), VP3, VP6, VP7, Motion JPEG (MJPEG), Flash (SWF), Cellphone 3GPP (3GP/3G2), FLIC (FLI/FLC) and more . . .\n\n   Supported Audio Formats:\n\nMP3, Free Lossless Audio CODEC (FLAC), Advanced Audio Coding (AAC), Windows Media (WMA), OGG Vorbis (OGG), CD-Audio (CDA), Dolby Digital (AC3), Digital Theatre Surround (DTS), Matroska (MKA), Wave Audio (WAV), SHOUTcast (Streaming), Cell Phone (AMR), Monkey Audio (APE), Real Media (RA), MusePack (MPC), OptimFROG (OFR), Shorten (SHN), True Audio (TTA), WavPack (WV), Apple Lossless Audio Coding (ALAC), LPCM, MIDI, AIFF, MO3, IT, XM, S3M, MTM, UMX and more . . .\n\n   Supported Interactive Formats:\n\nDVD, Hypertext Markup Language (HTML), Flash (SWF).\n\n   Supported Image Formats:\n\nJPEG (JPG), PNG, GIF, BMP, ICO, WMF, EMF, JFIF, RLE, WIN, VST, VDA, TGA, ICB, TIFF, FAX, EPS, PCX, PCC, SCR, RPF, RLA, SGI, BW, PSD, PDD, PPM, PGM, PBM, CEL, PIC, PCD, CUT, PSP, PN and more . . .\n\n\n\nPlatform : Windows XP/Vista/Windows 7/Windows 8/Windows 8.1\nLanguage : English\n\n\n================\n[CHANGELOG:]\n================\n\n- Pressing Alt+&quot;A&quot; to open the Audio decoder configuration page when no media is loaded, now tries to show the LAV Audio decoder instead of ffdshow's audio decoder. If LAV Filters are not installed the ffdshow audio decoder will open instead.\n- Fixed a small cosmetic glitch when maximizing the audio skin.\n\n\n================\n[INSTALL NOTES:]\n================\n\n1. Install program and donÂ´t start it\n2. Copy patch from cRACk folder to program install dir\n3. Run patch with admin rights and execute it\n4. Done\n5. Enjoy!\n\nNOTE: Keygens, patches, Activators, Cracks, Loaders etc. are always scanned with Kaspersky Internet Security 2014 Latest Version to Avoid Virus\n     issues.\n     ","torrent":{"xt":"urn:btih:cac1877820d7f2c54419fcd52d3c413dfc97e0dc","amp;dn":"Zoom+Player+MAX+9.0.2+%2B+Patch+RCG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cac1877820d7f2c54419fcd52d3c413dfc97e0dc","infoHashBuffer":{"type":"Buffer","data":[202,193,135,120,32,215,242,197,68,25,252,213,45,60,65,61,252,151,224,220]},"announce":[],"urlList":[]}}