{"title":"El espejo de Salomon - Leon Arsenal.(ebook)","uid":6336068,"size":6656481,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cbc69cc5e81c40ff3761224ed47ba4333223cccd&amp;dn=El+espejo+de+Salomon+-+Leon+Arsenal.%28ebook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":-1,"time":1303470614,"description":"Alejandra Espinosa, historiadora en paro, oye hablar por casualidad, durante una reuniÃƒÂ³n de antiguos compaÃƒÂ±eros de estudios, acerca de un libro muy extraÃƒÂ±o, fechado en el siglo XIX y descubierto por un amigo mientras catalogaba una biblioteca particular. Ese libro estÃƒÂ¡ escrito en ulfiliano, el antiguo alfabeto de los visigodos, y en el prÃƒÂ³logo se afirma que es la copia de un texto medieval. Intrigada por ese hallazgo misterioso y sospechando que pueda ser una falsificaciÃƒÂ³n histÃƒÂ³rica, tema del que es una apasionada, se decide a investigar acerca del mismo.\n\nEsa investigaciÃƒÂ³n la va a conducir a una cadena de la que el propio libro no parece ser sino uno eslabÃƒÂ³n mÃƒÂ¡s y que parece remontarse a lo largo de los siglos, desde nuestros dÃƒÂ­as a la ÃƒÂ©poca de los reyes visigodos. Una trama oculta que ha involucrado a sociedades secretas y personajes pÃƒÂºblicos de lo mÃƒÂ¡s variopinto, todos ellos en pos de un objetivo que no acaba de aparecer claro. TambiÃƒÂ©n va a llegar a otra conclusiÃƒÂ³n en muy poco tiempo: la de que todo aquel que se interesa por el libro y se acerca demasiado a ÃƒÂ©l, parece verse expuesto al peligro o incluso a una muerte violenta.\n\nDOC | PDF | EPUB | FB2 | LIT | MOBI | LRF | RTF","torrent":{"xt":"urn:btih:cbc69cc5e81c40ff3761224ed47ba4333223cccd","amp;dn":"El+espejo+de+Salomon+-+Leon+Arsenal.%28ebook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbc69cc5e81c40ff3761224ed47ba4333223cccd","infoHashBuffer":{"type":"Buffer","data":[203,198,156,197,232,28,64,255,55,97,34,78,212,123,164,51,50,35,204,205]},"announce":[],"urlList":[]}}