{"title":"Vince Gill - Have Yourself A Merry Little Christmas  (2nafish)","uid":5219389,"size":148197380,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cbddfd0ed232b17edeec83f6293a0d21363f9b4b&amp;dn=Vince+Gill+-+Have+Yourself+A+Merry+Little+Christmas++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1260877031,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nLet There Be Peace on Earth is the first Christmas album from American country music artist Vince Gill. It was released in 1993 on MCA Nashville Records. &quot;Have Yourself a Merry Little Christmas,&quot; one of the album's tracks, peaked at #54 on the Billboard Hot Country Singles &amp; Tracks chart.\n\n&quot;Have Yourself a Merry Little Christmas&quot; is a Christmas song introduced by Judy Garland in the 1944 MGM musical Meet Me in St. Louis. Frank Sinatra later recorded a version with modified lyrics, which has become more common than the original. The song was credited to Hugh Martin and Ralph Blane, although during a December 21, 2006 NPR interview, Martin said that Blane had encouraged him to write the song but had not had anything more to do with writing it. In 2007, ASCAP ranked &quot;Have Yourself a Merry Little Christmas&quot; the third most performed Christmas song written by ASCAP members of the past five years.\n\nVincent Grant &quot;Vince&quot; Gill (born April 12, 1957) is an American neotraditional country singer-songwriter and multi-instrumentalist. He has achieved commercial success and fame both as frontman to the country rock band Pure Prairie League in the 1970s, and as a solo artist beginning in 1983, where his talents as a vocalist and musician have placed him in high demand as a guest vocalist, and a duet partner. Gill has recorded more than twenty studio albums, charted over forty singles on the U.S. Billboard charts as Hot Country Songs, and has sold more than 22 million albums. He has been honored by the Country Music Association with 18 CMA Awards, including two Entertainer of the Year awards and five Male Vocalist Awards. Gill has also earned 20 Grammy Awards, more than any other male Country music artist. In 2007, Gill was inducted into the Country Music Hall of Fame.\n\nGill married country singer Janis Oliver of Sweethearts of the Rodeo fame, in 1980. The couple have one daughter, Jennifer Jerene Gill, born May 5, 1982. Vince and Janis separated in the mid-1990s and eventually divorced in June 1998. Vince married Christian/pop singer Amy Grant in March 2000. They have one daughter, Corrina Grant Gill, born March 12, 2001.\n\nGill, along with his wife Amy, are fans of the Nashville Predators. They have been season ticket holders since the opening season and are often shown on the jumbo screen. In the 2007 playoffs, he and Amy sang the national anthem for each game.\n\nThough Gill never attended college, he's a big fan of the University of Oklahoma football team. He also attends nearly every men's basketball game at Belmont University in Nashville.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:cbddfd0ed232b17edeec83f6293a0d21363f9b4b","amp;dn":"Vince+Gill+-+Have+Yourself+A+Merry+Little+Christmas++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbddfd0ed232b17edeec83f6293a0d21363f9b4b","infoHashBuffer":{"type":"Buffer","data":[203,221,253,14,210,50,177,126,222,236,131,246,41,58,13,33,54,63,155,75]},"announce":[],"urlList":[]}}