{"title":"The Dead Janitors Club {BBS}","uid":6920512,"size":1224529,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd9256eba944812ec834be3cbbca1475cb91cc47&amp;dn=The+Dead+Janitors+Club+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1325197169,"description":"It had been well over a month since I had seen or heard from Dirk, and it was showing in my bank account...I was tempted to start searching for another job. I still had faith, though, that somehow, someway, I was meant for this line of work...\n\n&quot;Hello?&quot; I mumbled, not recognizing the number on the caller ID.\n\n&quot;Jeff, it's Dirk,&quot; said the voice. I waited curiously, wondering who the hell Dirk was. &quot;We've got one,&quot; he eventually said when I failed to answer.\n\nWe had never bothered to get together for any sort of training, and now, it was too late.\n\nAfter toiling for minimum wage for years, Jeff Klima got an unexpected offer: to head up a brand new crime scene cleanup company in Orange County. The upside? A chance to make incredible money in a field with no competition. The downside? Everything else about the job.\n\nThe Dead Janitors Club is an engrossing, hilarious, and morbidly fascinating memoir of life and death, from someone whose life is death. From his first job-where a piece of brain fell off the ceiling and landed in his eye-to having to clean up one of his former neighbors, The Dead Janitors Club is more than just a retelling of crime scenes and what it takes to clean them up. It is a memoir about struggling to survive college, love, life, and keeping one's sanity when one never knows if, the next time the phone rings, you must delve into the \n\n\n# Paperback: 352 pages\n# Publisher: Sourcebooks (June 1, 2010)\n# Language: English\n# ISBN-10: 1402238290\n# ASIN: B005DIDA5Q","torrent":{"xt":"urn:btih:cd9256eba944812ec834be3cbbca1475cb91cc47","amp;dn":"The+Dead+Janitors+Club+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd9256eba944812ec834be3cbbca1475cb91cc47","infoHashBuffer":{"type":"Buffer","data":[205,146,86,235,169,68,129,46,200,52,190,60,187,202,20,117,203,145,204,71]},"announce":[],"urlList":[]}}