{"title":"Droidicon - Icon Pack Android","uid":7337540,"size":2065503,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:cff3fcadb4da5176dcf24e0692cfe24adac8d617&amp;dn=Droidicon+-+Icon+Pack+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cad40","files":1,"time":1339112768,"description":"he largest icon pack for ADW, LauncherPro and GO Launcher available anywhere.\nWith over 1,000 icons in 176 different styles/colors, you can break the monotony of traditional themes and icon packs. For the price of a latte, you can theme all your Android devices exactly how you want them for the rest of your life.\nI apologize for the update that made the app slow for many of you. I have reduced the background work the app was doing, and it should be much faster now.\nVisit me on Google+ to talk about Droidicon: http://gplus.to/jonfhancock\nIn the early days of LauncherPro, there were only a handful of dock icons included in that beautiful and unique LP style we have come to know and love. To find more icons in that style, you had to search the web and read through 50 page forum posts. Then you had to download them to your sd card and apply them from there. The same was true of dock backgrounds.\n\nThen, in June 2010, I brought something new to the LauncherPro icon and dock game. I built launcherproicons.com where artists could upload their icons and docks, and people could easily find them and download them as well as make requests for new icons.\nThis still had the problem of downloading to the sd card first, then finding them and applying them. I fixed that problem by developing the Droidicon app.\nThis app bypasses all the mess of searching for icons on the web, and groups over 1,000 icons and 400 docks into one app. When you go to choose a new custom icon, you simply open Droidicon, and start typing the name of the app you are trying to find. The giant list of icons will be filtered down, and you can quickly choose the icon you need. You can also search through the docks.\nI decided to take it one step further and add over 170 different styles of icons. Each icon is available in each style in a broad range of colors. You can switch styles at any time, and even build sleek home screens that use multiple icon styles for some really beautiful effects. With this addition, Droidicon transcended LauncherPro, and became valuable to users of ADW Launcher, GO Launcher and the rest of the home screen replacements.\nIf you are looking for a way to escape completely uniform ADW and LauncherPro icon packs and boring stock home screens to theme your phone exactly how you want it, you absolutely need this app. It is the ultimate tool for personalization.\nFor a few examples of home screens made with our icons and docks visit http://launcherproicons.com/screenshots\nHelp me improve the app by telling me what you would like to see at http://droidicon.uservoice.com/\nThe icons can be used out of the box with the following applications:","torrent":{"xt":"urn:btih:cff3fcadb4da5176dcf24e0692cfe24adac8d617","amp;dn":"Droidicon+-+Icon+Pack+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cff3fcadb4da5176dcf24e0692cfe24adac8d617","infoHashBuffer":{"type":"Buffer","data":[207,243,252,173,180,218,81,118,220,242,78,6,146,207,226,74,218,200,214,23]},"announce":[],"urlList":[]}}