{"title":"Joe Rogan Podcast #299 - HONEYHONEYBAND [64k]","uid":7937597,"size":54035393,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d096d4bb4d43e321f98a22bd9a450b91392c88a6&amp;dn=Joe+Rogan+Podcast+%23299+-+HONEYHONEYBAND+%5B64k%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jrepodlowq","files":-1,"time":1355903269,"description":"#299 - HONEYHONEY, BRIAN REDBAN - [64k Time Warped]\n\nAbout the guest(s):\n\nHoney Honey is jazzy Twangy rollicking collaboration between singer Suzanne Santo and guitarist Ben Jaffe Before joining the duo Jaffe recorded music for television and film, he then met with Santo (an actress whose resume includes stints on Law &amp; Order and Blind Justice) through a mutual friend who took Jaffe to see one of Santo solo gigs, the two began holding informal songwriting sessions and soon discovered a musical partnership to adopt the name honey honey, they also discovered an early supporter of Kiefer Sutherland, who signed the band use music, a label he co-owns with musician Jude Cole \n\nHoney Honey made his studio debut by giving Loose Boots EP in early 2008, the musicians then hit the road with Lifehouse (another band on the Iron Works to participaterlistan) while finding tidatt work on their debut album, First Rodeo was released later that year with varied influences ranging from crossover jazz to neo-soul to engage alt-country \n\n------\n\nThis is the Joe Rogan Experience Podcast #299 64k Time Warped version. Time warped means the audio is played 35% faster but without changing the pitch. They just talk a lot faster =)\nThe reason behind this is to save time for the JRE junkies out there, you save about 50 minutes of your life on a 3 hour podcast. Aint that just great? Since its encoded with OGG aoTuVb q0 its also smaller in filesize and good quality.\n\n\nSponsors: Onnit (http://www.onnit.com), Ting (http://rogan.ting.com) etc..\n","torrent":{"xt":"urn:btih:d096d4bb4d43e321f98a22bd9a450b91392c88a6","amp;dn":"Joe+Rogan+Podcast+%23299+-+HONEYHONEYBAND+%5B64k%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d096d4bb4d43e321f98a22bd9a450b91392c88a6","infoHashBuffer":{"type":"Buffer","data":[208,150,212,187,77,67,227,33,249,138,34,189,154,69,11,145,57,44,136,166]},"announce":[],"urlList":[]}}