{"title":"Brain Neurotrauma: Molecular, Neuropsychological and Rehabilitat","uid":12230974,"size":57074671,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0a081bae0cd1dfadb0643cd45352e1b0645a938&amp;dn=Brain+Neurotrauma%3A+Molecular%2C+Neuropsychological+and+Rehabilitat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1439572190,"description":"Title: Brain Neurotrauma: Molecular, Neuropsychological and Rehabilitation Aspects \nSeries: Frontiers in Neuroengineering Series \nAuthor: Firas H. Kobeissy \nFormat: PDF \nHardcover: 725 pages \nPublisher: CRC Press; 1 edition (February 25, 2015) \nLanguage: English \nISBN: 978-1466565982 \n\n\nEvery year, an estimated 1.7 million Americans sustain brain injury. Long-term disabilities impact nearly half of moderate brain injury survivors and nearly 50,000 of these cases result in death.\n\nOver the last decade, the field of neurotrauma has witnessed significant advances, especially at the molecular, cellular, and behavioral levels. This progress is largely due to the introduction of novel techniques, as well as the development of new animal models of central nervous system (CNS) injury.\n\nBrain Neurotrauma: Molecular, Neuropsychological, and Rehabilitation Aspects provides a comprehensive and up-to-date account on the latest developments in the area of neurotrauma, including brain injury pathophysiology, biomarker research, experimental models of CNS injury, diagnostic methods, and neurotherapeutic interventions as well as neurorehabilitation strategies in the field of neurotraum research.\n\nThe book includes several sections on neurotrauma mechanisms, biomarker discovery, neurocognitive/neurobehavioral deficits, and neurorehabilitation and treatment approaches. In addition, a section is devoted to models of mild CNS injury, including blast and sport-related injuries.\n\nThis book, with its diverse coherent content, is a valuable and comprehensive reference for individuals interested in the diverse and heterogeneous aspects of CNS pathology and/or rehabilitation needs","torrent":{"xt":"urn:btih:d0a081bae0cd1dfadb0643cd45352e1b0645a938","amp;dn":"Brain+Neurotrauma%3A+Molecular%2C+Neuropsychological+and+Rehabilitat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0a081bae0cd1dfadb0643cd45352e1b0645a938","infoHashBuffer":{"type":"Buffer","data":[208,160,129,186,224,205,29,250,219,6,67,205,69,53,46,27,6,69,169,56]},"announce":[],"urlList":[]}}