{"title":"David Moody - Dog Blood ( horror/sci-fi)","uid":5709120,"size":7883524,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d1565313e43fe5494e85b57e8e0e998255500a73&amp;dn=David+Moody+-+Dog+Blood+%28+horror%2Fsci-fi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kash79","files":10,"time":1279816721,"description":"David Moody - Dog Blood \n\nGenre - post-apocalyptic sci-fi/horror\n\nOn the heels of Patient Zero and Pride and Prejudice with Zombies comes David Moody's electrifying sequel to Hater in which humanity fights itself to the death against a backdrop of ultimate apocalyptic destruction.\n\nIn Dog Blood the Earth has been torn apart. Everyone is either human or Hater, victim or killer. Major cities have become vast refugee camps where human survivors cower together in fear. Amidst this indiscriminate fighting and killing, Danny McCoyne is on a mission to find his daughter, Ellis. Free of inhibitions, unrestricted by memories of the previous world, and driven by instinct, children are pure Haters and might well be the deciding factor in the future of the Hater race. But as McCoyne makes his way into the heart of human territory, an incident on the battlefield sets in place an unexpected chain of events, forcing him to question everything he believes he knows about the new order that has arisen and about the dynamic of the Hate itself.\n\n\nThe world as we know it no longer exists. The human race is divided into two distinct camps: the Unchanged and the Haters. The latter are people ripped of all social restraints and must kill the Unchanged. Their goal is an Unchanged genocide. The Haters have caused governments to collapse destroying the infrastructure of every nation. They still can think but obsess over killing the Unchanged even family members.\n\nDanny McCoyne is a Hater who hunts the Unchanged without mercy. His goal is to find his daughter Ellis who was taken away from him when he was knocked unconscious after killing his father-in-law. Before he passed out, he saw her and knows she is just like him. The government has relocated the Unchanged inside cities filled with traps like a medieval fortress. Danny falls in with a group that seeks the same destruction as he does. He learns to control his homicidal impulses so he can enter the city because his Ellis is there.\n\nThis intelligent apocalyptic chiller is a fantastic horror tale that continues the escapades of the Haters, who are a zombie like humanoids. The species cannot control their basic impulse to slaughter the Unchanged though Danny tries as his love for Ellis supersedes his instinct to kill. Though lacking the cautionary theme of its predecessor, but with the same moody dark atmosphere and a strange flicker of paternal love and hope, Dog Blood is a terrific zombie thriller that affirms David Moody as a strong talent.\n\n\n\n\nformats - epub,mobi,lit,html,pdf,rtf","torrent":{"xt":"urn:btih:d1565313e43fe5494e85b57e8e0e998255500a73","amp;dn":"David+Moody+-+Dog+Blood+%28+horror%2Fsci-fi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1565313e43fe5494e85b57e8e0e998255500a73","infoHashBuffer":{"type":"Buffer","data":[209,86,83,19,228,63,229,73,78,133,181,126,142,14,153,130,85,80,10,115]},"announce":[],"urlList":[]}}