{"title":"American Gothic - COMPLETE","uid":9476413,"size":8070895616,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d1e0e68bb03b898e0ba5538010cbbd4a313e3cd2&amp;dn=American+Gothic+-+COMPLETE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"navrasjueventa","files":22,"time":1389709201,"description":"American Gothic is an American horror series created by Shaun Cassidy and executive produced by Sam Raimi. The show first aired on CBS on September 22, 1995, and was canceled after a single season on July 11, 1996.\n\nPlot\n\nThe story takes place in the fictional town of Trinity, South Carolina, and revolves around Caleb Temple (Lucas Black) and the town's corrupt sheriff, Lucas Buck (Gary Cole). Though appearing affable and charismatic, Sheriff Buck is a murderous rapist whose powerbase is backed by apparent supernatural powers, which he generally uses to manipulate people to &quot;fulfill their potential&quot; and make life-changing choices (usually for evil).\n\nCaleb Temple is a normal child whose paternity masks a horrific secret: Lucas Buck is his biological father, having raped his mother in front of Caleb's older sister Merlyn (Sarah Paulson). The horror of watching her mother being sexually assaulted caused Merlyn to become severely emotionally traumatized and withdrawn from the rest of the world, made even worse when her mother committed suicide after giving birth to Caleb.\n\nDuring the pilot episode of the series, Sheriff Buck murders Merlyn in cold blood and manipulates Caleb's &quot;father&quot; (Sonny Shroyer) into committing suicide in order to eliminate Caleb's family and claim his biological son for his own. However, the newly arrived Dr. Crower (Jake Weber) begins to uncover the sheriff's role in the death of Merlyn and Merlyn's father and with help from Caleb's out-of-town cousin Gail Emory (Paige Turco), struggle to prevent Lucas from corrupting young Caleb. They are aided in part by Merlyn's ghost, who personally appears before Caleb throughout the series in order to try to keep him from Buck's corrupt grasp.","torrent":{"xt":"urn:btih:d1e0e68bb03b898e0ba5538010cbbd4a313e3cd2","amp;dn":"American+Gothic+-+COMPLETE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1e0e68bb03b898e0ba5538010cbbd4a313e3cd2","infoHashBuffer":{"type":"Buffer","data":[209,224,230,139,176,59,137,142,11,165,83,128,16,203,189,74,49,62,60,210]},"announce":[],"urlList":[]}}