{"title":"Grateful Dead - Anthem Of... (1968) 2013 HDTracks 24-96-FLAC","uid":11145789,"size":779938368,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d21573215ccb2d6bb1e9cc8cc2b2ce93afdc7d11&amp;dn=Grateful+Dead+-+Anthem+Of...+%281968%29+2013+HDTracks+24-96-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hal4000","files":-1,"time":1412258639,"description":"The Grateful Dead was an American rock band formed in 1965 in Palo Alto, California. The band was known for its unique and eclectic style, which fused elements of rock, folk, bluegrass, blues, reggae, country, improvisational jazz, psychedelia, and space rock, and for live performances of long musical improvisation. &quot;Their music,&quot; writes Lenny Kaye, &quot;touches on ground that most other groups don't even know exists.&quot; These various influences were distilled into a diverse and psychedelic whole that made the Grateful Dead &quot;the pioneering Godfathers of the jam band world&quot;. They were ranked 57th in the issue The Greatest Artists of all Time by Rolling Stone magazine. They were inducted into the Rock and Roll Hall of Fame in 1994 and their Barton Hall Concert at Cornell University (May 8, 1977) was added to the Library of Congress's National Recording Registry. The Grateful Dead have sold more than 35 million albums worldwide.\n\nAs the second long-player by the Grateful Dead, Anthem of the Sun (1968) pushed the limits of both the music as well as the medium. General dissatisfaction with their self-titled debut necessitated the search for a methodology to seamlessly juxtapose the more inspired segments of their live performances with the necessary conventions of a single LP. Since issuing their first album, the Dead welcomed lyricist Robert Hunter into the fold -- freeing the performing members to focus on the execution and taking the music to the next level. Another addition was second percussionist Mickey Hart, whose methodical timekeeping would become a staple in the Dead's ability to stop on the proverbial rhythmic dime. Likewise, Tom Constanten (keyboards) added an avant-garde twist to the proceedings with various sonic enhancements that were more akin to John Cage and Karlheinz Stockhausen than anything else coming from the burgeoning Bay Area music scene. Their extended family also began to incorporate folks like Dan Healy -- whose non-musical contributions and innovations ranged from concert PA amplification to meeting the technical challenges that the band presented off the road as well. On this record Healy's involvement cannot be overstated, as the band were essentially given carte blanche and simultaneous on-the-job training with regards to the ins and outs of the still unfamiliar recording process. The idea to create an aural pastiche from numerous sources -- often running simultaneously -- was a radical concept that allowed consumers worldwide to experience a simulated Dead performance firsthand. One significant pattern which began developing saw the band continuing to refine the same material that they were concurrently playing live night after night prior to entering the studio. The extended &quot;That's It for the Other One&quot; suite is nothing short of a psychedelic roller coaster. The wild ride weaves what begins as a typical song into several divergent performances -- taken from tapes of live shows -- ultimately returning to the home base upon occasion, presumably as a built-in reality check. Lyrically, Bob Weir (guitar/vocals) includes references to their 1967 pot bust (&quot;...the heat came 'round and busted me for smiling on a cloudy day&quot;) as well as the band's spiritual figurehead Neal Cassidy (&quot;...there was Cowboy Neal at the wheel on a bus to never ever land&quot;). Although this version smokes from tip to smouldering tail, the piece truly developed a persona all its own and became a rip-roaring monster in concert. The tracks &quot;New Potato Caboose&quot; and Weir's admittedly autobiographically titled &quot;Born Cross-Eyed&quot; are fascinatingly intricate side trips that had developed organically during the extended work's on-stage performance life. &quot;Alligator&quot; is a no-nonsense Ron &quot;Pigpen&quot; McKernan workout that motors the second extended sonic collage on Anthem of the Sun. His straight-ahead driving blues ethos careens headlong into the Dead's innate improvisational psychedelia. The results are uniformly brilliant as the band thrash and churn behind his rock-solid lead vocals. Musically, the Dead's instrumental excursions wind in and out of the primary theme, ultimately ending up in the equally frenetic &quot;Caution (Do Not Stop on Tracks).&quot; Although the uninitiated might find the album unnervingly difficult to follow, it obliterated the pretension of the post-Sgt. Pepper's &quot;concept album&quot; while reinventing the musical parameters of the 12&quot; LP medium.\n\nHDTracks-PCM-24Bit-96Khz.","torrent":{"xt":"urn:btih:d21573215ccb2d6bb1e9cc8cc2b2ce93afdc7d11","amp;dn":"Grateful+Dead+-+Anthem+Of...+%281968%29+2013+HDTracks+24-96-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d21573215ccb2d6bb1e9cc8cc2b2ce93afdc7d11","infoHashBuffer":{"type":"Buffer","data":[210,21,115,33,92,203,45,107,177,233,204,140,194,178,206,147,175,220,125,17]},"announce":[],"urlList":[]}}