{"title":"star wars episode 2 [spanish latino]","uid":4805698,"size":734359599,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d35a4804a805a9a5016e19a3675f2502c12221f3&amp;dn=star+wars+episode+2+%5Bspanish+latino%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gallardo3","files":2,"time":1238189420,"description":"The opening crawl reveals that the Galactic Republic is in crisis. A separatist movement, led by former Jedi Master Count Dooku (Christopher Lee), has threatened the peace. Senator PadmÃƒÂ© Amidala (Natalie Portman), former Queen of Naboo, returns to the Galactic Senate to vote against the creation of an Army of the Republic. Upon her arrival at Coruscant, she narrowly escapes an assassination attempt, a bomb placed on her ship. As a result, Chancellor Palpatine (Ian McDiarmid) requests that she be put under the protection of Jedi Knight Obi-Wan Kenobi (Ewan McGregor) and his apprentice, Anakin Skywalker (Hayden Christensen). That night, Zam Wesell, a bounty hunter, makes another attempt on PadmÃƒÂ©'s life, but Wesell is herself killed (to silence her) just after Obi-Wan and Anakin capture her. The Jedi Council sends Obi-Wan to investigate the murder, while Anakin is to protect PadmÃƒÂ© by escorting her to Naboo. Anakin welcomes the opportunity; he often becomes angry at and frustrated with Obi-Wan's criticism, and is glad to have an opportunity to be alone with PadmÃƒÂ©. Representative Jar Jar Binks (Ahmed Best) assumes the Senator's duties in her absence.","torrent":{"xt":"urn:btih:d35a4804a805a9a5016e19a3675f2502c12221f3","amp;dn":"star+wars+episode+2+%5Bspanish+latino%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d35a4804a805a9a5016e19a3675f2502c12221f3","infoHashBuffer":{"type":"Buffer","data":[211,90,72,4,168,5,169,165,1,110,25,163,103,95,37,2,193,34,33,243]},"announce":[],"urlList":[]}}