{"title":"Life Without Buildings - Any Other City [2000] VBR MP3 ~190kbps","uid":4005951,"size":68277012,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d3e1376ba135fdfaa1ebee192bbf3f32e0af6f30&amp;dn=Life+Without+Buildings+-+Any+Other+City+%5B2000%5D+VBR+MP3+%7E190kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dkords","files":11,"time":1201822952,"description":"AMG Review by Andy Kellman\n\nThe numerous comparisons drawn by Life Without Buildings are across-the-board positive. Through the music and sleeve design, they come across as refugees from Rough Trade&amp;#039;s class of 1979. Liliput, the Fall, Delta 5, and even the Slits occasionally come to mind. These female-fronted groups have certainly inspired LWB, but this quartet -- simply a drummer, a bassist, a guitarist, and a vocalist -- offers much more than nostalgia and post-punk plundering. They&amp;#039;re more of a pop band, which is just fine. The jagged, economical rhythms of late-&amp;#039;70s and early-&amp;#039;80s post-punk are prominent. Robert Johnston&amp;#039;s guitar playing is melodic and pleasant, differing from the cut-and-scrape methods of his forebears: think of Talking Heads&amp;#039; or Throwing Muses&amp;#039; first albums. Unlike many post-punk rhythm sections, the bass of Chris Evans and the drums of Will Bradley aren&amp;#039;t reggae-influenced. They provide a plaintive, professional surface for firecracker Sue Tompkins to glide atop, throwing in the occasional, non-jutting shift in tempo that also avoids predictability. Tompkins&amp;#039; scat-speak singing is the band&amp;#039;s main attraction, a youthful chirp that never pierces. Her repet-pet-petitive repetitive style might be at odds with the ears of some listeners, but it&amp;#039;s just as unique as the exuberant vocals featured on records by any of the bands mentioned above. The set is remarkably cohesive, with the differences in each song taking a few listens to sink in. Only six of Any Other City&amp;#039;s ten songs will be new to those who purchased the band&amp;#039;s trio of 2000-issued singles. The overlap is reworked, usually with slight improvements made over the original. Only &quot;The Leanover&quot; suffers, losing some of the raw thrill of the single version. If there&amp;#039;s a gripe to be had with the record, that&amp;#039;s it. An ex-excite-exciting, phenom-enom-phenomenal debut.","torrent":{"xt":"urn:btih:d3e1376ba135fdfaa1ebee192bbf3f32e0af6f30","amp;dn":"Life+Without+Buildings+-+Any+Other+City+%5B2000%5D+VBR+MP3+%7E190kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3e1376ba135fdfaa1ebee192bbf3f32e0af6f30","infoHashBuffer":{"type":"Buffer","data":[211,225,55,107,161,53,253,250,161,235,238,25,43,191,63,50,224,175,111,48]},"announce":[],"urlList":[]}}