{"title":"Financial Origami: How the Wall Street Model Broke","uid":6512962,"size":1738964,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d40fddd9f72a656bda7cfc1b6b9d95a3e249e908&amp;dn=Financial+Origami%3A+How+the+Wall+Street+Model+Broke&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309706761,"description":"Brendan Moynihan, &quot;Financial Origami: How the Wall Street Model Broke (Bloomberg)&quot;\n Publisher: Bloomberg Press | 2011 | ISBN: 1118001818 | PDF | 170 pages | 2.2 MB\n\n An in-depth look at the failure of Wall Street's &quot;proven&quot; financial models\n Origami is the Japanese art of folding paper into intricate and aesthetically attractive shapes. As such, it is the perfect metaphor for the Wall Street financial engineering model, which ultimately proved to be the underlying cause of the 2008 financial crisis.\n In Financial Origami, Brendan Moynihan describes how the Wall Street business model evolved from a method to transfer risk into a method for manufacturing risk. Along the way, this timely book skillfully dissects financial engineering and addresses how it's often a mechanism to evade regulatory constraints, provide institutional investors with customized products, and, of course, generate revenue for financial engineers.\n Reveals how Wall Street's financial engineering business model morphed into something destructive\n Highlights how the origami model worked well in the comparatively stable years of the early 2000s, when there was less risk to transfer\n Discusses how Wall Street began manufacturing risk by creating products that multiplied risk exposures and encouraged subprime lending\n With the collapse of Lehman Brother the Wall Street business model effectively broke. But there are many lessons to be learned from what has transpired, and Financial Origami will show you what they are.","torrent":{"xt":"urn:btih:d40fddd9f72a656bda7cfc1b6b9d95a3e249e908","amp;dn":"Financial+Origami%3A+How+the+Wall+Street+Model+Broke","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d40fddd9f72a656bda7cfc1b6b9d95a3e249e908","infoHashBuffer":{"type":"Buffer","data":[212,15,221,217,247,42,101,107,218,124,252,27,107,157,149,163,226,73,233,8]},"announce":[],"urlList":[]}}