{"title":"Digital Negatives{BBS}","uid":6734652,"size":21144395,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d422d572047faf46c09d98bcb6dcae7e9cde5079&amp;dn=Digital+Negatives%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1318282805,"description":"Eagerly awaited, clear step-by-step instructions for how to work with digital negatives to produce excellent quality prints for silver and alternative processes.\nProduct Description\nDigital Negatives: Using Photoshop to Create Digital Negatives for Silver and Alternative\nProcess Printing bridges the world of traditional photographic printing with digital technology. A digital negative, prepared in Photoshop, allows you to skip the dark room time developing the negatives-getting straight to a variety of printing processes including silver, platinum, and a host of other &quot;alternative&quot; processes. You will see this as an opportunity to mix technology with traditional photo processes resulting in more time for your art! In the recent past, photographers that wanted digital negatives had to take their business to labs. Now all of you Photoshop users can incorporate this practice into your workflow of choice.\n\n*Easy, quick start recommendations for specific supplies and instructions for making your first print quickly without all the details of calibrating digital negatives.\nÃ‚Â·Offers expert instruction for the more advanced; much of the book will be focused on how to calibrate digital negatives, configure a digital darkroom, and fine tune prints from digital negatives\nÃ‚Â·Adventurous, experimental techniques take printing using alternative processes into new options including toning, multiple printing, printing with ink and platinum, plus others.\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 224 pages\n    * Publisher: Focal Press; 1 edition (November 28, 2006)\n    * Language: English\n    * ISBN-10: 0240808541\n    * ISBN-13: 978-0240808543","torrent":{"xt":"urn:btih:d422d572047faf46c09d98bcb6dcae7e9cde5079","amp;dn":"Digital+Negatives%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d422d572047faf46c09d98bcb6dcae7e9cde5079","infoHashBuffer":{"type":"Buffer","data":[212,34,213,114,4,127,175,70,192,157,152,188,182,220,174,126,156,222,80,121]},"announce":[],"urlList":[]}}