{"title":"Cradle and All - James Patterson-viny","uid":6415932,"size":745047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4604786f19ee2e0033af713570c904d4250df5a&amp;dn=Cradle+and+All+-+James+Patterson-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1306160675,"description":"Cradle and All - James Patterson-viny\n\n\nThe #1 bestseller Pop Goes the Weasel proved once again that James Patterson is an undisputed master of suspense. Now he has written his most compelling and surprising thriller ever. . . .\n\n\nCradle &amp; All\n\n\nIn Boston, a young woman finds herself pregnant -- even though she is still a virgin.\n\n\nIn Ireland, another young woman discovers she is in the same impossible condition.\n\n\nAnd in cities all around the world, medical authorities are overwhelmed by epidemics, droughts, famines, floods, and worse. It all feels like a sign that something awful is coming.\n\n\nAnne Fitzgerald, a former nun turned private investigator, is hired by the Archdiocese of Boston to investigate the immaculate conceptions. Even as she comes to care about and trust the young women, she realizes that both are in great danger. Terrifying forces of light and darkness are gathering. Stepping into uncharted territory where the unknown is just the beginning, Anne must discover the truth -- to save the young women, to save herself, and to protect the future of all mankind.\n\n\nCradle and All probes our most deeply held fears and hopes in a sizzlingly fast-paced and chilling story. This is James Patterson's most brilliant suspense novel ever, written with all the extraordinary drama and overwhelming emotion that have made him a #1 bestselling writer all over the world.\n\n\nCradle and All is based on an earlier James Patterson novel, Virgin, and includes scenes and characters from that book.","torrent":{"xt":"urn:btih:d4604786f19ee2e0033af713570c904d4250df5a","amp;dn":"Cradle+and+All+-+James+Patterson-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4604786f19ee2e0033af713570c904d4250df5a","infoHashBuffer":{"type":"Buffer","data":[212,96,71,134,241,158,226,224,3,58,247,19,87,12,144,77,66,80,223,90]},"announce":[],"urlList":[]}}