{"title":"Dragon Knight III - Knights of Xentar","uid":3922494,"size":13779700,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d47d6bc52ca864d49faa1bf8b923be95dace1aee&amp;dn=Dragon+Knight+III+-+Knights+of+Xentar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"X-PLODE","files":1,"time":1196892401,"description":"About 5 years ago i decided to go explore my 15 year old pirateware bootleg cd&amp;#039;s for any old games and software and i found *drumroll* Knights Of Xentar.\n\nAnd this is what happened\n\n1) I decided to play it again...and it failed to load ;_;\n2) Accepted the fact that i couldn&amp;#039;t play it again and continued exploring pirate cd collection\n3) Found another groups release of Knights Of Xentar\n4) Proceeded to play...only to find out the cg was incomplete and fucked and mouse did not work ;_;\n5) Abandoned playing KoX cos of mouse issues and continued exploring pirate cd collection\n6) Found ANOTHER release of Knights Of Xentar\n7) Installed and played...but still crashed and crapped out on me with midi ;_;\n8) Screamed &quot;OMFG&quot; and cried some more ;_;\n10) Decided to fix this crap myself and took some bits of this release and then that release, and then some cracks from another place and some update patches from there...etc.\n11) After 4 hours i managed to get it working and started to play with a grin on my face :3\n12) Next day some girl at school asks me why i am laughing to myself alone at my desk; i look at her and say while lollling &quot;i just had the best night EVVA&quot;, then she asks me if i had some sex LOL\n\n\n\nAlright, some oldskool l33t d00ds asked me if i could release Knights Of Xentar and so i have :D\n\nOk i just copy paste the story from a 14 year old nfo xD\n\n\n\nYour sword &amp; armour were stolen when you entered the village. An old man\n saved you from being eaten by giant rats. You thanked the old man and\n want to go on your journey, but the old man strongly opposed it. It\n was in your destiny to encounter danger, so you left disregarding the\n old man&amp;#039;s warning. After you stepped outside, you found out that you\n don&amp;#039;t have any cloth on: they were stolen too.\n\n  You walked around the village but nobody wanted to talk to you, since\n you appeared to be a pervert. This was the time you came by the bar at\n northeast. You heard a girl screaming the moment you stepped into the\n door. The theives who stole your stuff were all over a girl and the\n bartender begged you to save his daughter. You were not drunk anymore,\n so you beated the crap out of those morons. They begged for mercy, and\n you demanded them to return your stuff. They promised to find your stuff,\n but the moment they stepped out of the door they were laughing and\n calling you names. The girl thanked you for saving her. You both felt\n embarrassed since both of you didn&amp;#039;t have your clothes on. Then the\n bartender thanked you also and gave you 50 gold dollars to show his\n appreciation. It seemed like the girl likes u and her father didn&amp;#039;t\n know yet.\n\n  Although you were the hero of the day, people still don&amp;#039;t want to talk\n to a walking pervert. Frustrated, you came by Rich Don&amp;#039;s house again at\n the southwest. Surprisingly, the guard let you in this time. You search\n through the house as you did to all the others in village, but no luck.\n Disappointed, you got up to the 2nd floor and found Rich Don in a room.\n He told you that those thieves were slaves of the evil and he&amp;#039;s giving\n reward to whoever kills it. You made a deal with him that if you succeed,\n he would try to return your stuff to you. In the meantime, he gave you\n some armor and a knife. He told you that the evil lived in the mountain\n west of the village and don&amp;#039;t come back if u didn&amp;#039;t succeed. U put on\n the armor, hold tight onto the knife, marched straight out of the room,\n but just at that moment you glanced a smirk on that fat man&amp;#039;s face...\n\n  And the rest of the adventure is yours!!!! :)\n\n\n\nThe story is fucking LOL and the characters also, ALLOT of frigging fun.\n\nIf your an oldskool rpg fan then you will love this RPG\n\n\nPS : Use KX.exe to play.I left my own savefiles in a rar for the game ONLY not HCG...but i left the CG data already opened, so you can just press enter for the password part and then choose photoshop for the HCG.\nI recommend you play the game first before watching the HCG or see my items in my saves :D\nAlso this is the DISKETTE VERSION so it has &quot;SOME&quot; VOICES, i could not find the original cd with full voices ANYWHERE ;_;","torrent":{"xt":"urn:btih:d47d6bc52ca864d49faa1bf8b923be95dace1aee","amp;dn":"Dragon+Knight+III+-+Knights+of+Xentar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d47d6bc52ca864d49faa1bf8b923be95dace1aee","infoHashBuffer":{"type":"Buffer","data":[212,125,107,197,44,168,100,212,159,170,27,248,185,35,190,149,218,206,26,238]},"announce":[],"urlList":[]}}