{"title":"Mary Higgins Clark - Two Little Girls in Blue","uid":7861824,"size":279089584,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d4aa1234d7f19c0b0ff2b4fb1764ff57f3e9f730&amp;dn=Mary+Higgins+Clark+-+Two+Little+Girls+in+Blue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BosuxRedsux","files":-1,"time":1353951319,"description":"In a riveting new thriller, worldwide bestselling suspense writer Mary Higgins Clark weaves the mystery of twin telepathy into a mother's search for a kidnapped child, presumed dead.\nMargaret and Steve Frawley celebrate the third birthday of their twin girls, Kelly and Kathy, with an afternoon party in their new home, a modest fixer-upper in Ridgefield, Connecticut.\n\nThe evening of the twins' birthday party, Steve and Margaret attend a black-tie dinner in New York. When they return home, the police are in the house, and they are told that the babysitter had been found unconscious, the children are gone, and a note demanding an eight-million-dollar ransom had been left in their room.\n\nSteve Frawley's firm, a global investment company, agrees to pay the ransom. The kidnapper, who identifies himself as the &quot;Pied Piper,&quot; makes his terms known -- on delivery of the ransom, a call will come, revealing the girls' whereabouts. The call comes, but only Kelly is in the car parked behind a deserted restaurant. The driver is dead from a gunshot wound and has left a suicide note, saying he had inadvertently killed Kathy and had dumped her body in the ocean.\n\nAt the private memorial Mass for Kathy, Kelly tugs Margaret's arm and says: &quot;Mommy, Kathy is very scared of that lady. She wants to come home right now.&quot; More unexplainable occurrences follow, indicating that Kelly is in touch with Kathy. At first, no one except the mother believes that the twins are communicating and that Kathy is still alive. As Kelly's warnings become increasingly specific and alarming, however, FBI agents set out on a search for Kathy. The novel reaches a breathtaking climax as they close in on the Pied Piper and his accomplices, while Kathy's life hangs by a thread.\n\nIn delving into the well-documented but still unexplained phenomenon of twin telepathy, Mary Higgins Clark tells a spellbinding tale that takes us deep into the minds of her characters while lifting us to the heights of suspense.","torrent":{"xt":"urn:btih:d4aa1234d7f19c0b0ff2b4fb1764ff57f3e9f730","amp;dn":"Mary+Higgins+Clark+-+Two+Little+Girls+in+Blue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4aa1234d7f19c0b0ff2b4fb1764ff57f3e9f730","infoHashBuffer":{"type":"Buffer","data":[212,170,18,52,215,241,156,11,15,242,180,251,23,100,255,87,243,233,247,48]},"announce":[],"urlList":[]}}