{"title":"Voodoolulu","uid":10283582,"size":35725547,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d5997c94661a2ab84ca14c2c25b405c01b8f71e4&amp;dn=Voodoolulu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"H2oDragon","files":14,"time":1401747795,"description":"Tony Mendola here. I met Voodoolulu (the white-girl-rapper, with the band/album of the same name) in Manhattan, NYC, US, and one time I even played conga drums for her at one of the many bars or performance spaces in Manhattan. It was long ago. Maybe she has kids by now, or maybe she's a famous rock star... I dunno! I think she was my friend and then we lost touch. Anyway, if anyone knows her, please ask her to e-mail me (still in manhattan) 1 347 664 4237 \n\nThey are mighty-good songs. Fresh and Delishussss  is my fave tune, and features an albino-black comic-rapper (whose name I totally forgot.) \nLulu is always accompanied by a straight singer, not a rapper, from Israel, transplanted to nyc, a girl who has a nice voice. \nAlso, check out Evil Time, about that thing that happens around once a month for the ladies. I don't know of anyone who sings about it besides lulu and her sidekick, the israeli lady. \nThere is also something called   Ignorance (interlude) which is girls talking about guys who don't know how to talk to the female half of the species without whistling, barking, or calling them  &quot;b-b-bitc...the b word.)\nI guess female rappers are mad at male rappers who don't know how to talk to the ladies / women. \nAnd, as always, please remember to seeeeed, to keep it going.\nThanx.\n \n  ","torrent":{"xt":"urn:btih:d5997c94661a2ab84ca14c2c25b405c01b8f71e4","amp;dn":"Voodoolulu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5997c94661a2ab84ca14c2c25b405c01b8f71e4","infoHashBuffer":{"type":"Buffer","data":[213,153,124,148,102,26,42,184,76,161,76,44,37,180,5,192,27,143,113,228]},"announce":[],"urlList":[]}}