{"title":"True Love Next Door + Special Bonus Disc TV Series [Thai Movie]","uid":6338107,"size":26668357632,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d5ac04a35d85ddc0dc53618e88f82b7f444f67ba&amp;dn=True+Love+Next+Door+%2B+Special+Bonus+Disc+TV+Series+%5BThai+Movie%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"poothaijaa","files":-1,"time":1303548514,"description":"Title: True Love Next Door\nGenre: Comedy / Sitcom\nBroadcast TV\nStarring: Paula Taylor, Sunny Suwanmethanon\n &lt;a href=&quot;\nhttp://www.viki.com/channels/2690-true-love-next-door&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.viki.com/channels/2690-true-love-next-door&lt;/a&gt;\n\nSynopsis\n\n&quot;True Love Next Door&quot; is a very popular Sit-Com in Thailand in which it always brings laughter and smile to the viewers. For Sit-Com &quot;True Love Next Door&quot;, it's about KwanJai (acted by Paula Taylor) the soon-to-be-bride whose luck is worse than a rotten egg when her groom vanished only one day before the wedding day. Her best friend, Thida (acted by Opal Pimparu) a fortune teller who is also her roommate has to fortune tell KwanJai's love in the future and it turned out that KwanJai's soul mate is the one who live next door. But the right.. or the left side, they don't know.\n\nKwanJai's chaotic love with two different style men who live next door has started. Who would her soul mate be between Joe (acted by Sunny Suwanmetanon), KwanJai's best friend since kindergarten, an annoying musician who has a bad mouth or Vee (acted by Thanakorn Shinkurn), a nerdy who is crazy about science to the point where he invented weird invention to get a girl. Who really is KwanJai's soul mate, let's we all go and find out.\n\nMain Characters\n\nKwanJai - a beautiful unlucky English-Thai woman, her dream is to be an actress but so far she had never pass any audition. She's well known among her friend for her weak Thai. She's optimistic and cheerful. Her dad is an ambassador, therefore he's not living in Thai.She lives in room 602 in Sawasdee Thaweesuk Condominium.\n\nJoe - a dirty, straightforward man who doesn't consider people's feeling with his word. He just said what he thinks. He's a musician who earn very little and live in the cheapest room, 601. He's a playboy and an easy going man. Even though his mouth is bad, but he has a good heart(?).\n\nVee - a nerdy who is crazy about science. He's a mc for a science television program for kids. He just moved in to the room 603. He fell in love with KwanJai the very moment he saw her. He's smart, kind and has this geeky personality. He always ask his mom advice for every decision he makes.\n\nThida - KwanJai's best friend since kindergarten. She's a fortune teller and a columnist for horoscope column in a magazine. She's a daughter of a tradition family who live in Sukothai (old capital city in Thailand). She has the personality of a traditional Thai woman and is also living in room 602.\n\n\nTonKao - KwanJai's gay friend. He own the laundry and the convenient store in Sawasdee Thaweesuk Condominium. He always fight with his twin brother, Tor. He always help his friend when they need him.\n\nTor - TonKao's twin brother. Despite his twin brother being a gay, he hates gay. He's a dump guy and always get in a fight. He's a Sawasdee Thaweesuk Condominium's technician where he go around and fix things. He's also Joe's best friend.\n\nRuj - Sawasdee Thaweesuk Condominium's owner. He's very strict with money and has a very weird personality. He can change into three characters; Ruj, the condominium's owner, P'Ruj, the condominium's guard and Aunt Rujee, the condominium's maid. As mentioned, he's a weird guy who can transform into three characters.\n\n\n","torrent":{"xt":"urn:btih:d5ac04a35d85ddc0dc53618e88f82b7f444f67ba","amp;dn":"True+Love+Next+Door+%2B+Special+Bonus+Disc+TV+Series+%5BThai+Movie%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5ac04a35d85ddc0dc53618e88f82b7f444f67ba","infoHashBuffer":{"type":"Buffer","data":[213,172,4,163,93,133,221,192,220,83,97,142,136,248,43,127,68,79,103,186]},"announce":[],"urlList":[]}}