{"title":"Sunday Driver - The story of Santana &amp; The Compton Majesctics","uid":3941439,"size":729970493,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d6a7e0610c0aed6e66de142442d76e9e8385b748&amp;dn=Sunday+Driver+-+The+story+of+Santana+%26+The+Compton+Majesctics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stetco86","files":15,"time":1198171752,"description":"For all the Low Rider fans.\n\nFor somebody raised in the &quot;hood,&quot; it's always about respect. That's the case with 38-year-old &quot;Gangster&quot; of Compton, California. Being raised in the streets of Compton, he quickly earned a reputation and a nickname that earned him respect. Gangster uses the same mentality when building cars. He knew that he had to earn \nthe respect of the lowriding community, which he did with a few street rides. After stepping up and becoming the president of the Majestics Car Club's Compton chapter, Gangster wanted to build a car that everybody would remember and respect.\n\nGangster began with an abandoned '64 Chevy Impala that he found in a Compton backyard. The four-year project that resulted in the beautiful &quot;Santana&quot; car got off the ground at Compton Hydraulics, where Kevin Smith was left in charge. Only after he fully wrapped the Canadian frame on the Impala hardtop in 1/4-inch plate, did Kevin build the four-pump setup using all-chrome Hi-Low pumps and OG Adel aircraft dumps with 8-inch and 10-inch Red's cylinders for the front and rear respectively. Kevin powered the system with eight Trojan 31-series batteries \nthat were fused with 12 Ford solenoids. The setup was test fitted and then pulled out and chromed before being reinstalled after the car was painted and completed.\n\nWhile at Compton Hydraulics, Gangster had &quot;Doc&quot; take the car down to metal and build it back up in primer. Once sealed and primered, Doc blocked the car straight and left it ready for the PPG pearl white base that serves as \nthe foundation for the acrylic enamel multicolor (black, blue, violet, gray and fuchsia) paint job. Doc is known for his pearl graphics and he laid out a few subtle designs that complemented the 42-inch moonroof installed by Sunroof Performers of South Gate, California, as well as the chrome floorboards and the firewall that also had a few pearl tape shades added.\n\nNext on Gangster's agenda was to take the car to his buddy &quot;Dogface&quot; at Backyard Boogie in Compton, who did an engine swap on the car. Dogface pulled out the stock 283-c.i.d. engine and replaced it with a 350-c.i.d. Camaro small-block of '85 vintage. Dogface dressed the engine with chrome alternator, brackets, headers, intake, valve covers and exhaust, and then painted it to match the exterior. While at Dogface's place, Gangster also had him drop the suspension and then send it out to Danny at the Bumper Shop in Los Angeles, California, who took credit for all of the chrome.\n\nWhen it was time to put a set of &quot;shoes&quot; on Santana, Gangster shot for an OG look and had a set of 5.20 Premium Sportways mounted on 13-inch 100-spoke chrome Zenith wire wheels. The car was ready to roll, but what good's cruising without music? Gangster knew that he wanted a good sound system so he went to  Extreme Audio in Orange County for more bang for his buck. Once wired up, Santana was returned to Kevin at Compton Hydraulics, who handled the original-stitch interior kit that was bought from the boys at CARS, Inc. of Fullerton, California.\n\nFour years in the making, Santana was a big hit on the show circuit as well as on the street scene, thus earning Gangster the respect of both communities. His dream of earning a Lowrider Magazine cover for his club has finally come true. We hope to see more Majestics members follow Gangster's example and step up to full feature status on the pages of the magazine\n","torrent":{"xt":"urn:btih:d6a7e0610c0aed6e66de142442d76e9e8385b748","amp;dn":"Sunday+Driver+-+The+story+of+Santana+%26+The+Compton+Majesctics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6a7e0610c0aed6e66de142442d76e9e8385b748","infoHashBuffer":{"type":"Buffer","data":[214,167,224,97,12,10,237,110,102,222,20,36,66,215,110,158,131,133,183,72]},"announce":[],"urlList":[]}}