{"title":"[NubileFilms] Presley Hart (Unwrapped / 03.23.2015)","uid":11773508,"size":177830789,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:d723652518debf40c71e4de972966ce171f12367&amp;dn=%5BNubileFilms%5D+Presley+Hart+%28Unwrapped+%2F+03.23.2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"chkm8te","files":1,"time":1427169960,"description":"[NubileFilms] Presley Hart (Unwrapped / 03.23.2015)\n\nLovely Presley Hart is back from a shopping adventure, and she wants to show Logan Pierce what she bought! She's already wearing her brand new bra and sheer thong, and Logan is happy to tell her with his kisses that he definitely approves.\n\nPushing Logan to the couch, Presley lets her lover know that she's currently in charge. The feisty brunette moans her pleasure as Logan pulls off her bra and feasts on her heavy breasts. She wants to put her mouth to work, too, so she pulls out Logan's erection and samples the head of his dick with a lick and a smile before diving in for a full-out cock sucking.\n\nNow it's Logan's turn to worship Presley's stunning body again, and as soon as he gets her out of her thong he goes to work. He starts with his fingers, testing the wetness of Presley's shaved slit before he replaces his digits with his talented mouth. Once he has warmed her up by licking and sucking her clit, Logan gives Presley every inch of his big dick by spooning with her and sliding his cock home into her tight warmth.\n\nAlways a fan of going for a stiffie ride, Presley doesn't hesitate to take control back so that she can set the pace with her lush ass and hips. Soon, though, the horny hottie finds herself on her hands and knees while Logan delivers the pussy pounding that she craves until she is screaming her climax!\n\nAfter enjoying one more tremoring release thanks to her reverse cowgirl ride, Presley gives her full attention to bringing Logan to his climax. Using her generous mouth and magic hands, she brings him all the way to his inevitable release until he spills his seed all over Presley's tongue and hands in a mess that she is only too happy to lick up.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=d8hfegv7vffo0gac3hot.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=d8hfegv7vffo0gac3hot.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=2ili5rzstkh0tc27x5e6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=2ili5rzstkh0tc27x5e6.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:d723652518debf40c71e4de972966ce171f12367","amp;dn":"%5BNubileFilms%5D+Presley+Hart+%28Unwrapped+%2F+03.23.2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d723652518debf40c71e4de972966ce171f12367","infoHashBuffer":{"type":"Buffer","data":[215,35,101,37,24,222,191,64,199,30,77,233,114,150,108,225,113,241,35,103]},"announce":[],"urlList":[]}}