{"title":"Purpose of Life.avi","uid":3649603,"size":1074067456,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d747a994da2ea3bb9e9e1f88afd31f7299784f7e&amp;dn=Purpose+of+Life.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"QDJMan","files":1,"time":1175115502,"description":"Unfortunately, when you ask most people the question: &quot;What is the purpose of life?&quot; (such a fundamental and important question), they will not tell you what they have concluded through observation or analytical reasoning. Rather, in most cases, they will simply tell you what someone else said, or they will tell you what is &quot;commonly presumed&quot; by others, i.e., What my father said purpose of life is, what the minister of my church said the purpose of life is, what my teacher in school said, what my friend said, etc. If I ask anyone about the purpose of eating or why do we eat, everyone will say [in one word or another] that it is for nutritional purposes, because nutrition sustains life. If I ask anyone why they work, they will say because it&amp;#039;s a necessity in order to support themselves and to provide for the needs of their families. If I ask anyone why they sleep, why they wash, why they dress, etc., they will answer with appropriate answers, for these are common necessities for all human beings. We can follow this line of questioning with a hundred questions and receive the same or similar answers from anyone in any language from any place in the world. Then I ask you the question: Why, when we ask the question, &quot;What is the goal and purpose of life?&quot; that we get many different answers? It is because people are confused; they don&amp;#039;t really know. They are stumbling in the dark, and rather than say, &quot;I don&amp;#039;t know&quot;; they just offer any answer they have been programmed to give. Think about it. Is our purpose in this world simply to eat, sleep, dress, work, acquire some material things and enjoy ourselves? Is this our purpose? Why are we born? What is the object of our existence? What is the wisdom behind the creation of man and this tremendous universe?","torrent":{"xt":"urn:btih:d747a994da2ea3bb9e9e1f88afd31f7299784f7e","amp;dn":"Purpose+of+Life.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d747a994da2ea3bb9e9e1f88afd31f7299784f7e","infoHashBuffer":{"type":"Buffer","data":[215,71,169,148,218,46,163,187,158,158,31,136,175,211,31,114,153,120,79,126]},"announce":[],"urlList":[]}}