{"title":"wikipedia-en_childrens_cd_2006.01.pdb","uid":3563076,"size":44752391,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d8bd0b94e8673a30b927b5dc4614cb673c23f166&amp;dn=wikipedia-en_childrens_cd_2006.01.pdb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"oneeyeisbetter","files":2,"time":1164272374,"description":"The CD contains 2000 hand-picked articles of particular interest to schools or children (Geography, Science, Dinosaurs, Plants and Animals). The articles were hand selected off the \n\nEnglish Wikipedia by volunteers working for SOS Children, checked for suitability to children and cleaned by hand and script. The CD includes only thumbnails of images. \n\nWikipedia user Wikiwizzy converted the wikipedia portion to Plucker database to carry on SD card for Palm Pilot. Pictures were downsized to 150x150, 8 bit color.\n\nThe detailed process for original CD production was:\n\nAbout 2500 articles were chosen from good articles, featured articles and major lists (e.g. all countries, all capital cities, etc.)\n\nRubbish, schoolchild tump, disambiguation pages and shallow pages were discarded and redirects sorted.\n\nPrevious consensus versions were taken where articles had disputed flags (e.g. Christianity etc)\n\nLinks to articles not included and external links were rendered as texts.\n\nEmpty, link-list and silly sections were removed (using volunteers to list them).\n\nEditorial notices and notes, links to other languages etc were removed.\n\nThe WP logo was removed as SOS did not have permission to use it. Permission has since been granted and the 2007 Selection will have the Wikipedia logo on it.\n\nThe only added content into the WP pages is small box notices on about 130 pages which have a particular relevance to SOS Children (e.g. many of the 125 countries where SOS \n\nworks, see for example Africa). These comply with best practice of not interfering with editorial content of articles.\n\nThe resulting version fits on a CD together with the SOS Children website which is offered for free download or free CD for collection only.\n\nAutomated spelling correction was run.\n\n*Source: http://fixedreference.org/2006-Wikipedia-CD-Select/\t\n*Wikipedia Editor: BozMo\n\n*Converted File format: Plucker PDB. Plucker is a free document viewer.\n*Wikipedia Editor: Wikiwizzy\n*Source: ftp://ftp.wizzy.com/pub/wizzy/palm/Wikipedia.pdb\n*Uploaded Filename: wikipedia-en_childrens_cd_2006.01.pdb \n\n*Wikipedia Project: Wikipedia:Version_1.0_Editorial_Team/Torrent_Project\n*ed2k://|file|2006%20Wikipedia%20CD%20Selection.pdb|44749941|AF50991BFDC604F6B6D0612A269A0981|h=UCCFEOMP6U4UGIR36D2GFUPKLF2MM3KW|/\n\n*You can help. Seed this torrent. Join us at http://en.wikipedia.org/wiki/Wikipedia:Version_1.0_Editorial_Team/Torrent_Project\n","torrent":{"xt":"urn:btih:d8bd0b94e8673a30b927b5dc4614cb673c23f166","amp;dn":"wikipedia-en_childrens_cd_2006.01.pdb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8bd0b94e8673a30b927b5dc4614cb673c23f166","infoHashBuffer":{"type":"Buffer","data":[216,189,11,148,232,103,58,48,185,39,181,220,70,20,203,103,60,35,241,102]},"announce":[],"urlList":[]}}