{"title":"The Elements of Photography {BBS}","uid":7448897,"size":34019692,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d955bd7f2ff11a013a886b57ccd8073b972705d7&amp;dn=The+Elements+of+Photography+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1342452333,"description":"Photography is a complex craft. Some excel at the technical side of image-making, focusing perfectly on the subject, releasing the shutter at just the right moment and making exposures with the precise amount of light. Others are artists and storytellers, capturing a fleeting moment in time which inspires a viewer to gaze upon an image and ponder its meaning. The best photographers are masters of both.\n\nIn this highly visual, informative book, Angela Faris Belt discusses the four crucial elements of photography that are essential for successful technical and conceptual image-making:\n\n.the photographic frame and its borders\n.quality of focus as determined by the aperture or lens\n.shutter speeds and their effects in relation to time and motion\n.the physical media used to create the aggregate image\n\nStep-by-step guidance including informative screen shots, traditional darkroom and Photoshop techniques, suggested exercises, and before and after images help both film and digital photographers improve their skills, learn new techniques, and better understand their craft. More than 300 stunning, full color images and portfolios featuring the work of over 40 prestigious artists provide visual inspiration as well as a gorgeous collection of artwork for photography enthusiasts.\n\n*Learn from an expert author how to combine your creative vision with technical accuracy to produce images that are visually provoking as well as technically inspiring\n*Includes over 300 stunning full color images and highlights the portfolios of 40+ prestigious artists\n*Contains screenshots, before-and-after images, and how-to information to help both students and photographers practice skills and learn new techniques\n*Follow the suggested exercises at the end of each chapter to develop your own portfolio of images\n\n\n\n# Paperback: 384 pages\n# Publisher: Focal Press; 1 edition (January 29, 2008)\n# Language: English\n# ISBN-10: 0240809424\n# ISBN-13: 978-0240809427","torrent":{"xt":"urn:btih:d955bd7f2ff11a013a886b57ccd8073b972705d7","amp;dn":"The+Elements+of+Photography+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d955bd7f2ff11a013a886b57ccd8073b972705d7","infoHashBuffer":{"type":"Buffer","data":[217,85,189,127,47,241,26,1,58,136,107,87,204,216,7,59,151,39,5,215]},"announce":[],"urlList":[]}}