{"title":"Nonlinear Optics: Principles and Applications [2014] [PDF]","uid":12410429,"size":3514478,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9978e36e1a2de4edbb7c1a0ed25439073e892af&amp;dn=Nonlinear+Optics%3A+Principles+and+Applications+%5B2014%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1442144750,"description":"Title: Nonlinear Optics: Principles and Applications \nSeries: Optical Sciences and Applications of Light (Book 3) \nAuthor: Karsten Rottwitt, Peter Tidemand-Lichtenberg \nFormat: PDF \nHardcover: 349 pages \nPublisher: CRC Press; 1 edition (November 14, 2014) \nLanguage: English \nISBN: 978-1466565821 \n\n\nAs nonlinear optics further develops as a field of research in electromagnetic wave propagation, its state-of-the-art technologies will continue to strongly impact real-world applications in a variety of fields useful to the practicing scientist and engineer. From basic principles to examples of applications, Nonlinear Optics: Principles and Applications effectively bridges physics and mathematics with relevant applied material for real-world use. The book progresses naturally from fundamental aspects to illustrative examples, and presents a strong theoretical foundation that equips the reader with enough knowledge to recognize, understand, and evaluate nonlinear optical phenomena.\n\nStructured so that the first five chapters are dedicated to the description of the fundamental formalism of nonlinear optics, and the last five chapters are devoted to a description of practical devices based on nonlinear phenomena, it describes nonlinear wave propagation in bulk and in waveguiding structures, and includes specific examples of applied nonlinear wave propagation through crystals, optical waveguides, and optical fibers. Providing a theoretical description of nonlinear interaction between light and matter, this text focuses on the physical understanding of nonlinear optics, and explores optical material response functions in the time and frequency domain.\n\nThis pivotal work contains ten chapters and the main applications include:\n\n- Optical signal processing: parametric amplification, modulators\n- Transmission of optical signals: optical solitons, cross-phase modulation, four-wave mixing, phase conjugation, Raman scattering\n- Sensing: temperature sensors, spectroscopy, and imaging\n- Lasers: pulse compression and generation of super continuum\n- Nonlinear Optics: Principles and Applications describes the fundamental aspects of nonlinear optics and serves as a reference for nonlinear optics professionals as well as graduate students specializing in nonlinear optics","torrent":{"xt":"urn:btih:d9978e36e1a2de4edbb7c1a0ed25439073e892af","amp;dn":"Nonlinear+Optics%3A+Principles+and+Applications+%5B2014%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9978e36e1a2de4edbb7c1a0ed25439073e892af","infoHashBuffer":{"type":"Buffer","data":[217,151,142,54,225,162,222,78,219,183,193,160,237,37,67,144,115,232,146,175]},"announce":[],"urlList":[]}}