{"title":"Conspiracy of Fools by Kurt Eichenwald","uid":11415872,"size":880776577,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:dadf6e852200daa509ff7d3dabb39fa73f3be665&amp;dn=Conspiracy+of+Fools+by+Kurt+Eichenwald&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prunedanish","files":26,"time":1415583081,"description":"Enron was a $100-billion-a-year company in October 2001--America's seventh-largest. The Houston-based energy firm enjoyed warm ties with newly installed President George W. Bush. Earnings were up 26 percent from the previous quarter, while Fortune magazine had named Enron the country's most innovative company six years in a row. Less than two months later, Enron filed for bankruptcy in the biggest corporate failure in history. Enron became synonymous with the greed and fraud of the go-go high-tech stock bubble of the late 1990s--the worst of a series of spectacular corporate collapses that also took down WorldCom, Tyco, and Global Crossing.\n\nWhat went wrong? Veteran New York Times financial journalist Kurt Eichenwald does an epic job of telling Enron's story in his 742-page tome Conspiracy of Fools. Eichenwald, a finalist for the Pulitzer Prize in 2000, also authored The Informant, an acclaimed account of a vast international price-fixing scandal at Archer Daniels Midland. Conspiracy of Fools tells the Enron tale with a cinematic narrative style, relying almost exclusively on scene and dialogue to bring his account to vivid life. We see how federal regulators opened the doors for the Enron fraud early on when they let the company loosen up its accounting rules and essentially cook its books. We read how Enron bullied Wall Street firms into issuing favorable reports about its share price by threatening to take away lucrative banking fees. Eichenwald also reveals how Enron manipulated electricity prices during the California energy crisis of 2000. Eichenwald's book is less successful in situating the Enron debacle in its wider context--the cycle of market speculation that reached a historic summit in the dot-com bubble. Was Enron just a cautionary sign of the greed and lack of ethics of a few bad apples, or was it more symptomatic of an entire market system","torrent":{"xt":"urn:btih:dadf6e852200daa509ff7d3dabb39fa73f3be665","amp;dn":"Conspiracy+of+Fools+by+Kurt+Eichenwald","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dadf6e852200daa509ff7d3dabb39fa73f3be665","infoHashBuffer":{"type":"Buffer","data":[218,223,110,133,34,0,218,165,9,255,125,61,171,179,159,167,63,59,230,101]},"announce":[],"urlList":[]}}