{"title":"Taylor Swift - Fearless  (2nafish)","uid":5406525,"size":185524228,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:daf29f08eba11205787bafedfdf00e47bf1a658d&amp;dn=Taylor+Swift+-+Fearless++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1267616606,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Fearless&quot; is a song by American country pop singer Taylor Swift which was a promotional single from her album Fearless. It was released on October 14, 2008, on iTunes, and became her third top-ten hit on the Billboard Hot 100 chart, where it debuted at number nine. At the time, this is Swift's highest debut on the chart, before the single &quot;Today Was a Fairytale&quot; debuted at number two. The song actually her fourth-highest career peak. Swift debuted the song with a performance on November 10, 2008 at the Late Show with David Letterman. The song was later released to country radio on January 4, 2010 as the fifth single from the album. Fearless was the first song in the history of Billboard to be certified Gold before officially being released. As of the chart issue of 20th February 2010 on the Billboard Hot 100, Fearless has re-entered at 99.\n\nOn February 17, 2010 a music video was released containing clips of the 2009 Fearless Tour. It was directed by Todd Cassety. It showed backstage clips as well as several performances, including her singing the song itself.\n\nFearless is the second studio album by American country pop artist Taylor Swift, and was released on November 11, 2008 on Big Machine Records. The album debuted at number one on the U.S. Billboard 200, selling 592,304 copies in its first week, the best first-week sales for a female artist in 2008. Fearless became the first album to sell one million copies in 2009. As of February 18, 2010, the album has been certified 6x Platinum by the RIAA, and has sold over 8 million copies worldwide.\n\nThe album's lead single, &quot;Love Story&quot;, was her first song to achieve commercial success outside the United States; it reached number one in Australia,three in New Zealand[ and number two in the United Kingdom. The third single, &quot;You Belong with Me&quot;, has become the biggest hit of Swift's career domestically, and became the highest charting country single since 2009, peaking at number two on the Billboard Hot 100. The album topped the Billboard 200 for 11 non-consecutive weeks and topped the Billboard Top Country Albums for 35 non-consecutive weeks. The album was re-released as Fearless: Platinum Edition with six new songs on October 26, 2009.\n\nOn December 2, 2009, Fearless received 8 nominations for the 52nd Grammy Awards: Album of the Year and Best Country Album for Fearless, Song of the Year, Record of the Year and Best Female Pop Vocal Performance for &quot;You Belong with Me&quot;, Best Female Country Vocal Performance and Best Country Song for &quot;White Horse&quot;, and Best Pop Collaboration with Vocals for &quot;Breathe&quot; featuring Colbie Caillat.\n\nOn January 6, 2010, Billboard.com officially announced that Fearless was the top-selling album of 2009 in the U.S.\n\nSwift won Album of the Year, Best Country Album, Best Country Song and Best Female Country Vocal Performance at the 52nd Grammy Awards on January 31, 2010. This win makes Swift the youngest person ever to win a Grammy for Album of the Year, eclipsing Alanis Morissette's win for Jagged Little Pill at the age of 21. Fearless was also the first album in history to win the American Music Award (AMA), Academy of Country Music Award (ACM), Country Music Association Award (CMA), and the Grammy Award for Album of The Year in the same year.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:daf29f08eba11205787bafedfdf00e47bf1a658d","amp;dn":"Taylor+Swift+-+Fearless++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daf29f08eba11205787bafedfdf00e47bf1a658d","infoHashBuffer":{"type":"Buffer","data":[218,242,159,8,235,161,18,5,120,123,175,237,253,240,14,71,191,26,101,141]},"announce":[],"urlList":[]}}