{"title":"Death Angel - The Art Of Dying (Flac)","uid":4795202,"size":423818844,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:db21a3b2a0b3f3e9af13ffb8dc5786a9fd44f4f5&amp;dn=Death+Angel+-+The+Art+Of+Dying+%28Flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"butcherboys","files":-1,"time":1237852237,"description":"Artist: Death Angel\nAlbum: The Art Of Dying\nRelease: 2004\nGenre: Thrash Metal\nBitrate: Flac Level 8\nRecording Company: Nuclear Blast\n=====================================\nTrack List:\n\n1. Thrown To The Wolves\n2. 5 Steps Of Freedom\n3. Thicker Than Blood\n4. The Devil Incarnate\n5. Famine\n6. Prophecy\n7. Spirit\n8. IV\n9. Land Of Blood\n10. Never Me\n11. Word To The Wise\n\n=====================================\n\nCurrent Members\n\n   * Sammy Diosdado Jan 2009 - Present (Bass)\n   * Andy Galeon - SWARM, THE ORGANIZATION (Drums)\n   * Gus Pepa - THE ORGANIZATION   (Guitar)\n   * Rob Cavestany - SWARM, THE ORGANIZATION (Guitar / Vocals)\n   * Mark Osegueda - ALL TIME HIGHS, SWARM, NUCLEAR BLAST ALLSTARS    (Vocals)\n\nPast Members:\n\n   * Dennis Pepa - THE ORGANIZATION (Bass)\n====================================\n\n[quote]DEATH ANGEL excited Thrash Metal fans with their arrival in 1987 as the latest export from the rapidly expanding Bay Area Metal scene that threatened to engulf the world in the late 80's. The Filipino act, originally comprising teen cousins guitarist Rob Cavestany, Dennis Pepa on bass, Andy Galeon on drums, marked their individuality with a good degree of technicality and soon carved out a niche fanbase on the San Francisco Metal scene. Although the band came together in 1982, very briefly being billed as DARK THEORY prior to adopting the DEATH ANGEL title from a book cover, it would be five years before their first album the widely admired 'The Ultra-Violence'.\n\nThe youngsters performed in the clubs initially as a standard Heavy Metal covers act, tackling tracks by artists such as JUDAS PRIEST, OZZY OSBOURNE, SCORPIONS, KISS, TYGERS OF PAN TANG and IRON MAIDEN. The trio became a quartet by introducing Dennis Pepa's brother Gus on second guitar. DEATH ANGEL's recording debut came during 1983 with the four song demo 'Heavy Metal Insanity'. Produced by Matt Wallace, quite incredibly drummer Andy was a mere 9 years old at the time of recording. At this juncture Rob Cavestany handled lead vocals. The band took on Kat Sirdorfsky as their manager and began a shift towards Thrash Metal, admitting new found influences from METALLICA, who the group supported at San Francisco's Kabuki Theatre in 1985, EXODUS and MERCYFUL FATE. Inducting new frontman Mark Osegueda, another family member, the new look DEATH ANGEL debuted as support to MEGADETH at The Stone in San Francisco on November 24th 1984. The 1985 follow up, entitled 'Kill As One', was notably produced by METALLICA guitarist Kirk Hammett. This fact alone provoked curiosity amongst the labels and DEATH ANGEL would be on the receiving end of offers from Enigma Records, Black Dragon in France and Combat Records.\n\nDEATH ANGEL put their signatures down with Enigma Records to cut 'The Ultra-Violence' album, working with Davy Vain from VAIN as co-producer, during June of 1986. Underground tape traders circulated demos for the album well upfront of the actual release date, generating a fervour of interest for the band world-wide and this reputation was enhanced by East Coast dates supporting SLAYER. The album finally emerged in April 1987, being licensed to Music For Nations subsidiary Under One Flag for European issue. North American roadwork saw the band appearing at the 'Milwaukee Metalfest' event, capitalised on by package touring with BLOODFEAST and Canadian shows with SACRIFICE. The group's first live campaigning in Europe took place in September 1987.\n\nThe group laid down tracks for the Enigma released, near-concept 'Frolic In The Park' album, once again co-produced by Davy Vain, to close out 1987. Back in Europe, DEATH ANGEL embarked upon a further headline tour in June 1988 upfront of the September album release. CD issues of 'Frolic In The Park' hosted bonus tracks with 'Devil's Metal' and a cover rendition of the KISS classic 'Cold Gin'. MTV aided the group's national profile by plugging a video for the song 'Bored'. US concerts had the band traversing the country with RIGOR MORTIS. Still on the touring front, the group returned to Britain in December same year to support MOTÃˆÂªRHEAD for a brace of gigs at London's Hammersmith Odeon.\n\nDEATH ANGEL then hooked up with Geffen Records to release third studio opus 'Act III', this Max Norman produced album benefitting hugely from MTV exposure afforded to promotional videos for the tracks 'Seemingly Endless Time' and 'Room With A View'.\n\nDEATH ANGEL hit Europe once again in mid 1990, a lengthy European tour seeing FORBIDDEN and VICIOUS RUMORS as support. Significantly, the band was also picked to headline the gargantuan 'Dynamo' festival in Holland. Debut Japanese shows took place in July, capitalised on by US concerts with FORBIDDEN in tow once again. However, band activities were suspended when, touring with CHRIS POLAND as opening act, the band were involved in a road accident in Arizona, hospitalizing vocalist Mark Osegueda, who lost parts of his toes, and drummer Andy Galeon. The latter's head injuries seriously affected his brain and recovery period took well over a year. Members of the Thrash community, including musicians from EXODUS, METALLICA, HEATHEN, FORBIDDEN rallied round to swiftly put on a benefit at The Omni venue in Oakland to raise funds to cover medical bills.\n\nA quick-fire live album, 'Fall From Grace' captured on tape at the Amsterdam Paradiso on July 9th 1988, emerged through Roadracer in December 1990. This product was withdrawn due to objections from the band.\n\nThe group pulled in ex-ATTITUDE ADJUSTMENT drummer Chris Kontos to cover for Galeon and put in a second Japanese tour in April 1991. During this time, Geffen records, believing the name DEATH ANGEL was detrimental to the band's interests, attempted to market the band under the abbreviated moniker of D.A. to promote the band through radio play but found little interest and subsequently dropped the band. The group soldiered on performing acoustic sets billed as THE PAST but enduring a further setback Osegueda departed in the same year, relocating to New York and retiring from the music business, leaving guitarist Rob Cavestany to handle lead vocals once again. By the end of the year the band were going under a new title THE ORGANIZATION releasing two albums 1994's 'Free Burning' and the follow up 'Savor The Flavor'. THE ORGANIZATION folded in 1995. Dennis Pepa subsequently created THICK AS THIEVES. During 1999 Osegueda, Cavestany and Galeon created SWARM with new bassist Michael Isaiah.\n\nDEATH ANGEL buried the hatchet in August 2001 re-uniting for a one off gig at the 'Thrash Of The Titans' festival in aid of TESTAMENT frontman Chuck Billy's cancer treatment fund. DEATH ANGEL put in a 'secret' gig at The Pound venue in San Francisco in early July. Supported by DEPRESSOR, DEATH ANGEL, including stand in touring guitarist Ted Aguilar of S1FT, went under the pseudonym of KILL AS ONE. The band would also participate at the famed Dynamo Open Air festival in Holland and put on a pre event show at the Efenaar club in Eindhoven with SWARM, the side act of Andy Galeon, Rob Cavestany and Mark Osegueda acting as support.\n\nThe band's continuing resurgence would be further progressed as DEATH ANGEL were confirmed as participants in the April 2003 European 'No Mercy' festivals. The group formed up part of a heavyweight billing comprising TESTAMENT, MARDUK, DIE APOKALYPTISCHEN REITER, NUCLEAR ASSAULT, PRO-PAIN, MALEVOLENT CREATION, DARKANE, and CALLENISH CIRCLE.\n\nDEATH ANGEL signed a multi-album record deal with Nuclear Blast Records in October of 2003, recording the comeback 'The Art Of Dying' set at SF Soundworks studios in San Francisco, California with producer Brian Joseph Dobbs. The band also laid down a version of METALLICA's 'Trapped Under Ice', contributed to the Big Deal Records tribute 'Metallic Attack'. Thankfully, the advent of 'The Art Of Dying' in April 2004 triggered a sustained, and long overdue, live strategy.\n\nTouring plans for the Autumn saw the band joining up with the DANZIG headed 'Blackest Of The Black' tour, organised by Glenn Danzig and comprising DOYLE, featuring ex-MISFITS guitarist Doyle, Norwegian Black Metal pioneers MAYHEM, DEVILDRIVER and EYES OF FIRE. However, with just days to go before these dates the entire tour was abrutly cancelled.\n\nThe band allied themselves with TESTAMENT, FLOTSAM AND JETSAM and OVERKILL for a 'Thrash Domination 04' Japanese tour in September before unexpectedly announcing a hook up as openers to the DEFTONES on a burst of West Coast dates commencing 28th September at the House Of Blues in Los Angeles. However, the band was pulled from these shows, apparently because this news was leaked prematurely.\n\nAn extensive run of European headliners announced November caught DISBELIEF, DARKANE, MYSTIC PROPHECY and MNEMIC as support. However, this trek was cancelled just days before its launch date. December gigs were then announced allied with WYKKED WYTCH, MERCENARY and ILLDISPOSED. The band opened 2005 with a burst of South American shows allied with fellow Thrash veterans NUCLEAR ASSAULT. US shows in April had the band packaged with VADER and KREATOR but these dates too were too be pulled. A position at the Dutch 'Waldrock' festival would also be cancelled.\n\nMark Osegueda announced the formation of side act ALL TIME HIGHS, this band featuring the singer alongside members of LICA-STO, TRES PISTOLAS, THE SICK and THE OOZIES. DEATH ANGEL announced a two day &quot;Thrash Domination&quot; stint at Tokyo's famed Club Citta on September 16th and 17th 2006 ranked alongside VENOM, SODOM, DRAGONLORD and ONSLAUGHT. In November the group was set to play at the Californian 'Wrestle Rock '06' events, held at the The Redding Convention Center, Redding and The Rainbow Ballroom in Fresno, alongside Y&amp;T and JANI LANE'S WARRANT. However, just days beforehand the group cancelled.\n\nThe 'Killing Season' album was released in November 2008. The album was recorded at Studio 606 in Northridge, California with producer Nick Raskulinecz. However, longstanding member Dennis Pepa played his last show with DEATH ANGEL on 28th October 2008 at the Grand Ballroom in San Francisco, California.\n\nIn January the following year DEATH ANGEL announced the addition of bassist Sammy Diosdado to the group's ranks, a Bay Area native who previously played with the San Francisco hardcore band THE SICK and was also a member of the rock and roll outfit ALL TIME HIGHS, fronted by DEATH ANGEL singer Mark Osegueda.[/quote]\n\n==================================================================","torrent":{"xt":"urn:btih:db21a3b2a0b3f3e9af13ffb8dc5786a9fd44f4f5","amp;dn":"Death+Angel+-+The+Art+Of+Dying+%28Flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db21a3b2a0b3f3e9af13ffb8dc5786a9fd44f4f5","infoHashBuffer":{"type":"Buffer","data":[219,33,163,178,160,179,243,233,175,19,255,184,220,87,134,169,253,68,244,245]},"announce":[],"urlList":[]}}