{"title":"[GAY]KristenBjorn - Hans Berlin, Gabriel Lunna, Alberto Esposito","uid":13498436,"size":1175633413,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:dbfcfa4ec533b49716ed96793e1cc1482f8168a9&amp;dn=%5BGAY%5DKristenBjorn+-+Hans+Berlin%2C+Gabriel+Lunna%2C+Alberto+Esposito&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobomen","files":1,"time":1455176413,"description":"cover\r\n\r\r\nscreen\r\r\n\r\nGabriel and Alberto head out to the balcony and spot the man they invited over online, Hans. Upon entering the couple’s apartment the men promptly begin kissing each other seductively and stripping away each other’s clothes. The men take to the sofa and Hans comes from the back of the sofa to taste the delights of both men’s hefty, uncut cocks. Hans works his way back and forth from hairy, masculine cock to the smooth muscled cock, making sure each cock stretches his throat open. Being flipped onto his back, Hans’ cock and hot, pink hole are worked over by Gabriel and Alberto. Hans is now flipped onto all 4’s and Alberto gets the pleasure of being the first to plunge his raw cock deep inside of that wet ass. Switching it up again, Hans finds himself on his back while Alberto continues to pound his hot ass and Gabriel feeds him his meaty cock. Flipped upside down, Hans sees Gabriel’s throbbing cock forcing it’s way deep inside of him as Gabriel sucks on Alberto’s huge cock. Alberto can hold back no longer and showers his load of cum all over Gabriel’s cock as he continues fucking Hans. Gabriel is so enthralled with all the pleasure that he shoots his thick, creamy load all over Hans’ pink, throbbing ass. Not to let any of that cum go to waste, Gabriel pushes it all inside of Hans’ hot ass with his fingers, which drives Hans crazy with pleasure and causes him to blow his huge load. Happy Hunting!","torrent":{"xt":"urn:btih:dbfcfa4ec533b49716ed96793e1cc1482f8168a9","amp;dn":"%5BGAY%5DKristenBjorn+-+Hans+Berlin%2C+Gabriel+Lunna%2C+Alberto+Esposito","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbfcfa4ec533b49716ed96793e1cc1482f8168a9","infoHashBuffer":{"type":"Buffer","data":[219,252,250,78,197,51,180,151,22,237,150,121,62,28,193,72,47,129,104,169]},"announce":[],"urlList":[]}}