{"title":"[Psx] Wild Arms 2 (Anti-Mod Patched) [Pal/Ntsc] [2-Disc]","uid":5142588,"size":470373537,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:dca266b5043e2e6cc9ee8e037f55cba80bb56d38&amp;dn=%5BPsx%5D+Wild+Arms+2+%28Anti-Mod+Patched%29+%5BPal%2FNtsc%5D+%5B2-Disc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1257027157,"description":"Wild Arms 2 for the Ps1                                          Rel. 04/30/2000\n\n\nFormat:        CD-R PAL/NTSC Selector\nLang.:         English\nDiscs:         2\nImage:         CCD/SUB/IMG\nGenre.:        RPG\nProtection:    LibCrypt (Pre-Patched with Anti-Mod Protection Fix).\nRequirements:  Modded/Chipped Ps1 or Ps2, Breaker Pro Boot CD, \n               Psx Game Enhancer/Mod-Chip (Allows playing of backups), \n               or Psx Emulator. (You only need one of these methods).\n\n\nCompressed with WinRar, Both Game Discs were tested and work.\nTry 7Zip its free Google it, If you don't have WinRar.\n\n\n\nNote: No Ps1 Backup/Game or copy will work unless you have a modded Ps1/Ps2, or if \n      you use a bootdisc like Breaker Pro, you can also use a Game Enhancer/Built-\n      in Mod-Chip which does the same as Breaker Pro for the Ps1. (If using \n      Breaker Pro or Game Enhancer for multi-disc games you'll have to use the \n      swap trick, A method of lifting the spring putting in any original ps1 game \n      releasing spring and waiting till the disc starts spinning faster then \n      quickly swap in your next game disc. This takes timing and practice to get \n      it right and only works for older Playstation's).\n\n\n\nImportant - If using a Psx Game Enhancer/Mod-Chip in case you didn't already know\n            you must first have the spring in place and any original ps1 game \n            loaded. Then you power on the ps1 and the disc will spin for a little\n            bit loading the Boot Code and stop spinning. Finally you swap in your\n            Ps1 backup or Copy and start the game. \n\n\n\n\nRelease Notes - Wild Arms 2 has protection which detects a mod-chip. Both Disc \n                Images have been pre-patched with protection fix, which means you \n                can play the game without problems. Note When you first start the \n                game it will start off in Pal &amp; flicker press L2 or R2 on first \n                player controller and it will stop into Ntsc &amp; readable format. \n                You'll notice the info for pal/ntsc x or o and the nice trainer \n                options, but note that the trainer only works if you pick ashley\n                or 'the boy with blue hair'.\n\n\n\n\nGame Description:\n\n&quot;Wild Arms 2&quot; isn't really a sequel to Sony's original title. Your hero, a young soldier Ashley, is transformed to a demon. Ashley is determined to purge the evil from his body. He meets Brad, a criminal and a war-hero, and Lilka, a female magician. Together, they start a journey in order to discover the unknown foes which have corrupted Ashley, but soon they find out that a much greater conspiracy has taken place...\n\nThe combat system in &quot;Wild Arms&quot; is very similar to the one in Final Fantasy games: turned-based attacks, and a menu choice of physical attacks, spells, and even Guardians, which are more or less the same like the Guardian Forces in &quot;Final Fantasy VIII&quot;. The &quot;Arms&quot; are special abilities which the party members learn while progressing in the game. \n\n&quot;Wild Arms 2&quot; also has many adventure elements, which links it to Nintendo's Zelda games. The dungeons (which can - and must - be viewed rotating the camera) contain many puzzles to solve.\n\n\n\nGame Pics Included.\n\n\nBurn With Alcohol 120% (Included in Download).\n\nSet DataType to Playstation (Write Method Raw/Dao) and burn at 8x speed for both discs.\n\nUse Verbatim or Taiyo Yuden CD Media for best quality, or if other media isn't working.\n\n(No CD-RW will not work).\n\n\nAny Problems or Questions Please Post a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7 do your part and seed to keep the torrent healthy).\n\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:dca266b5043e2e6cc9ee8e037f55cba80bb56d38","amp;dn":"%5BPsx%5D+Wild+Arms+2+%28Anti-Mod+Patched%29+%5BPal%2FNtsc%5D+%5B2-Disc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dca266b5043e2e6cc9ee8e037f55cba80bb56d38","infoHashBuffer":{"type":"Buffer","data":[220,162,102,181,4,62,46,108,201,238,142,3,127,85,203,168,11,181,109,56]},"announce":[],"urlList":[]}}