{"title":"DC Universe 2 January 2014 (darkhomr) [ALL}","uid":9747008,"size":2459339236,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:dd609fff08b67a7f4cd5498df2c5900c5f2ac376&amp;dn=DC+Universe+2+January+2014+%28darkhomr%29+%5BALL%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dadrkhomr","files":54,"time":1394598264,"description":"Todays pack includes all the DCU titles for December 2013. People ask me where I get my numbering from since i seem to be two weeks ahead of everyone else. Week 1 was a two title week, with only Flashpoint #5 and Justice League #1 being published. Week 14 was a light week with only one title from the 52 Universe. Fact is, its not the numbering that matters, its the content. \n\n Before uploading these, I am opening them with ComicRack, and made sure they all opened there. If there are problems please let me know. As usual, these are not my scans. Thanks to the original scanners and uppers. If you like what you got here, please purchase them in some form. If this torrent has no seeds please msg me privately. I will be glad to reup anything that has no seeds. It is my policy to not publish my weekly packs unless they are complete, but no later than Friday morning. If you have questions or requests, please message me privately. All descriptions are from DC and taken from Comiclist.\n\n Currently looking for independent scanners who might want an additional way to show off your work, or who are not part of a release group. I am willing to release your stuff and put it on my seedboxes. If you are interested, please message darkhomr on H33T or KAT. ALso looking for people who want to release audio books and other such items. My release packs are as follows: \n\n\n***Week of January 8 2014***\n\n\n\n\nAction Comics #27 (CBR 1/8/2014)\n\nSuperman takes on the brutal Beast Lord as startling revelations are made about our Earth's underground world! Plus: more on the mysterious Ghost Soldier! \n\nBatman Superman #7 (CBR 1/8/2014)\n\nBatman versus Superman! Trapped by the Toymaster and Mongul, our heroes turn on each other! Who will save Batman and Superman if they can't save themselves? This epic issue is presented in a special sideways format! \n\nBatwing #27 (CBR 1/8/2014)\n\nA &quot;GOTHTOPIA&quot; tie-in!\n\nLuke Fox has never been happier in his life. He's tearing up Gotham City as its protector, and his father, Lucius, couldn't be prouder of him. How did THAT happen? \n\nDetective Comics #27 (CBR 1/8/2014)\n\nDC Entertainment presents this mega-sized issue featuring an all-star roster of Batman creators past and present! Don't miss a modern-day retelling of The Dark Knight's origin by the incredible team of writer Brad Meltzer and artist Bryan Hitch! Plus, all-new stories by Scott Snyder and Sean Murphy, Peter J. Tomasi and Guillem March, Paul Dini and Dustin Nguyen, Gregg Hurwitz and Neal Adams and more! Also in this issue, John Layman and Jason Fabok kick off the new storyline &quot;GOTHTOPIA&quot;! It's a bright, shiny, happy place where dreams come true . . . as long as you don't look at things too closely. \n\nEarth 2 #19 (CBR 1/8/2014)\n\nThe Dark Knight of Earth 2 discovers the one man who may be able to stop Superman's reign of terror across the planet. \n\nForever Evil Arkham War #4 (of 6) (CBR 1/8/2014)\n\nAs the freed villaIns from Blackgate and Arkham continue to wage war, an all-new, all-deadly Dynamic Duo hits the streets of Gotham City! It's Bane and the Talon known as Cobb as you've never seen them before! \n\nGreen Arrow #27 (CBR 1/8/2014)\n\n'The Outsiders War' part 2! Green Arrow fights for his life against the head of the Shield Clan, the deadly Kodiak! Plus, learn the tragic secret that turned Oliver Queen into Green Arrow! \n\nGreen Lantern #27 (CBR 1/8/2014)\n\nHas Hal dealt a major blow to crime in Sector 0563, or has he invited the enemy to his door? New adversaries reveal themselves in an all-out effort to dismantle the Green Lantern Corps! \n\nMovement #8 (CBR 1/8/2014)\n\nVengeance Moth and Burden are left alone to fight the Graveyard Faction! Only they and Tremor stand can prevent a disaster beneath Coral City! \n\nStormwatch #27 (CBR 1/8/2014)\n\nStormwatch debates whether to save Earth from the Kollective by teaming up with the megalomaniacal Extremax. Are they willing to trade one planet-pummeling peril for another? \n\nSwamp Thing #27 (CBR 1/8/2014)\n\nThe Earth bleeds green! Millions will die. The Swamp Thing must tear his very existence up by the roots.\n\nPhantom Stranger #15 (Trinity of Sin) (CBR 1/8/2014)\n\nForever Evil: Blight - Part 7 of 18 With the secret of the Sea King revealed, the Phantom Stranger is faced with an impossible choice: Let the villains win or destroy the last true friend he has! Continued in this month's CONSTANTINE #10! \n\n\n***WEEK of January 15, 2014***\n\n\n\nBatgirl #27 (CBR 1/15/2014)\n\nIn this tale tying into &quot;GOTHTOPIA,&quot; what kind of sick world pairs up Batgirl and the woman who tried to kill Jim Gordon--Knightfall?! \n\nConstantine #10 (CBR 1/15/2014)\n\nBrought low by the evil of Blight, Constantine struggles to rally his mystical allies and turn the tide of battle. Only one thing stands in his path: the righteous wrath of The Spectre! Continued in TRINITY OF SIN: PANDORA #7! \n\nDC vs. Masters Of The Universe #4 (of 6) (CBR 1/15/2014)\n\nAt long last, the identity of Skeletor's dark master is revealed! Can the combined forces of the Masters of the Universe and the Justice League withstand the power of his dark magic? \n\nForever Evil Rogues Rebellion #4 (of 6) (CBR 1/15/2014)\n\nThe Rogues just can't catch a break! On the run from the Crime Syndicate and the Secret Society, the Rogues are forced into a showdown with an army of escapees from Arkham Asylum! \n\nGreen Lantern Corps #27 (CBR 1/15/2014)\n\nJohn Stewart stars in this special issue! GL Sector Houses across the galaxy are being destroyed, and the Durlans unleash a deadly new weapon designed to counter the GL's rings! \n\nJustice League 3000 #2 (CBR 1/15/2014)\n\nBefore the team can figure out what happened to their memories, Cadmus sends some seemingly familiar faces into the darkness of Commonwealth space to face off against the first member of a new group of villains called LOCUS! \n\nJustice League Of America #11 (CBR 1/15/2014)\n\nA FOREVER EVIL tie-in! Survivors Martian Manhunter and Stargirl make a perilous trek across a Super-Villain occupied United States. Their first stop may be the last as they enter Gotham City and Clayface-occupied territory! \n\nNightwing #27 (CBR 1/15/2014)\n\nNightwing's being visited by an old friend from Gotham - the Mad Hatter! Desperate to protect Chicago, Nightwing's been forced into an uneasy alliance with the mysterious Marionette. But who's really pulling the strings? \n\nSuicide Squad #27 (CBR 1/15/2014)\n\nA FOREVER EVIL tie-in! As Amanda Waller and James Gordon Jr. fight for their lives in the bowels of Belle Reve, Deadshot and the Squad struggle to survive a deadly trap that one of their own sprung on them! \n\nSuperboy #27 (CBR 1/15/2014)\n\nPart Two of Kara's confrontation with the deadly new Lobo. After last issue's shock ending, this issue we discover an even greater threat in Shay Veritas that will force Supergirl to make a deadly choice! \n\nSuperman Wonder Woman #4 (CBR 1/15/2014)\n\nThe secret of Superman and Wonder Woman's relationship is out and the world's reaction is mixed, but that's the least of the power couple's worries as Zod seeks to release Faora from the Phantom Zone! \n\nWorlds Finest #19 (CBR 1/15/2014)\n\nDesperate times call for desperate measures as Power Girl and Huntress reveal their true origins to this world's Superman and Batman! \n\n\n***WEEK of January 22, 2014***\n\n\n\n\nAnimal Man #27 (CBR 1/22/2014)\n\nTHIS IS IT: The final battle for The Red begins here! Brother Blood must kill the avatar before he can rule. But will Buddy's new powers be enough to protect Maxine? \n\nBatman #27 (CBR 1/22/2014)\n\n'ZERO YEAR' reaches an all-important crossroads as Batman and Jim Gordon try to turn the lights back on in Gotham City. This issue leads directly into the final arc of Zero Year, which begins here next month! \n\nBatman And Two Face #27 (CBR 1/22/2014)\n\nThe origin of Two-Face continues! Batman finds himself in the crossfire of a vengeful war between Two-Face and Erin McKillen! Both are hellbent on killing each other and anyone else who dares to step between them \n\nBatwoman #27 (CBR 1/22/2014)\n\nBatwoman faces off against the new Black Spider as the mystery deepens! What do the wealthy citizens of Gotham City have that he wants? Will Batwoman's overconfidence cost her her life? And on the personal front: Kate meets Maggie's daughter! \n\nBirds Of Prey #27 (CBR 1/22/2014)\n\nA &quot;GOTHTOPIA&quot; tie-in! We reach a major turning point in the series as the Birds find a new benefactor and a new mission to take down one of the ancient evils of the DC Universe: Ra's al Ghul! \n\nGreen Lantern New Guardians #27 (CBR 1/22/2014)\n\nKyle's training with the New Guardians continues as he tries to solve the mystery of what caused an entirely peaceful civilization to go to war! \n\nHarley Quinn #2 (CBR 1/22/2014)\n\nHarley and guest star Poison Ivy set out to rescue a bunch of cute puppies and kitties! What could possibly go wrong? \n\nJustice League #27 (CBR 1/22/2014)\n\nA FOREVER EVIL tie-in! With the Justice League still missing, a barely functional Cyborg will need help if he's going to take down the Crime Syndicate! To do that, he must find Doctor Will Magnus! \n\nRed Hood And The Outlaws #27 (CBR 1/22/2014)\n\nThe Outlaws have their final bloody showdown with Ra's al Ghul and the League of Assassins! \n\nSupergirl #27 (CBR 1/22/2014)\n\nThe son of Superman finds himself trapped with the Teen Titans in a future that may kill all of them. \n\nTrinity of Sin Pandora #7 (CBR 1/22/2014)\n\nA major turning point for Pandora, who reluctantly joins forces with John Constantine's team of mystical underdogs to confront the personification of all evil: Blight! Continued in JUSTICE LEAGUE \n\nWonder Woman #27 (CBR 1/22/2014)\n\nDiana returns to Paradise Island for the first time since the Amazons were wiped out-but do those ancient stones hold the answers she's looking for? \n\n\n\n\nAll Star Western #27 (CBR 1/28/2014)\n\nHex's journey through the modern age continues! Guess whose attention Hex attracts as he makes his way to Metropolis! \n\nAquaman #27 (CBR 1/28/2014)\n\nFrom the depths of the ocean comes the Karaqan - a monster so immense, Aquaman doesn't even know how to start battling it! And while he may have no idea what it is, the people of Atlantis do - and the LAST thing they want is for their king to try to stop it! \n\nBatman And Robin Annual #2 (CBR 1/28/2014)\n\nA YEAR ONE ADVENTURE OF DICK GRAYSON AS ROBIN! Bruce Wayne and Dick Grayson have shared a distinctive crimefighting role: Both have played Batman to a young Robin, so when they discover something important that Damian left behind it leads them to relive one of their first adventures in Gotham City as Batman and Robin! \n\nBatman The Dark Knight #27 (CBR 1/28/2014)\n\nIn this conclusion to the storyline 'VOICELESS,' the illegal immigrants of Gotham City have been forced into slave labor by the Penguin. And Batman will stop at nothing to shut it all down! \n\nCatwoman #27 (CBR 1/28/2014)\n\nA &quot;GOTHTOPIA&quot; tie-In! Everything's all right in Selina Kyle's world. As the fabled Catbird of Gotham City, she fights alongside Batman to keep the city safe. So why does it all feel so wrong? \n\nDamian Son Of Batman #4 (of 4) (CBR 1/28/2014)\n\nWill the devastating events of Damian Wayne's life push this troubled hero over the edge and send him straight into the abyss? Find out in the epic finale to this futuristic tale of tragedy! \n\nEarth 2 Annual #2 (CBR 1/28/2014)\n\nThe origin of Earth 2's new Batman is revealed. But after he tells his tale, will any of the other heroes trust him again? \n\nFlash #27 (CBR 1/28/2014)\n\nThe Flash faces a mystical serial killer who might be responsible for his mother's murder! \n\nForever Evil Argus #4 (of 6) (CBR 1/28/2014)\n\nSteve Trevor's quest to learn where the missing heroes are leads him to an unlikely ally-Killer Frost-and to one of his most deadly enemies: Cheetah! \n\nGreen Lantern Corps Annual #2 (CBR 1/28/2014)\n\nThe GLC in all-out battle with the combined might of the Durlans, Khund and Clann! Will the Green Lanterns partner with some of their worst enemies in order to survive this onslaught? \n\nGreen Team Teen Trillionaires #8 (CBR 1/28/2014)\n\nFINAL ISSUE Through thick and thin, the Green Team has endured more pain and suffering than any teen trillionaire can withstand. Will this final issue be their breaking point? \n\nJustice League Dark #27 (CBR 1/28/2014)\n\nForever Evil: Blight - Part 10 of 18 There is now only one final obstacle John Constantine's ragtag team must vanquish . . . and its name is Blight! Continued in Phantom Stranger #16! \n\nLarfleeze #7 (CBR 1/28/2014)\n\nLarfleeze is branded 'Public Enemy #1&quot; by the Council of Ten! Plus, fallout from 'Revolt of the Orange Lanterns' as the former Corpsmen find themselves imprisoned again! \n\nRed Lanterns #27 (CBR 1/28/2014)\n\nThere's a new gang in town as The Red Lanterns come to Earth! How will the rest of the universe react to the Reds' policing their new 'jurisdiction'? And more important, how will Ice react when Guy Gardner comes a-courtin'? The cover's a big hint! \n\nSuperman #27 (CBR 1/28/2014)\n\nThe Parasite can't be stopped-and he hungers for the power that Lois Lane possesses. Is there anything The Man of Steel can do, or will he lose his best friend? The answer will surprise you! \n\nTalon #15 (CBR 1/28/2014)\n\nFlashback to the Talon of the 1920s as we learn more about The Court of Owls! \n\nTeen Titans #27 (CBR 1/28/2014)\n\nThe Teen Titans must stop the evil Bart Allen of the future or our timeline is doomed! \n\nWorlds Finest Annual #1 (CBR 1/28/2014)\n\nIn one of their first adventures together, Earth 2's Supergirl and Robin team up to face their world's Wonder Woman! \n\n","torrent":{"xt":"urn:btih:dd609fff08b67a7f4cd5498df2c5900c5f2ac376","amp;dn":"DC+Universe+2+January+2014+%28darkhomr%29+%5BALL%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd609fff08b67a7f4cd5498df2c5900c5f2ac376","infoHashBuffer":{"type":"Buffer","data":[221,96,159,255,8,182,122,127,76,213,73,141,242,197,144,12,95,42,195,118]},"announce":[],"urlList":[]}}