{"title":"Family Guy Seizoen 1 DVDR XviD - NLsubs DutchReleaseTeam","uid":6030140,"size":1288094904,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:deb3cb97b5a97cfdd6074bf61cf88d369757b67e&amp;dn=Family+Guy+Seizoen+1+DVDR+XviD+-+NLsubs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Koedje","files":12,"time":1292065670,"description":"\n\n\nPlot:\n\nDe animatieserie over een gestoorde familie met een vader die het wel probeert maar er niet in slaagt om enige stuctuur en regelmaat in zijn eigen leven en dat van zijn familie te scheppen. Niets is te gek. Er gebeurt altijd van alles in de familie van vader Peter Griffin. Maar het is voornamelijk chaos en wanorde die heersen. De jongste van de drie kinderen in de familie, Stewie, is een duivels mannetje die een moordaanslag niet uit de weg gaat als ie zijn zin niet krijgt. De hond Brian mengt zich in de conversaties want hij kan praten, rookt sigaretjes en drinkt een martini op zijn tijd. En moeder is de enige stabiele factor in het gezin en daarom vaak het middelpunt van spot en grappen. Eigenlijk heeft Family Guy geen vaste verhaallijn behalve dat er altijd bizarre en enorm lachwekkende situaties zijn. Die doorgaans beginnen met een mooi plan van vader Peter wat bijna altijd desastreus uitpakt voor hem en zijn familie. Family Guy is inmiddels een klassieke comedy serie die elke keer weer verrast met bizarre wendingen en de meest originele grappen.\n\n\nSeizoen 1:\n\n\nSeizoen 1 Aflevering 1: Death Has a Shadow\nPeter loses his job, but ends up getting rich off welfare\n\n\t\n\nSeizoen 1 Aflevering 2: I Never Met the Dead Man\nAfter crashing into the town's TV transmitter, Peter discovers life without television.\n\t\n\n\nSeizoen 1 Aflevering 3: Chitty Chitty Death Bang\nStewie has his first birthday, while Meg makes a new friend.\n\t\n\n\nSeizoen 1 Aflevering 4: Mind Over Murder\nConfined to house arrest, Peter opens a bar in the basement.\n\n\n\t\nSeizoen 1 Aflevering 5: A Hero Sits Next Door\nPeter gets jealous when the new neighbor starts stealing the spotlight.\n\t\n\n\nSeizoen 1 Aflevering 6: The Son Also Draws\nThe Griffins head to New York in order to re-gain Chris entry back into the Boy Scouts which Chris doesn't even want to be in. But on the way the decide to stop at an Indian casino. Once there Lois loses all of the family's money and then the car.\n\t\n\n\nSeizoen 1 Aflevering 7: Brian: Portrait of a Dog\nBrian's life is on the line after he refuses to be treated like a dog.\n\n\n\n\nMeer zien? Kijk dan op - http://hetmultimediacafe.nl/index.php\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:deb3cb97b5a97cfdd6074bf61cf88d369757b67e","amp;dn":"Family+Guy+Seizoen+1+DVDR+XviD+-+NLsubs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"deb3cb97b5a97cfdd6074bf61cf88d369757b67e","infoHashBuffer":{"type":"Buffer","data":[222,179,203,151,181,169,124,253,214,7,75,246,28,248,141,54,151,87,182,126]},"announce":[],"urlList":[]}}