{"title":"Turn the Key Softly 1953 DvdRip Mp4 Lee1001","uid":10870339,"size":583472823,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:debedccd95238a88391ee7c37448e5519aa0c57a&amp;dn=Turn+the+Key+Softly+1953+DvdRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xultfoad","files":2,"time":1408925381,"description":"Turn the Key Softly 1953 DvdRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0046471/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0046471/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Turn_the_Key_Softly&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Turn_the_Key_Softly&lt;/a&gt;\nFebruary 4, 1954\nAlthough it is nominally poetic, &quot;Turn the Key Softly,&quot; the British drama that arrived yesterday at the Beekman, Gramercy and Eighth Street Theatres, is pointedly realistic about its stigmatized principals. And, while this examination of the short courses of the lives of three ladies of varying degree after they have left London's Holloway Prison, is not precisely on a heroic scale, the producers have endowed the proceedings with compassion, sensitivity and a modicum of irony.\nCredit Jack Lee, the director, and Maurice Cowan, the producer, who also collaborated on the script, with keeping their heroines on the move without snarling this traffic in tales. \n\nCaught up indirectly with each other as they emerge into teeming London town is Monica Marsden, a lass of breeding who had done time as a martyr for the worthless but romantically smooth thief to whom she had unwittingly given her heart. There also is Stella Jarvis, a Cockney lady of the evening and no stranger to durance vile, who is anxious to start a new life with an honest and loving bus driver, and there is Mrs. Quilliam, with an abiding love for her mongrel pup, Johnny, and a predilection for shoplifting.\n\nAs has been noted, the Messrs. Lee and Cowan see the ladies through with honest results. Yvonne Mitchell, as Monica Marsden, discovers in time that the dictates of her heart, which brings her back to her gun-toting lover, are pitifully wrong. She brings attractiveness and understanding to the role. Joan Collins is properly lush and brassy as the Cockney charmer who almost, but not quite, reverts to her gay way of life. However, Kathleen Harrison, as the aging and lonely shoplifter whose great affection for the dog, which amply returns that love, contributes the film's top portrayal. She makes the loneliness of the poor and unwanted strikingly real.\n\nVIDEO\nSize.... 556mb\nDuration.... 01:17:57\nCodec.... avc1\nFrame Width..... 640\nFrame Height.... 480\nData Rate.... 871kbps\nFrame Rate.... 25F/S\nAUDIO\nBit Rate.... 121kbps\n2 Channel Stereo\nAudio Sample Rate.... 48KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:debedccd95238a88391ee7c37448e5519aa0c57a","amp;dn":"Turn+the+Key+Softly+1953+DvdRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"debedccd95238a88391ee7c37448e5519aa0c57a","infoHashBuffer":{"type":"Buffer","data":[222,190,220,205,149,35,138,136,57,30,231,195,116,72,229,81,154,160,197,122]},"announce":[],"urlList":[]}}