{"title":"HISTORY OF POP AND ROCK MUSIC - part 551","uid":9537855,"size":440928370,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:df7f77c1777e52860fd63b03d01ca82336f0db64&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+551&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1390964643,"description":"                            \n\n                       PART  551\n\n\n\n       Wolfmother are an Australian hard rock band. Formed in 2000 by vocalist and guitarist Andrew Stockdale, bassist and keyboardist Chris Ross, and drummer Myles Heskett.In August 2008, co-founding members Ross and Heskett left the band due to &quot;irreconcilable personal and musical differences&quot;, after which Stockdale decided to continue using the Wolfmother moniker with new musicians. After a brief hiatus, Stockdale returned with a new four-piece band in January 2009 featuring current member Peres, rhythm guitarist Aidan Nemeth, and drummer Dave Atkins.\n\n\n\n              WOLFMOTHER  -   Woman   (2005)\n              WOLFMOTHER  -   Dimension  (2005)\n              WOLFMOTHER  -   Love Train  (2005) \n\n\n      &quot;Woman&quot; is a song by Australian rock band Wolfmother, featured on their 2005 debut studio album &quot;Wolfmother&quot;. It was released as the band's fourth single in Australia on 17 June 2006, and later in the United Kingdom on 17 July. It became a massive hit at rock radio during the summer of 2006 in the United States, achieving peaks of number 7 on the Hot Mainstream Rock Tracks chart and number 10 on the Modern Rock Tracks chart. &quot;Woman&quot; won the award for Best Hard Rock Performance at the 49th Grammy Awards in 2007.\n   \n     &quot;Dimension&quot; is a song by Wolfmother, featured on their 2005 studio album &quot;Wolfmother&quot;. Written by band members Andrew Stockdale, Chris Ross and Myles Heskett, it was released as the second single from the album in Europe (and the third single overall) on 17 April 2006, charting at number 49 on the UK  Singles Chart. Directed by The Malloys, the music video for &quot;Dimension&quot; was first aired in the week of 13 February 2006.\n  \n     &quot;Love Train&quot; was released as the fifth single from Wolfmother on 18 September 2006. It became a minor commercial success in the United Kingdom, reaching number 62 on the UK Singles Chart.  The music video for &quot;Love Train&quot; was directed by Jay Martin, who described it as a combination of &quot;band portraits and epic, heroic performance.&quot;","torrent":{"xt":"urn:btih:df7f77c1777e52860fd63b03d01ca82336f0db64","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+551","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df7f77c1777e52860fd63b03d01ca82336f0db64","infoHashBuffer":{"type":"Buffer","data":[223,127,119,193,119,126,82,134,15,214,59,3,208,28,168,35,54,240,219,100]},"announce":[],"urlList":[]}}