{"title":"Patton.1970.PAL.DVDR-NiGhTwOlF","uid":4855616,"size":4700657245,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:dfb3f909bbbcb3c47e94ff46b13aea7e504d12ff&amp;dn=Patton.1970.PAL.DVDR-NiGhTwOlF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GreyEagleHawk","files":7,"time":1240054503,"description":"And the best performance from an Actor in history. George C. Scott is General Patton, the greatest General of World War II and the most controversial. Scott gives the performance of a lifetime if Patton watched this film he couldn't tell the difference himself. Scott portrays him the way he was, not the way he should be or the way we would like him to be. Patton is Patton, tough, resilient, fearless, sarcastic, angry, witty, cultured, charming, bull-headed, uncompromising, temperamental, and more patriotic than Uncle Sam on the 4th of July. The speech at the beginning with him in front of the American flag sets the tone. It's his way or the highway. And Patton is driving. His antics tick off the high command and rankle his subordinates but they all can't argue with his success. Karl Malden is his good friend and at times adversary General Bradley who is as resourceful as Patton is eccentric and they make a great pair. Every time Patton has a victory he screws it up by way of his gargantuan mouth. But he keeps going. When disaster strikes he always manages to pull defeat out of his rear and strike a blow for the 2nd Corps or the 3rd Army or whatever army he's commanding. His soldiers love him, his soldiers hate him, but his soldiers fight for him regardless because they know he's the best. Patton's rise is like Patton's fall, momentous. His last line is the most telling of all. &quot;They remind us that glory, like everything else, is fleeting.&quot; Glory may be fleeting but this movie won't be. Perhaps the best war movie in history.\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0066206/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0066206/&lt;/a&gt;","torrent":{"xt":"urn:btih:dfb3f909bbbcb3c47e94ff46b13aea7e504d12ff","amp;dn":"Patton.1970.PAL.DVDR-NiGhTwOlF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfb3f909bbbcb3c47e94ff46b13aea7e504d12ff","infoHashBuffer":{"type":"Buffer","data":[223,179,249,9,187,188,179,196,126,148,255,70,177,58,234,126,80,77,18,255]},"announce":[],"urlList":[]}}