{"title":"Freedom Fighters with keygen","uid":9832255,"size":708810658,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e0f40806b5de234a5d35c04f97d55ce8a7e84416&amp;dn=Freedom+Fighters+with+keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bao178","files":-1,"time":1395859228,"description":"Description\nFreedom Fighters, originally titled Freedom: The Battle For Liberty Island, is a 2003 third-person shooter video game available for the PlayStation 2, Nintendo GameCube, Xbox and Microsoft Windows. It was developed by IO Interactive, using a modified version of the Hitman 2: Silent Assassin game engine, and published by Electronic Arts.\nThe game is set in an alternate history where the Red Army has invaded and occupied New York City. The player takes the role of Christopher Stone, a plumber-turned American Resistance movement leader fighting against the invaders.\n\nPlot:\n\nThe Soviet Union became the world superpower by dropping the first atomic bomb on Berlin and ending World War II, thereby propping up communist states throughout the globe which begin to surround the U.S in the present day. New York plumbing brothers Chris and Troy Stone travel to meet with their next client, an activist named Isabella Angelina. The Stones appear at her home only to find it abandoned. The Soviet Union launches a surprise invasion of New York City and suddenly Soviet soldiers led by General Tatarin seize Troy. Amidst the attack Chris escapes to the streets, encountering a man named Mr. Jones and resistance member Phil Bagzton. After rescuing Isabella from a police station and Troy from a post office, the group retreat to the sewers and set up a base of operations as New York is lost.\nMonths later, Chris, Phil, and Isabella sabotage key Soviet facilities and reclaim areas within the city, building up a resistance group of New York citizens and disillusioned Soviet soldiers. Delivering serious damage to the Soviets, Chris becomes known as the &quot;Freedom Phantom&quot; within the Soviet-controlled media, SAFN. Later, Troy is captured by Soviet troops and tortured for information. Forced into issuing a public statement aimed at the resistance to cease their actions, he breaks from the prepared text and urges Chris to continue fighting. In response, General Tatarin has Troy taken to Fort Jay and executes him personally. Mr. Jones suggests assassinating Tatarin in retaliation and Chris succeeds, only to return to find Isabella missing and the resistance base occupied by the Soviet army. The operation was orchestrated by Mr. Jones who reveals himself to be KGB agent Colonel Bulba, as he explains this as his source of information. Betrayed, Chris escapes with Phil and others to a new underground area while SAFN reports on the death of Tatarin, Colonel Bulba's promotion to General and the end of the resistance in New York.\nDuring the winter, Chris leads the resistance deeper into occupied New York, culminating with a major raid on SAFN Studios. He uses the station to send a broadcast encouraging the city and beyond to rise up and bring an end to the Soviet occupation. A final assault on Governor's Island consisting of massed resistance forces is planned. After capturing Fort Jay and rescuing Isabella, New York is liberated for the time being as Chris and the group solemnly celebrate their victory. Chris knows the Soviets will not give up the occupied United States easily, but resolves to fight on as long as is necessary.\n\nGameplay:\n\nFreedom Fighters is third-person shooter, in which the player navigates through the streets of New York while fighting the Soviet forces. The game also contains squad-based elements, having a charisma meter. The player gains charisma by performing heroic deeds in the resistance movement against the invading forces, like capturing a base or destroying vital supplies. The more charisma that is gained, the more squad mates the character can recruit, including leaderless guerrillas and wounded Russian soldiers, up to a maximum of twelve.\nFreedom Fighters uses a simple method of controlling recruits in battle. In the game, the player can command recruits by giving them simple orders such as &quot;follow&quot;, &quot;attack&quot;, and &quot;defend&quot;, but in most situations, they take care of themselves. Given the terrain of New York City after the initial invasion, the Resistance usually stations its soldiers in covered positions like craters and buildings.\n\nSystem Requirements\nCPU: \tPentium III 733MHz or comparable\nRAM: \t128MB\nVGA: \t32MB D3D With Hardware T&amp;L* capable Video Card with DirectX8.1 or higher Compatible drivers\nDX: \tDirectX8.1 or higher\nOS: \tWindows(r) 98/2000/ME/XP\nHDD: \t650MB\nSound: \tSound Card with DirectX8.1 or higher compatible Drivers\nODD: \tCD ROM Speed: 4x\n\nInstall Notes:\n1. Mount or extract ISO with MagicISO or Daemon Tool.\n2. Install.\n3. When it asks you to enter the serial, open up the keygen, and select the game Freedom Fighters. Click generate a few times, and use the serial.\n4. Finish the installation.\n5. Play the game.\n","torrent":{"xt":"urn:btih:e0f40806b5de234a5d35c04f97d55ce8a7e84416","amp;dn":"Freedom+Fighters+with+keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0f40806b5de234a5d35c04f97d55ce8a7e84416","infoHashBuffer":{"type":"Buffer","data":[224,244,8,6,181,222,35,74,93,53,192,79,151,213,92,232,167,232,68,22]},"announce":[],"urlList":[]}}