{"title":"Shell Girls (NEW 2014 Viv Thomas) [DVDRip]","uid":11569987,"size":1418377922,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:e145fdf0578685e559c1e95e265454b30477e5ee&amp;dn=Shell+Girls+%28NEW+2014+Viv+Thomas%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"bittuboss","files":1,"time":1416962752,"description":"Shell Girls (NEW 2014 Viv Thomas) [DVDRip]\n\nLexie Dona, Wendy Moon, Bailey Rider, Whitney Conroy\n\nAs the title slyly suggests, oil plays a major role in &quot;Shell Girls,&quot; but we don't mean &quot;black gold&quot; or &quot;Texas tea.&quot; It's generous and repeated applications of massage oil that links the scenes and lubricates the erotic action in director Andrej Lupin's latest all-girl creation for Viv Thomas. In the first encounter Wendy Moon assumes the role of masseuse, and Lexie Dona is her eager client. After a loving rub-down Dona's skin glistens and her pussy hungers for attention. Moon has the situation well in hand and she tongues and fingers Lexie to moaning peaks of pleasure. The twosome also enjoy about of sixty-nine before their roles are reversed and Lexie returns the favor with ravenous enthusiasm. Wendy Moon's next client is Bayley Rider, and the olive-skinned beauty gets lubed, licked, fingered, and rimmed to a high-impact orgasm before rubbing her pretty masseuse in just the right ways in return. The third segment of &quot;Shell Girls&quot; pairs Lexie Dona and Bayley Rider for another slick and sizzling well-lubed lesbian encounter filled with feverish finger-banging and no-holes-barred orgasmic oral action. Whitney Conroy is in a quiet mood when Lexie Dona joins her in the bedroom, but after a bit of kissing and cuddling - and a generous application of slick and slippery oil - things heat up very, very quickly. No pussy goes un-licked, no clit un-sucked, as the oil-slicked twosome treat one another to an afternoon of outrageously uninhibited erotic pleasures. Gorgeous women, glistening bodies, and stunning cinematography - including eye-popping extreme close-ups - make &quot;Shell Girls&quot; a slick and sizzling serving of high impact lesbian erotica.\n\n\nScreens..\n &lt;a href=&quot;\nhttp://imgextra.biz/viewer.php?file=k506nbh3f0gsfqvri3db.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgextra.biz/viewer.php?file=k506nbh3f0gsfqvri3db.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgextra.biz/viewer.php?file=993kar8pz0tmh44tbvus.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgextra.biz/viewer.php?file=993kar8pz0tmh44tbvus.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:e145fdf0578685e559c1e95e265454b30477e5ee","amp;dn":"Shell+Girls+%28NEW+2014+Viv+Thomas%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e145fdf0578685e559c1e95e265454b30477e5ee","infoHashBuffer":{"type":"Buffer","data":[225,69,253,240,87,134,133,229,89,193,233,94,38,84,84,179,4,119,229,238]},"announce":[],"urlList":[]}}