{"title":"Characterization of Nanophase Materials - Zhong Lin Wang","uid":15346756,"size":8959483,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1e6b6029b61823793e7367c21ce18e737011c2e&amp;dn=Characterization+of+Nanophase+Materials+-+Zhong+Lin+Wang&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1468887782,"description":"Characterization of Nanophase Materials - Zhong Lin Wang (Wiley-VCH, 2000).pdf\r\n\r\nEngineering of nanophase materials and devices is of vital interest in electronics, semiconductors and optics, catalysis, ceramics and magnetism. Research associated with nanoparticles has widely spread and diffused into every field of scientific research, forming a trend of nanocrystal engineered materials.\r\nThe unique properties of nanophase materials are entirely determined by their atomic scale structures, particularly the structures of interfaces and surfaces. Development of nanotechnology involves several steps, of which characterization of nanoparticles is indespensable to understand the behavior and properties of nanoparticles, aiming at implementing nanotechnolgy, controlling their behavior and designing new nanomaterials systems with super performance.\r\nThe book will focus on structural and property characterization of nanocrystals and their assemblies, with an emphasis on basic physical approach, detailed techniques, data interpretation and applications.\r\nIntended readers of this comprehensive reference work are advanced graduate students and researchers in the field, who are specialized in materials chemistry, materials physics and materials science","torrent":{"xt":"urn:btih:e1e6b6029b61823793e7367c21ce18e737011c2e","amp;dn":"Characterization+of+Nanophase+Materials+-+Zhong+Lin+Wang","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1e6b6029b61823793e7367c21ce18e737011c2e","infoHashBuffer":{"type":"Buffer","data":[225,230,182,2,155,97,130,55,147,231,54,124,33,206,24,231,55,1,28,46]},"announce":[],"urlList":[]}}