{"title":"HISTORY OF POP AND ROCK MUSIC - part 531","uid":9169988,"size":929303500,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e42ff32fc5cc0da1e6f79cb6dfd7f7f9f5f815fc&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+531&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1384051477,"description":"\n                     PART  531\n\n\n          ROD STEWART  -  The First Cut Is The Deepest  (1976)\n          SWEET  -  Love Is Like Oxygen  (1978)  \n          BARCLAY JAMES HARVEST  -  Life Is For Living (1980)\n\n\n          PAPA DEE  -   The First Cut Is The Deepest  (1996)\n          SHERYL  CROW -  The First Cut Is The Deepest  (2003)\n\n\n\n\n         &quot;The First Cut Is the Deepest&quot; is a 1967 song written by Cat Stevens, originally released by P. P. Arnold in the spring of 1967. Stevens' own version originally appeared on his album New Masters in December 1967. The song has been widely covered and has become a hit single for four different artists: P. P. Arnold (1967), Keith Hampshire (1973), Rod Stewart (1977) and Sheryl Crow (2003).   \n       Stewart recorded the song at Muscle Shoals Sound Studio in Muscle Shoals, Alabama, USA and, and it appeared on his 1976 album A Night on the Town. It was released as a double A-side single with &quot;I Don't Want to Talk About It&quot;. It was a huge success, and spent four weeks at number one on the UK Singles Chart in May 1977, number 11 in April in Canada, and also reached number 21 on the Billboard Hot 100 in the U.S. In a departure from the original, Stewart excludes the concluding &quot;But when it comes to being loved, she's first&quot; from the refrain.   \n        Sheryl Crow's version was the first of two singles released to promote her 2003 The Very Best of Sheryl Crow compilation album. It became one of Crow's biggest radio hits, remaining 36 weeks in the Billboard Hot 100, and was also Crow's first Top 40 solo country hit, following the success of her hit duet with Kid Rock, &quot;Picture&quot;. The song topped the Airplay charts in the U.S. and became a platinum seller, also reaching number 14 on the Billboard Hot 100 singles chart and went to number one on Adult Contemporary chart on two non consecutive weeks.  \n\n          &quot;Love Is Like Oxygen&quot; is a song by the British band Sweet, co-written by the group's guitarist Andy Scott and Trevor Griffin, a musician who had played with various unsuccessful bands before becoming a roadie and sound engineer, and released in January 1978. The song was a departure from earlier recordings by the Sweet, which were more guitar-driven and featured high vocal harmonies. The extended album version of the song, which appeared on their album Level Headed, incorporates strings and has some disco elements. Their first release on the Polydor label after their departure from RCA, it was also their last Top 10 hit, reaching # 4 in New Zealand, # 6 in Switzerland, # 8 in Belgium, Canada and the United States # 9 in United Kingdom and # 10 in West-Germany. Later that year it was honoured with a Song of the Year nomination at the Ivor Novello awards, although beaten by &quot;Baker Street&quot; by Gerry Rafferty. The song is frequently included on greatest hits compilations, usually in its edited single version.\n           \n","torrent":{"xt":"urn:btih:e42ff32fc5cc0da1e6f79cb6dfd7f7f9f5f815fc","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+531","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e42ff32fc5cc0da1e6f79cb6dfd7f7f9f5f815fc","infoHashBuffer":{"type":"Buffer","data":[228,47,243,47,197,204,13,161,230,247,156,182,223,215,247,249,245,248,21,252]},"announce":[],"urlList":[]}}