{"title":"Sword of the Stars - The Pit - Mindgames DLC - GOG","uid":8804416,"size":370561424,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e43ae312a9f9dc9c4abb5b9264c677ec9efcf46b&amp;dn=Sword+of+the+Stars+-+The+Pit+-+Mindgames+DLC+-+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Valice","files":-1,"time":1376290076,"description":"Two New playable characters; the Human Psion and Tarka Ranger the first playable alien character!\n\n2 New Play Modes; Infinite Mode as well as Seriously? Mode, for those of you that find Insane Mode isnt insane enough!\n\nTen new floors of ancient, evil science, including wide, multi-level biospheres, add to the challenge!\n\nExpanded meta-game aspects, including the ability to bank XP and spare items from one session and start the next run of the game on a deeper level, using your banked equipment.\n\nOverview:\n\nHave you found the cure to the plague yet? Even if you have, theres more to The Pit than you at first thought, with lots of new areas to explore, items to find and new dangers! The Pit: MindGames gives you even more old-school dungeon-diving in the Sword of the Stars sci-fi universe, letting your test your skill against The Pit using the mysterious and gifted Solforce Psion officer or the Tarkan Ranger the first playable alien character!\n\n\u000bThe Pit will only give up its secrets if you survive and to survive you need to explore the powerful and deadly potential of your mind!\u000b \u000bMens agitat monstra!\n\nMinimum system requirements: Windows XP / Vista / 7 / 8, 2 GHz Processor or faster, 1 GB RAM (2 GB of RAM recommended), 3d graphics card compatible with DirectX 9.0c with 512 MB VRAM ( 1 GB VRAM recommended), 750 MB HDD, Mouse, Keyboard.","torrent":{"xt":"urn:btih:e43ae312a9f9dc9c4abb5b9264c677ec9efcf46b","amp;dn":"Sword+of+the+Stars+-+The+Pit+-+Mindgames+DLC+-+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e43ae312a9f9dc9c4abb5b9264c677ec9efcf46b","infoHashBuffer":{"type":"Buffer","data":[228,58,227,18,169,249,220,156,74,187,91,146,100,198,119,236,158,252,244,107]},"announce":[],"urlList":[]}}