{"title":"Beneath the Veil - Zingaia - 256 Bit rate - jtrans06","uid":15388992,"size":105098687,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e498510226c668d28382c3072fcee6a44a38375a&amp;dn=Beneath+the+Veil+-+Zingaia+-+256+Bit+rate+-+jtrans06&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jtrans06","files":7,"time":1469314766,"description":"Tracks:-\r\n\r\n1. She Beckons.mp3                  2:19      4.25MB\r\n\r\n2. Invocation.mp3                   7:40     13.98MB\r\n\r\n3. Sirens of the Moonlit Tide.mp3   9:06     16.58MB\r\n\r\n4. Veil of Inanna.mp3               8:40     16.58MB\r\n\r\n5. Ast Usari.mp3                    8:28     15.54MB\r\n\r\n6. Beneath the Veil.mp3             9:31     17.28MB\r\n\r\n7. Breath of Passion.mp3            8:46     16.03MB\r\n\r\n\r\n\r\n  Enter now a secret chamber, warm with candlelight, scented silk and the spiraling smoke of incense. A place of mystery where God and Goddess join in the Divine Dance, ancient rhythms draw you in, Beneath the Veil, where the sensuous and the sacred, the Spirit and the Body unite. Awaken the Sacred Fire, come Beneath the Veil.\r\n\r\n  Zingaia is composed of Michael Breene and his wife Katlyn. Breene is credited with composing and performing all the music, while Katlyn wrote the lyrics and along with Veronica Fabre, performed the scrumptiously evocative vocals. Billed as &quot;an ecstatic trance...a Goddess dance.&quot; Beneath the Veil is a deliciously delightful romp through a garden of Tantric Goddess consciousness. Chants, invocations and songs weave their enchanting, mysterious magic as we are gently drawn beneath the veil of Goddesses of love and life. Here is where &quot;the sensuous and the Sacred, the Spirit and the body unite.&quot; A basic Tantric precept is that the body is a sacred temple and when two temples unite in love the Sacred Goddess is invoked in all Her glory.\r\n\r\n   A blend of exquisite music, song, and spoken invocation, evoking the power of women and goddesses. &quot;Beneath the Veil&quot; celebrates the body, the senses, and all the earthy pleasures of erotic satisfaction. You'll soon lose yourself in the sweeping rhythms and throaty vocals. Most of the tracks run long, averaging eight minutes, which makes for a smoother experience if you want to use this material for more than easy listening. My favorites include &quot;Invocation&quot; (with lines like &quot;be the key, open me&quot;), &quot;Sirens of the Moonlit Tide&quot; (with &quot;I am the Evening Star, rising from the twilight sea&quot;), and &quot;Veil of Inanna&quot; (with &quot;The Ruby altar awaits my Love, the boat of heaven is filled with joy&quot;). This music has a definite Middle Eastern sound, with sensual drumming and shimmering synthesizer effects. This recording makes an ideal soundtrack sacred dance, or for rituals devoted to any of the featured goddesses. Awaken the Divine Feminine within yourself and come explore the wonders that await &quot;Beneath the Veil&quot;.\r\n — Elizabeth Barrette\r\n\r\n   All music for this album was composed and performed by Michael Breene, with vocals by Veronica Fabre and Breene's wife, Katlyn. Beneath the Veil broils with the passionate sensuality of the Goddess. Layers of Middle Eastern percussion, heady organ tones, galaxies of space music effects, and seductive vocals invite you to park your rational mind at the door. The introduction to &quot;Sirens of the Moonlit Tide&quot; is almost an undertow; surf curls around your ankles while the wails of the sirens eddy intoxicatingly. &quot;Veil of Inanna&quot; also delves deep; darker vibrations and drones seem to pull the lover-searching goddess into the underworld. The title track swirls paisley tones of space music drones, bells, gongs, organ tones, flutes, and voices. The two female vocalists offer everything one would want in a goddess: sensuality, range, emotion, and presence. Here, the goddesses's spoken proclamations declare &quot;I am the first breath of crystalline space . . .a paradise of deep wilderness. . .the heart that rejoices..&quot; The final track, &quot;Breath of Passion,&quot; uses throaty breathing and organ drones to great effect. Overall, this feast for the ears took me on many exotic and sultry adventures.\r\n\r\n   Strongly percussive melodies lovingly entice the listener to reveal the secret passions of the heart, making Beneath the Veil particularly suited for lovers of all kinds. Breene is a musician to be reckoned with, as his mastery of multiple instruments is obvious. Keyboards, synthesizers and lively, Middle Eastern-based percussion flavor the tracks, as in the opening &quot;She Beckons,&quot; that melts quickly into &quot;The Invocation,&quot; with Katlyn chanting names of the Goddess while a hot percussive dance groove cooks and bubbles underneath.\r\n\r\n   The seven tracks of Beneath the Veil comprise nearly an hour of music, each cue neatly segueing into the next to create a highly cohesive whole. Beneath the Veil is a rare gift.\r\n\r\n   An album of music for &quot;sacred lovers&quot; where each track is a call to the Eternal Divine Feminine.... as Western sounds mix with Far Eastern melodies and rhythms. It's the eroticism of &quot;Veil of Inanna&quot; (based on the myth of the Dance of the Seven Veils) that lifts this album. You can smell the incense, heat and passion as she dances for the release of her lover.... full of lust of a more basic nature. Above all, this is a very personal album... worth looking into by those with an open, inquiring mind.\r\nThis is a work of passion....\r\n\r\n   It was conceived and born in the love of its creators as a hymn to the Goddess","torrent":{"xt":"urn:btih:e498510226c668d28382c3072fcee6a44a38375a","amp;dn":"Beneath+the+Veil+-+Zingaia+-+256+Bit+rate+-+jtrans06","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e498510226c668d28382c3072fcee6a44a38375a","infoHashBuffer":{"type":"Buffer","data":[228,152,81,2,38,198,104,210,131,130,195,7,47,206,230,164,74,56,55,90]},"announce":[],"urlList":[]}}