{"title":"Barzin - My Life In Rooms [2006][EAC,log,cue. FLAC]","uid":8751428,"size":193332799,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e50189a4412b0d2eb71b86106c9180dbb43e8417&amp;dn=Barzin+-+My+Life+In+Rooms+%5B2006%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":12,"time":1375042177,"description":"Artist: Barzin\nRelease: My Life In Rooms\nReleased: 2006\nLabel: Monotreme\nCatalog#: MONO 17CD\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: indie,rock,lo-fi\n\n\n1. Let's Go Driving (3:58)\n2. So Much Time To Call My Own (4:59)\n3. Leaving Time (5:25)\n4. Just More Drugs (3:21)\n5. Take This Blue (4:31)\n6. Acoustic Guitar Phase (4:28)\n7. Won't You Come (3:29)\n8. Sometimes The Night... (3:10)\n9. My Life In Rooms (4:24)\n\nToronto-based singer/songwriter Barzin Hosseini's second album, My Life in Rooms, continues in the melancholic vein of his eponymous 2003 debut. Like fellow slowcore devotees Sparklehorse and Red House Painters, Barzin excavates the despondent territory of loss, regret, loneliness, and claustrophobic isolation. Phrases repeat from song to song, musical motifs weave in an out and reappear in surprising places, and the end result is a closely integrated suite of songs that explores the rewards -- and the cost -- of the artistic life. It's an audacious and ambitious goal, and Barzin partly succeeds by creating a sustained mood throughout the album. His heavily reverbed keyboards and hushed, almost whispered vocals predominate, but the quest is significantly augmented by Great Lake Swimmers' Tony Dekker, who contributes tasteful guitar work, and Karen Graves, whose brooding string arrangements lend needed ballast to these wispy, ethereal tracks. There are deft sonic touches throughout. A pedal steel guitar shimmers through the opening track &quot;Let's Go Driving&quot; and the despairing &quot;Leaving Time,&quot; vibraphones tinkle on &quot;Acoustic Guitar Phase,&quot; and the gorgeously atmospheric instrumental &quot;Sometimes the Night...,&quot; and a ghostly French horn echoes a mournful theme on the album's best track, &quot;Take This Blue.&quot; And to his credit, Barzin manages to quote Pink Floyd's &quot;Comfortably Numb&quot; on &quot;Just More Drugs&quot; without sounding completely ironic. But the album's thematic unity and gently modulated pulse is also its greatest weakness. Barzin's songs are virtually interchangeable, and Mitch Girio's warm, sympathetic production and the surprising and affecting instrumentation are not enough to offset the repetitive nature of the music. By the time the title track rolls around at the end of the album, you'll be wondering if you've heard it all before. And you have -- eight previous times. It's difficult to escape the conclusion that this is a thirty-eight minute exercise in gorgeous tedium. As downcast mood music, My Life in Rooms succeeds admirably. But as an album of songs, it's a lush, lovely, and ultimately monochromatic effort.","torrent":{"xt":"urn:btih:e50189a4412b0d2eb71b86106c9180dbb43e8417","amp;dn":"Barzin+-+My+Life+In+Rooms+%5B2006%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e50189a4412b0d2eb71b86106c9180dbb43e8417","infoHashBuffer":{"type":"Buffer","data":[229,1,137,164,65,43,13,46,183,27,134,16,108,145,128,219,180,62,132,23]},"announce":[],"urlList":[]}}