{"title":"Svarte Greiner - 2006 - Knive","uid":4718655,"size":63064563,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e51d66fd03dcb1cbd48aa44ebd560c2fdd7c5752&amp;dn=Svarte+Greiner+-+2006+-+Knive&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"foristalpa","files":-1,"time":1234401089,"description":"Best known around these parts as one half of the delicious Deaf Center, Erik K. Skodvin is one of Norway's most treasured sons - with his solo release under the Svarte Greiner appellation yet further proof he deserves the keys to Oslo... Labeling itself &quot;acoustic doom&quot; for those with a genre-delineated filing system, 'Knive' sees Skodvin plundering a record collection evidently stacked with the likes of Earth, Badalamenti and Volcano The Bear - coming out the other side with a record that is inky black without becoming oppressive or claustrophobic. Opening with the melted-wax drones of 'The Boat Was My Friend', Svarte Greiner presents an inky arena to experience his music - as crepuscular cello and detached vocals coalesce to forge an ethereal and otherworldly aesthetic. Flecked with pathos and a genuine sense of foreboding, 'The Boat Was My Friend' signals the coming record in a dipping style which evokes images of a late night radio signals heard through a haunted woodland. Moving on from here, 'Ocean Out Of Wood' is a mealy and waterlogged affair, wherein Skodvin allows creaking percussion and pregnant chords to seep into the conscious with just the right balance of light and dark to ensure the textures never become too abrasive or oppressive. Bringing to mind a tarnished copper-rub, the likes of 'My Feet Over There', 'An Ordinary Hike' and 'The Black Dress' all inhabit a musical sphere where shadows are encouraged and light is shunned to piquant effect. Elsewhere, the stunning finale of 'Final Sleep' is heaving with operatics that scar the conscious through cavernous organs straight from Badalamenti's secret chest, 'The Dining Table' lays on a spread of syrupy percussion, whilst 'Ullsokk' allows haunting vocals to chide at the skittering rhythms beneath.","torrent":{"xt":"urn:btih:e51d66fd03dcb1cbd48aa44ebd560c2fdd7c5752","amp;dn":"Svarte+Greiner+-+2006+-+Knive","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e51d66fd03dcb1cbd48aa44ebd560c2fdd7c5752","infoHashBuffer":{"type":"Buffer","data":[229,29,102,253,3,220,177,203,212,138,164,78,189,86,12,47,221,124,87,82]},"announce":[],"urlList":[]}}