{"title":"Home Emergency Guide - (Malestrom)","uid":4761411,"size":7656598,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5201407cdd5f712f74d2aec5cc291b33b550b56&amp;dn=Home+Emergency+Guide+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"malestrom_HH","files":1,"time":1236713105,"description":" &lt;a href=&quot;http://www.image-upload.net/images/khjlf7dis764fuz9jz8t.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/khjlf7dis764fuz9jz8t.jpg&lt;/a&gt;\n\nIllustrated ebook manual that enables anyone to deal quickly and confidently with every emergency affecting the home or family. Carefully structured and colour-coded for instant access to life-saving information, it features easy-to-follow action plans and symptom charts. There is also a fill-in section for emergency contacts. Topics include: asthma; unconsciousness; bleeding; burns; convulsions; cuts; broken bones; checking breathing and pulse; giving medicines; complementary therapies; burst pipes; blocked drain; power failure; broken window; fire safety; chemical spillage; electrical problems; storms; lightening; extreme cold; torrential rain; flood; tornado; and earthquake.\nProviding the key to solving a wide range of problems in the home, the Home Emergency Guide features clear, user-friendly symptom charts to help readers determine whether to call an ambulance or a doctor, or to use self-help measures. From resuscitating a victim or making a sling to learning how to snake a toilet or dealing with a stovetop fire, as well as what to do in case of a hurricane, tornado, or earthquake, this all in one emergency guide explains what steps should be taken in order to keep the reader and family safe, before, during, and after the event.\n","torrent":{"xt":"urn:btih:e5201407cdd5f712f74d2aec5cc291b33b550b56","amp;dn":"Home+Emergency+Guide+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5201407cdd5f712f74d2aec5cc291b33b550b56","infoHashBuffer":{"type":"Buffer","data":[229,32,20,7,205,213,247,18,247,77,42,236,92,194,145,179,59,85,11,86]},"announce":[],"urlList":[]}}