{"title":"Chew Issues 01 - 06","uid":5314115,"size":103331360,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e5950b1a5dfd8e152d0f12c54b8af2f02e6dbe33&amp;dn=Chew+Issues+01+-+06&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Alexstre","files":7,"time":1264652725,"description":"I decide to repack all current scanned issues of Chew. I'm about 99% sure that 07 never made it online, and 08 just came out and seeing that 07 still isn't out, it might take a while before it appears on the interwebs.\n\nI've renamed the archives for convenience and re-archived them all to CBR. Two of them were originally CBZ and majority wins - they are now all CBRs file so MAKE SURE YOU DO NOT OVERWRITE YOUR CHEW FOLDER IF YOU ONLY WANT TO GRAB THE ISSUES YOU'RE MISSING! Use your client's file inspector to check/uncheck the ones you're looking for.\n\nI did NOT include the Black and White reprint that came out in The Walking Dead 63 a while ago. The Walking Dead being an extremely popular series I'm guaranteed you'll be able to find it if you need it.\n\nChew\nChew centers on Tony Chu, a police detective who is &quot;cibopathic,&quot; meaning he gets psychic impressions from whatever he eats. Chu is appointed to the FDA, which, because of the illegalization of chicken, has now become the most powerful law-enforcement branch of the United States government.\n\nProps and credits to the scanners and original uploads. I'm only repacking these for convenience.","torrent":{"xt":"urn:btih:e5950b1a5dfd8e152d0f12c54b8af2f02e6dbe33","amp;dn":"Chew+Issues+01+-+06","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5950b1a5dfd8e152d0f12c54b8af2f02e6dbe33","infoHashBuffer":{"type":"Buffer","data":[229,149,11,26,93,253,142,21,45,15,18,197,75,138,242,240,46,109,190,51]},"announce":[],"urlList":[]}}