{"title":"Family Cums First 2015 WEBRip","uid":12929092,"size":2366283991,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e631c29097eada12a8aa3d1ecffa1d0b36600d31&amp;dn=Family+Cums+First+2015+WEBRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EndYou","files":1,"time":1449503693,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/album/Km\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nReleased: 2015\r\nCountry: USA\r\nDirected by: JWTies\r\nStudio: Desperate Pleasures\r\nGenre: Incest, Family Roleplay, Older Men, Teens\r\nDuration: 1:46:29\r\n\r\nLilith Addams, Lila Rose, Cherry Morgan, Jason Voor, JW Ties\r\n\r\nDear Diary, you'll never believe what daddy and I did yesterday! Dear Diary, Living in a house with two sisters it's rare that I get any &quot;alone time.&quot; Whenever I do I tend to masturbate in the living room. There's something about laying in DAddy's spot and pleasing myself that makes me feel really naughty. I see myself sucking his cock like a lollipop. The thought of Daddy pounding me doggystyle gives me such intense orgasms I have to wonder what it's really like. Maybe one day I'll find out ... Love Lila. Cherry: The other day my brother came in to talk to me. Apparently, when I was &quot;convincing&quot; daddy to up my expenses for school, he saw us. I had no choice but to do what he wanted or he'd tell mom everything. I was a bit weirded out at first but when I saw the size of his cock I began to get turned on. He fucked me slowly until I got used to his size then he fucked me hard. He even came inside me! Hopefully I'm not going to have to explain this to daddy. Lilith: Daddy took me to the beach house over break. The first evening there I went in to thank Daddy and watch some TV. We started talking and I asked him for a sip of his drink. Daddy let me have quite a bit and then things got strange. My own father started hitting on me and groping my breasts. I tried to resist but in truth it turned me on. Daddy was so different from my other boys and made my body tingle at his every touch.\r\n\r\nQuality: WEBRip\r\nFormat: MP4\r\nVideo: MPEG4 Video (H264) 848x480 29.97fps 2806kbps [Video]\r\nAudio: AAC 44100Hz stereo 151kbps [Audio]","torrent":{"xt":"urn:btih:e631c29097eada12a8aa3d1ecffa1d0b36600d31","amp;dn":"Family+Cums+First+2015+WEBRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e631c29097eada12a8aa3d1ecffa1d0b36600d31","infoHashBuffer":{"type":"Buffer","data":[230,49,194,144,151,234,218,18,168,170,61,30,207,250,29,11,54,96,13,49]},"announce":[],"urlList":[]}}