{"title":"BBC Art of America - What lies beneath XviD AC3.avi","uid":6853181,"size":734369792,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e6346202dd587b4eab0a9756a229fc2acf3f8431&amp;dn=BBC+Art+of+America+-+What+lies+beneath+XviD+AC3.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pharos01","files":1,"time":1322599502,"description":"59:40\n\nIn the final part of his United States odyssey, Andrew Graham-Dixon feels the pulse of contemporary America. Beginning in Levittown - the first mass-produced suburb - Andrew uncovers the dark side of post-war consumerism and the role artists have played in challenging the status quo.\n\nHe visits New York's Metropolitan Museum to see the most subversive artwork of 1950s America, Jasper Johns's White Flag. Pop art defined the 1960s and Andy Warhol was its greatest artist. Andrew examines Warhol's soup can paintings, meets his former lover Billy Name and interviews one of the last great surviving pop artists, James Rosenquist.\n\nHe travels west down the open road, exploring its art, arriving in Los Angeles, an artificial dream world that has inspired the graphic style of Ed Ruscha and the city's own unique contribution to 20th century design - Googie architecture.\n\nBack east, Andrew visits the home of one of his favourite 20th century artists, the late Philip Guston, and gets a private view of his work. He drops into the studio of Jeff Koons to learn how the enfant terrible of contemporary art continues to challenge the boundaries of American taste. Finally, he explores the impact 9/11 has had on America and how a new generation of artists, such as Matthew Day Jackson, have made sense of this tragic event.\n\nSource: BBC-HD\n\n\nA/R (WxH): 1:1.78 (720x400)\nVCodec: XviD (2 pass MPEG)\nACodec: AC3 2ch 192Kbps\n\nHD downsized/resized: 1440*1080 to 720*400\n\nFlawless encoding\n\nPls help seed to keep torrent alive!","torrent":{"xt":"urn:btih:e6346202dd587b4eab0a9756a229fc2acf3f8431","amp;dn":"BBC+Art+of+America+-+What+lies+beneath+XviD+AC3.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6346202dd587b4eab0a9756a229fc2acf3f8431","infoHashBuffer":{"type":"Buffer","data":[230,52,98,2,221,88,123,78,171,10,151,86,162,41,252,42,207,63,132,49]},"announce":[],"urlList":[]}}