{"title":"BB King - King of the Blues CD 1 of 4 (1949-1966) [Blues][mp3 19","uid":4956483,"size":106584373,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e6554ec44734ec5703eab4e010cfd031313fa5d6&amp;dn=BB+King+-+King+of+the+Blues+CD+1+of+4+%281949-1966%29+%5BBlues%5D%5Bmp3+19&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":31,"time":1245130889,"description":"BB King - King of the Blues CD 1 of 4 (1949-1966) \nOriginal Release Date: October 20, 1992 \nAudio CD: October 20, 1992 \nNumber of Discs: 4 \nFormat: Box set \nLabel: Mca \nBitrate: 192 kbps\n\nAmazon.com essential recording\nThis four-CD box set remains the absolutely definitive B.B. King collection, with 77 recordings and a biographical book that contains the great singer-guitarist's own remembrances of his decades-long career.  It samples every stage of his development, from his days struggling to craft his music in the shadow of influences like T-Bone Walker and Lonnie Johnson to his latter-day pairings with rockers like Bonnie Raitt and Gary Moore.  The one constant is his open-hearted singing and the soulful, contemplative solos he squeezes from his beloved guitar Lucille.  These discs, of course, embrace all his essential hits, from his first - 1951's &quot;Three O'Clock Blues&quot; - to his 1970 smash &quot;The Thrill Is Gone,&quot; which took King to the pop charts and made him a household name.  If this package is too lavish for the budget, try the excellent Best of B.B. King, Volume 1, which collects many of King's great early works.  ~ Ted Drozdowski \n\nB. B. King has over 200 albums on the market today, ten of which are labeled &quot;Best of&quot; or &quot;Greatest Hits&quot;.  With that much music to pick from it sure his hard to find the right ones to purchase.  This box set of CDs is one of the best places to start your King collection.  It includes four disks with over 75 tracks. The really nice thing about this box set is that each CD has King's hits from different points in time.  CD 1 from 1949 to 1966, CD 2 from 1966 to 1969, CD 3 from 1969 to 1975, and CD 4 from 1975 to 1991. The set also includes a very nice 73-page book all about the life and times of this great Blues artist. ~ Curtis J. George\n\nI am fairly young and still feel like I missed something by not learning about BB King and Muddy Waters at an earlier age. It is almost like coming upon buried treasure, to listen to these songs. \n\nThe energy and emotion of a song such as &quot;I'm Gonna Sit in 'Til You Give In ( and give me all of your love ) &quot; is unbelievable with raw power and energy.  What is especially surprising to me is that I had never heard practically all of these songs played even on oldies stations.  My personal favorites are his early years, but there are no bad songs here on any of the four CD's. Every person has their own favorite song - mine is &quot;Lucille.&quot;  I am simply amazed that I never heard this song before having made this purchase.  There are so many songs which can only be described with superlatives, and this is much too short of a space to do that in.  I bought this box set and can honestly say that I am not skipping songs.  BB King also is on here with the Duke Ellington band, with songs you will not get on any &quot;Best of&quot; collection. \n\nI had picked this up and put it down many times, because I was unsure because of the price of it.  But I have not regretted it one iota since buying it - quite the contrary in fact, as I look at this as one of the best purchases of music I ever made (even paying full price! ).  If you are at all interested in the blues, look into buying this piece of gold from one of the masters. \n\nHighly recommended. ~ Brian Kerecz\n\nPersonnel:\nPaulinho Da Costa - percussion\nJim Keltner\nDean Parks\nRuss Kunkel\nAl Kooper\nB.B. King - vocals, guitar, piano\nHugh McCracken\nErnie Watts\nMerry Clayton - background vocals\nRay Parker, Jr\nDavid &quot;Fathead&quot; Newman - tenor saxophone\nGary Wright - electric piano\nBobby Caldwell - guitar\nBen Webster - saxophone\nMac &quot;Dr. John&quot; Rebennack\nHank Crawford - alto saxophone\nJohnny Ace\nRed Callender\nSonny Freeman\nBobby Forte\nBrian Garofalo - bass\nRonald Cuber - baritone saxophone\nWil Calhoun - drums\nAlso: Ringo Starr, Stevie Wonder, Bonnie Raitt, Stevie Wonder, Leon Russell, Joe Walsh, U2, Carole King, Crusaders, Bobby Bland \n\nBB King - King of the Blues CD 1 of 4 (1949-1966) Tracks:\n01  Miss Martha King (previously unreleased) 2:42 \n02  She's Dynamite 2:31 \n03  Three O' Clock Blues 3:02 \n04  Please Love Me 2:48 \n05  You Upset Me, Baby 3:02 \n06  Everyday I Have The Blues 2:48 \n07  Rock Me Baby 3:02 \n08  Recession Blues 2:21 \n09  Don't Get Around Much Anymore 3:15 \n10  I'm Gonna Sit In 'Til You Give In 2:13 \n11  Blues At Midnight 2:59 \n12  Sneakin' Around 2:07 \n13  My Baby's Comin' Home 2:08 \n14  Slowly Losing My Mind (previously unreleased) 2:31 \n15  How Blue Can You Get? (previously unreleased) 2:42 \n16  Rockin' Awhile (previously unreleased) 2:44 \n17  Help The Poor (previously unreleased) 2:38 \n18  Stop Leadin' Me On (previously unreleased) 2:22 \n19  Never Trust A Woman (previously unreleased) 2:37 \n20  Sweet Little Angel (live) 3:50 \n21  All Over Again 2:35 \n22  Sloppy Drunk (previously unreleased) 3:11 \n23  Don't Answer The Door 5:10 \n24  I Done Got Wise 2:20 \n25  Think It Over 2:51 \n26  Gambler's Blues (live) 3:16","torrent":{"xt":"urn:btih:e6554ec44734ec5703eab4e010cfd031313fa5d6","amp;dn":"BB+King+-+King+of+the+Blues+CD+1+of+4+%281949-1966%29+%5BBlues%5D%5Bmp3+19","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6554ec44734ec5703eab4e010cfd031313fa5d6","infoHashBuffer":{"type":"Buffer","data":[230,85,78,196,71,52,236,87,3,234,180,224,16,207,208,49,49,63,165,214]},"announce":[],"urlList":[]}}