{"title":"Big Land, The {Alan Ladd} (Western) [1957] .avi","uid":7756355,"size":927625792,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e6ba41542c7e67454e7d8a0d2d140f4bab551729&amp;dn=Big+Land%2C+The+%7BAlan+Ladd%7D+%28Western%29+%5B1957%5D+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alien99","files":1,"time":1351111070,"description":"found this on one of my hard drives no idea where i got it but it was from\nencore westerns logo in lower right corner, i feel file size is little large\nfor quality but more then watchable its just plain mono tv\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0050192/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0050192/&lt;/a&gt;\n\nWhen Alan Ladd and his partners bring their cattle from Texas to Missouri, local cattle buyer Anthony Caruso cheats the men and treats them like he's doing them a favor in the process! Ladd, however, doesn't fight--having a live and let live attitude.\n\nLadd travels to a nearby town and is treated pretty poorly by the locals since he's a Southerner and the Civil War just ended. However, he stumbles into a relationship with Edmond O'Brien--an alcoholic who has a long history of screwing up his life. Ladd is able to help this new friend find a sense of direction and clean up his life, as they both hit on a scheme to build a town in Kansas that will make cattle drives closer AND they won't need to deal with Caruso. Of course, Caruso made it a habit of playing evil jerks in Westerns during the 50s, so it's pretty certain that he won't just sit back and watch as this new cattle town is created. And when he does behave in a naughty fashion, guess who's the guy to bring justice to this new town?\n\nThe film is helped by two excellent leads--Ladd and O'Brien. While story elements are often quite familiar here (the tough boss, the hero that is slow to act, John Qualen with his Swede routine, etc.), the film is handled well and is enjoyable throughout.\n","torrent":{"xt":"urn:btih:e6ba41542c7e67454e7d8a0d2d140f4bab551729","amp;dn":"Big+Land%2C+The+%7BAlan+Ladd%7D+%28Western%29+%5B1957%5D+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6ba41542c7e67454e7d8a0d2d140f4bab551729","infoHashBuffer":{"type":"Buffer","data":[230,186,65,84,44,126,103,69,78,125,138,13,45,20,15,75,171,85,23,41]},"announce":[],"urlList":[]}}