{"title":"Greg Lake - I Believe In Father Christmas","uid":4563780,"size":31374320,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e73f7dd1f2eedccfb664651f11523fff056c6ee2&amp;dn=Greg+Lake+-+I+Believe+In+Father+Christmas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Blindpew","files":-1,"time":1228783796,"description":"Video Promo\n640x480\nxvid _ Tv Rip\n\nI Believe In Father Christmas&quot; is a song by Greg Lake (most famously a member of Emerson, Lake &amp; Palmer). Although it is often categorised as a Christmas song this was not Lake&amp;#039;s intention. Lake wrote the song in protest of the commercialization of Christmas.\nThe song is often misinterpreted as an anti-religious song and, because of this, Lake was surprised at its success. He said in a Mojo magazine interview:\n&quot;I find it appalling when people say it&amp;#039;s politically incorrect to talk about Christmas, you&amp;#039;ve got to talk about &amp;#039;The Holiday Season.&amp;#039; Christmas was a time of family warmth and love. There was a feeling of forgiveness, acceptance. And I do believe in Father Christmas.&quot;\n\nThe song was recorded by Lake in 1974 and released separately from ELP in 1975, becoming the Christmas number two in the UK charts. It is currently his only hit solo release. The original later appeared on the group&amp;#039;s 1977 album Works Volume II. It has also appeared on several other ELP and Christmas compilation albums. Mostly notable of these re-releases is the 1995 album titled I Believe in Father Christmas which also featured a re-recorded version of the song by the whole band.\n\nThe video for this song, the bulk of which was shot in Palestine and Jordan, contains shots of the Vietnam War, which has led to complaints from some that it should not be shown with light-hearted Christmas songs. These images of rocket barrages, air strikes, and mobile artillery are a violent backdrop to a peaceful sounding song and create a hard-hitting message.\n\nThe instrumental riff between verses comes from the &quot;Troika&quot; portion of Sergei Prokofiev&amp;#039;s Lieutenant Kije Suite written for a 1934 Soviet film, Poruchik Kizhe.","torrent":{"xt":"urn:btih:e73f7dd1f2eedccfb664651f11523fff056c6ee2","amp;dn":"Greg+Lake+-+I+Believe+In+Father+Christmas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e73f7dd1f2eedccfb664651f11523fff056c6ee2","infoHashBuffer":{"type":"Buffer","data":[231,63,125,209,242,238,220,207,182,100,101,31,17,82,63,255,5,108,110,226]},"announce":[],"urlList":[]}}