{"title":"Eminem_Complete_Discography [1995-2011]-97E","uid":6902593,"size":5304569978,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e77d147bcfde78aaa03293262b8f8dcbb46c58bf&amp;dn=Eminem_Complete_Discography+%5B1995-2011%5D-97E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"raiz97","files":1097,"time":1324460026,"description":"....................................&quot;EMINEM&quot;......................................\nAll Album Complete Discography\n\nThis Eminem albums list contains all the Eminem albums that have made him a star. Eminem has had hit after hit with these albums, and they often come with a lot of controversy.\n&quot;Slim Shady LP&quot; 1999- This album was Eminem's major debut album. The album contains his break out hit &quot;My name is.&quot; This song introduced Eminem's over done alter ego Slim Shady. The album was filled with over-exaggerated descriptions of sex, drugs and violence. One song on the album &quot; Guilty Conscious&quot; garnered a lot of controversy because the song shows the rapper encouraging people to do evil acts.\n&quot;Marshall Mathers LP&quot; 2000- This album received more critical acclaim than the previous one. The albums biggest hits included &quot;The Real Slim Shady&quot;  and &quot;Stan&quot;. Although &quot;The Real Slim shady&quot; was a fun song &quot;Stan &quot; was very serious. &quot;Stan&quot; is about an obsessed fan who mistreats his girlfriend because of his obsession. The song went on to receive critical acclaim\n&quot;The Eminem show&quot; 2002- This album on the list garnered a Grammy for the Best Rap album. The album had many hits such as &quot;Soldiers&quot;, &quot;Superman&quot;,&quot;Without me&quot; and &quot;Cleaning out my closet.&quot; Once again, the album received criticism for its homophobic lyrics. This is something that appears in almost all of Eminem's albums.\n&quot;Encore&quot; 2004- Although &quot;Encore&quot; was a commercial success, the album took criticism not for its violent or sexual content, but because of its simplistic lyrics. Many people felt this album had simpler lyrics than albums in the past. The albums singles included &quot;Ass Like That&quot; and &quot;Just Loose it&quot;.\n&quot;Relapse&quot; 2009- In this album, Eminem talked about his last drug overdose. He drew criticism because the album contained lyrics about killing pop stars. The album was a commercial success but did not get very many positive reviews.\n&quot;Recovery&quot; 2010- &quot;Recovery&quot; is Eminem's last and most recent album on the list. The album received critical acclaim and won a Grammy for Best Rap Album. The albums biggest hit included &quot;Love The Way You Lie&quot; and &quot;Not Afraid.&quot;","torrent":{"xt":"urn:btih:e77d147bcfde78aaa03293262b8f8dcbb46c58bf","amp;dn":"Eminem_Complete_Discography+%5B1995-2011%5D-97E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e77d147bcfde78aaa03293262b8f8dcbb46c58bf","infoHashBuffer":{"type":"Buffer","data":[231,125,20,123,207,222,120,170,160,50,147,38,43,143,141,203,180,108,88,191]},"announce":[],"urlList":[]}}