{"title":"PulpMotion Advanced 3.0.3 + Serial","uid":5476159,"size":122372660,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:e8ee03f2cdf97d3809ac555666519acd7dd7d199&amp;dn=PulpMotion+Advanced+3.0.3+%2B+Serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"artpepper","files":-1,"time":1270156639,"description":"PulpMotion Advanced 3.0.3 | Mac Os X | 115 MB\n\nPulpMotion Advanced is the next generation slideshow and animation software for your media.\n\nPulpMotion Advanced creates slideshow based on highly customizable themes. It allows you to present your pictures as well as your video in a single animation you can share as video, screensaver or executable player. \n\nPulpMotion Advanced makes your pictures come to life with animation created from regions of interest you can easily define with the integrated editor. Your pictures are no more static but reveal a new dimension. You can also record audio comments on the fly, add music and let PulpMotion Advanced take care of the synchronization and sound transitions.\n\nCreate never-seen-before animations in no time and tell you stories with style... with PulpMotion Advanced.\n\n    * Simple to use and elegant interface that hides the complexity of the animation and synchronization logic\n\n    * Refined workflow with lots of productivity enhancements.\n\n    * Performance boost throughout the application.\n\n    * Ability to edit all your media (sound waveform, images and video) inside the application.\n\n    * Total control over the audio timelines. Ability to record audio comments. Ability to control the respective volume of each sound track. Automatic cross-fades.\n\n    * Waveform editor lets you adjust the IN and OUT points in your audio.\n\n    * Gorgeous themes with built-in presets. You can choose your preset visually from a browser.\n\n    * Very versatile media browser built on top of Core Data for very fast media browsing. Support for multiple Aperture, iPhoto and Lightroom catalogs. Support for exotic datastores such as iDive and MemoryMiner.\n\n    * Unique full-screeen media browser. Use all the available screen real-estate and get an additional timeline view to select date ranges for your media.\n\n    * Safe frame mode lets you compose your animation with the ouput frame ratio in mind.\n\n    * Feature packed export (Quicktime based) including some advanced anti-aliasing and motion blur options.\n\n    * More obvious conversion dialog lets you create variants of your master export: choose between formats such asAVI, MP4, 3G, etc...\n\n    * Standalone player lets you package your compositions as an application.\n\nOperating System Requirements:\n\nThis product is designed to run on the following operating systems:\n\n    * Mac OS X 10.5 Intel\n    * Mac OS X 10.5 PPC\n    * Mac OS X 10.4 Intel\n    * Mac OS X 10.4 PPC\n\nAdditional Requirements:\n\n    * An iSight camera or DV camera (optional)\n\nHomepage: &lt;a href=&quot;\nhttp://www.aquafadas.com/en/pulpmotion/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.aquafadas.com/en/pulpmotion/&lt;/a&gt;","torrent":{"xt":"urn:btih:e8ee03f2cdf97d3809ac555666519acd7dd7d199","amp;dn":"PulpMotion+Advanced+3.0.3+%2B+Serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8ee03f2cdf97d3809ac555666519acd7dd7d199","infoHashBuffer":{"type":"Buffer","data":[232,238,3,242,205,249,125,56,9,172,85,86,102,81,154,205,125,215,209,153]},"announce":[],"urlList":[]}}