{"title":"V.A. - House Sound Pack (2011) ","uid":6400835,"size":720598167,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e99b08e4468d25afb5bb3f1ecc52ce109e5b9ccb&amp;dn=V.A.+-+House+Sound+Pack+%282011%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":131,"time":1305657741,"description":"V.A. - House Sound Pack (2011) \n\nArtist: VA \nTitle: House Sound Pack \nGenre: House \nReleased: 2011 \nNumber Of Tracks: 130 \nSound: Mp3 | 128 kbps \n\nTracklist:\n----------------\n001. David Vendetta Ft London Beat - I've Been Thinking About You (Dim Chris Remix)\n002. Andrew Bennett - Adagio For Strings (Original Mix)\n003. Offer Nissim Ft. Epiphony &amp; Elisete - Million Stars (Original Club Mix Dj Akken Intro Edit)\n004. Forseco - Breakaway (Extended Mix)\n005. Mitch Crown - Crazy\n006. Ellie Goulding - Lights (Rollin Stars Feat. D-Seven Remix)\n007. Peter Gelderblom - Waiting 4 (Tim Royko Remix)\n008. Eric Prydz - Niton (Pryda 82 Mix)\n009. Britney Spears - Hold It Against Me (Ocelot) [Club]\n010. Francesco Gomez - I Get No Sleep (Original Vocal Mix)\n011. Chocolate Puma - Whohadchants (Dj Karasev Remix)\n012. Adele - Someone Like You (eSQUIRE vs OFFBeat Remix DJ INTRO)\n013. Mischa Daniels Feat. I-Fan - Child Of Love (Dabruck &amp; Klein Remix)\n014. Aeron Aether Feat. Cathrine - Twilight (Mango Pres. Tokyo Bay Cruise Remix)\n015. Eric Tyrell and Denice Perkins feat. Housemade G - New World Order (Tune Brothers Remix)\n016. Dj Feel, Matisse &amp; Sadko - A Day To Remember (Original Mix)\n017. Duffy - Mercy (Gareth Wyn Remix Edit)\n018. Coolio - Gangstas Paradise 2010. (Tavozs extended mix)\n019. Armand Van Helden And Steve Aoki - Brrrat! (His Majesty Andre Remix)\n020. Scaloni &amp; DJ Tatana - Flash (Original Mix)\n021. DJ Moms - Pray (Radio Edit)\n022. Pedro Diaz - Dancefloor Angel Pres. Archybak Feat. Phil G - Artistic Raw Remix\n023. Carlos Russo - Endless Love (Original Mix)\n024. Roger Sanchez - 2gether (Dabo Italian Radio Edit)\n025. Sebastian Krieg, Strobe - Twist In My Sobriety - Strobe Remix\n026. Chus Soler And J. Louis - Disco Fans (Original Mix)\n027. Peter Gelderblom - Waiting 4 (Manuel De La Mare Remix)\n028. Gyptian - Hold You (Major Lazer Remix)\n029. Jasper Forks - Alone (Money G's DD Mix)\n030. Virginalex - Sexual Bizarre (Marco Rigamonti Radio Remix)\n031. John Dahlback Feat. Terri B - Flirt (Club Mix)\n032. Tito Torres - Walk Me By Feat. Ella - Kash Trivedi Remix\n033. DJ DLG ft. Kinch - Tie Me Lightly (D-Seven Remix)\n034. Groove Cocktail Feat. Nathalia - One Love (Dj Haze String Remix)\n035. Medina - Addiction\n036. Nick Svenson, Simon D - Galaxy (Aron Scott, Xantra Remix)\n037. Mats Mattara Feat. Rockman - Opera (World Extended Mix)\n038. Boycott - Angel Feat. M Slice - Winman Remix\n039. Sebastien Leger - Victory - Original Mix\n040. T-Pe3 - Mylopotas (On The Beach Mix)\n041. Twin Pitch - Angel - Original Mix\n042. Alex De Vito - Im A Fucking Vip\n043. Coolio - Gangstas Paradise 2010 (Remixes Video Mix)\n044. Bodytalk - Fly Together Feat. Bruno Gomes - Club Mix\n045. Pi - The Time (Dirty Bit)\n046. Jeremy Kalls - Anything for You (Radio Edit)\n047. Above &amp; Beyond Feat. Richard Bedford - Sun &amp; Moon (Kim Fai Club Mix)\n048. Remaniax - Festival Of Love (Original Mix)\n049. Neo - Smoking Blues - Original Mix\n050. Moullinex - Love It Is Then\n051. Moullinex - Catalina\n052. Moullinex - Tear Club\n053. eSQUIRE vs Chris Lake &amp; Marco Lys - Cross The Line For Me (eSQUIRE Bootleg)\n054. Barry Devlin - Nova (Original Mix)\n055. Jasper Forks - Alone\n056. Alchemist Project - Calling For You (Extended Mix)\n057. Afrojack Feat. Eva Simons - Take Over Control\n058. Basto - Gregory's Theme (Asino Di Medico Remix)\n059. Rihanna - S And M (Sidney Samson Radio)\n060. Jennifer Lopez Feat Pitbull - On The Floor (Mixin Marc N Tony Svejda La To Ibiza Mix)\n061. Koen Groeneveld And Addy Van Der Zwan - Do It Do It\n062. Kaskade And Tiesto Feat Haley - Only You (Dragon And Jontron Remix)\n063. Axel Bauer &amp; Lanford Feat. Stephen Pickup - Another Day (Vocal Mix)\n064. Laserkraft 3d - Nein Mann (Tocadisco Remix Edit)\n065. Dirty Kidz - Ole Ola Feat. Shalya, Don Seydina - Christian Sims &amp; Fontana Remix\n066. Dj Sava - Sweet Love Feat. Raluka - Deepside Deejays Remix\n067. Dj Chrixx feat. Morri - Got to Let You Know (Radio Edit)\n068. CJ Stone Feat. Lyck - Mindful Thinking (Extended Mix)\n069. Axwell Feat. Errol Reid - Ive Got Nothing But Love (Remode)\n070. Moullinex - Chocolat\n071. Rico Bernasconi vs Sasha Dith - Bollywood (Saxo Club Mix)\n072. Sultan, Ned Shepard, Nadia Ali - Call My Name (Etienne Ozborne Gallery Room Mix)\n073. Gianni Kosta - I Want To Give You (Taito Remix)\n074. Funkerman - Unconditional Love (feat Ida Corr) (Firebeatz remix edit)\n075. Dinka - Hive (Stan Kolev Remix)\n076. Primo - Sexy Sax (Radio Edit)\n077. Eric Chase - Everybody Surrender\n078. Avicii &amp; Sebastien Drums vs Shakedown - Even At Night (eSQUIRE Bootleg)\n079. Dj Gregory And Gregor Salto Feat. Serafim Crew - Paris Luanda (Steven Jamal Edit)\n080. Moullinex - Meow\n081. Avicii - Fuck The Music (Original Mix)\n082. Marco V &amp; Mohawk - Ego Clash\n083. Loic Penillo feat. Audrey Valorzi - Pura Vida (Spanish Radio Edit)\n084. Rino Cabrera - Seize The Night (Original Mix)\n085. Mike Posner Ft. Lil Wayne - Bow Chicka (Adam1Time Remix)\n086. Suae - Cooler Than Me (City Kicks Remix)\n087. Alain Bertoni - Restart With Love Feat. Jimmy Slitter - Side Chain Remix\n088. Auburn Feat. Iyaz - La, La, La\n089. Croatia Squad - Nachtrose (Original Mix)\n090. David Vendetta Featuring Rachael Starr - Holding On (Moonbeam Remix)\n091. Nick Skitz Vs Dj Lotus - Only Girl (In The World) (Freddy O Edit)\n092. DNA feat. Rebecca Knight - In My Head (East &amp; Young Remix)\n093. Olav Basoski - New Day (Redroche Remix)\n094. Deadmau5 Und Wolfgang Gartner - Animal Rights\n095. Del Gibbons Feat. Miss Roberts - Freedom (Wez Clarke Remix)\n096. Love Beat - Find Out (Soulgangsters Dub Mix)\n097. Laid Back - Bakerman 2010. (Tavozs retro remix)\n098. OFFBeat and Di Scala - Bye vs Whelan and Di Scala - Breath Away (eSQUIRE Bootleg)\n099. Mark Simmons - Heartache (Original Mix)\n100. Afrojack - Esther\n101. T-Killah Feat.(Dj Stylezz Remix)\n102. Lady GaGa - Born This Way vs Express Yourself (Rafael Lelis Alternative Mix)\n103. Out of Blackout - Can We (Jerry D. Remix)\n104. Bruno Mars - Grenade (John de Sohn Remix)\n105. Remady Feat. Lumidee And Chase Manhattan - Im No Superstar (Voodoo And Serano Club Mix)\n106. Carra And Rudari Feat Sam Wood - Music In Me (Original Mix)\n107. Mike Candys - Together Again\n108. Christopher S. Feat. Manuel - Relight My Fire (Christopher S. Mix)\n109. Gonso Rivas &amp; Alex Avino - Ella Me Levanto 2010 (Original Mix)\n110. Daft Punk - Derezzed (Avicii Remix)\n111. Nervo Feat. Ollie James - Irresistible\n112. Alex Gaudino feat. Kelly Rowland - What A Feeling (I'm Still In Love Club Mix)\n113. Lady GaGa - Born This Way (Rafael Lelis Club Mix)\n114. Junior Jack - Stupidisco (Weekend Vibes Remix)\n115. Adam Lambert vs Cascada vs Estelle vs Ludacris vs B.o.B. - If I Had A Freak (Mole MEGA Mashup)\n116. Max Farenthide - I Love Music (Digital Mode Techtribe Rmx)\n117. Rihanna - Only Girl In The World (Mark Pride Remix)\n118. Adi-Ermane - Need Each Other - Luke Jeferson Mix\n119. Coming Out - Start Again (Datamotion Edit Remix)\n120. Avicii - Street Dancer (Tristan Garner Remix)\n121. Example - Kickstarts (Klaas Radio Mix)\n122. Basto! - Gregory's Theme (Radio Edit)\n123. R.I.O. - Like I Love You\n124. Noel Sanger - Everglade Anthem (Original Mix)\n125. Marcus Maison And Will Dragen - Digital Freedom (Original Mix)\n126. Allan V - Wake Up (Hazem Beltagui Late Night Remix)\n127. Taio Cruz - Higher (Wideboys Radio Edit)\n128. Sergio Dalhbak Feat Zafra Negra - Sufriendo Por Ella (Original Mix)\n129. Dito &amp; Spago - Never Mind (David Folkebrant Do You Mind Remix)\n130. Plastikbass Feat. Oliver Kobs - Es Wird Laut\n\n","torrent":{"xt":"urn:btih:e99b08e4468d25afb5bb3f1ecc52ce109e5b9ccb","amp;dn":"V.A.+-+House+Sound+Pack+%282011%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e99b08e4468d25afb5bb3f1ecc52ce109e5b9ccb","infoHashBuffer":{"type":"Buffer","data":[233,155,8,228,70,141,37,175,181,187,63,30,204,82,206,16,158,91,156,203]},"announce":[],"urlList":[]}}