{"title":"Fantasy Book","uid":11826496,"size":445937392,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e9a54ce58e8f4616538063567f7283156a3ffa77&amp;dn=Fantasy+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":20,"time":1429516050,"description":"Caveat: Not really a comic book.\n\nI've struggled with what to do with this one for years. Also, I swear I had a complete run at one time, but I can't seem to find it. Not necessarily a bad thing, because to the best of my memory, these scans look better than the ones I had before.\n\nSo, what is it?\n\nThe cover says &quot;Illustrated Fantasy Fiction At Its Finest&quot;\n\nIt's an illustrated fantasy and science fiction anthology. It was published from 1981 to 1987 when it went on &quot;hiatus&quot; (a hiatus which I'm fairly certain never ended). Here you have issues 1-2, 5-7 and 9-23 (with the last being the &quot;Hiatus Issue&quot;). \n\nOver the course of it's run the guts contained serials, novelettes, short stories, poetry, editorials and features relating to the type of stories printed in the anthology, or about the stories in the anthology themselves, reviews of all things fantasy related (games, books, etc.), at one point it had an ongoing comic (a few pages per issue) that was clearly a rif on Elfquest, Elflord, etc., as well as numerous illustrations in each issue (some for the quite beautiful).\n\nI think there's a certain portion of people who like and regularly download the kind of stuff I upload who would also really like this, but it may not belong here in Comics. I'm really not sure, which is part of the reason I never bothered uploading it before. If y'all think it would better fit in, say, ebooks, please don't hesitate to say so and I'll ask to have it moved to that category.\n\nI wish I could supply more clear information, but it's completely generic title (sorry whoever came up with it - I love what you did here, but the name is terrible) has made it very difficult to find any clear information about this really very good publication. That's another thing that has always frustrated me about uploading it. Y'all know I don't like to upload without clear info.\n\nThere are NUMEROUS contributors to each issue, far too many to list in detail. Some, but nowhere near all of the contributors, include: Sherwood Springer, Charles Vess, Diane Duane, Alan Dean Foster, L. Ron Hubbard (oh man, did anybody watch that HBO documentary?), D. Jeffrey Ostling, Jim Neal, Brian Lumley, Jessica Salmonson, Robert E. Howard, Sharon Lee, Steve Miller, Janice Law, Josepha Sherman, Diana L. Paxson, Jefferson P. Swycaffer, Leigh Ann Husey, Joshua Quagmire, and really just so, SO many more.\n\nOne last note: Cupules uploaded a few of these individually in the past (they're in eBooks). Those are pdf's, these are cbr's (yes, I know the apostrophe makes the file extensions possessive... whatever lol)","torrent":{"xt":"urn:btih:e9a54ce58e8f4616538063567f7283156a3ffa77","amp;dn":"Fantasy+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9a54ce58e8f4616538063567f7283156a3ffa77","infoHashBuffer":{"type":"Buffer","data":[233,165,76,229,142,143,70,22,83,128,99,86,127,114,131,21,106,63,250,119]},"announce":[],"urlList":[]}}