{"title":"Houdini The Ultimate Spellbinder by Tom Lalicki","uid":10096964,"size":5496163,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea09ffa7e243173192a3f917e18937a24f7659a0&amp;dn=Houdini+The+Ultimate+Spellbinder+by+Tom+Lalicki&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"PirateBook","files":1,"time":1399319155,"description":"\nOriginally published as: SPELLBINDER: The Life of Harry Houdini. He was born Ehrich Weiss but, at an early age, he chose another name for himself. He wanted a name to suit his career of magic and entertainment and he chose a name that paid homage to one of the legendary magicians of all time: Robert Houdin. \n\nHis illusions and escapes were more astonishing and more challenging than anyone had ever done before and he eclipsed the names of all other magicians as his fame reached around the world, made him famous and made him the most famous illusionist ever. \n\nHoudini disappeared through brick walls. He escaped from straitjackets and then straitjackets immersed in water. He performed escapes in public places and from jail cells in major cities--and the crowds flocked to his performances. \n\nTom Lalicki tells Houdini's story with a fascinating mix of text and images, revealing the facts and juxtaposing them with startling images of a master entertainer performing masterfully and mysteriously, mesmerizing his audiences and mystifying experts with his skill and his invention.\n\nGenre: Non Fiction, Biography","torrent":{"xt":"urn:btih:ea09ffa7e243173192a3f917e18937a24f7659a0","amp;dn":"Houdini+The+Ultimate+Spellbinder+by+Tom+Lalicki","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea09ffa7e243173192a3f917e18937a24f7659a0","infoHashBuffer":{"type":"Buffer","data":[234,9,255,167,226,67,23,49,146,163,249,23,225,137,55,162,79,118,89,160]},"announce":[],"urlList":[]}}