{"title":"Seer Systems Reality 1.5","uid":7456574,"size":158434424,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ea8b75459e9eb50228cce4a59caa494e552a14c6&amp;dn=Seer+Systems+Reality+1.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1342682501,"description":"Ah, the old days. Before VST instruments, there was Reality.\n\nYou'll have to run this one on an old Win98 box (or emulator).\n\nScreenshot: http://www.vintagesynth.com/misc/reality.gif\n\n====================\n\nReality turns your PC into a flexible synthesizer powerhouse with five types of synthesis: sample-based, virtual analog, FM, modal, and numerous physical models. With ultra- quick, real-time response, you can play Reality just as you would any other real musical instrument. Because it is a real musical instrument. Create your own sounds or choose from the hundreds of multi-sampled instruments and fat synthesized textures included on the CD- ROM. Reality is 16-part multitimbral with up to 128- note polyphony.\n\nIt can be run concurrently with your favorite sequencing software to create a self-contained music workstation on your computer for live performance, sequencing, composition, sound effects, or sound design. Reality uses Microsoft DirectSound for compatibility with the widest range of audio cards possible, with more added every month. SoundFont 2.0 support gives you access to literally thousands of great sampled sounds. The new MIDI Sequence Player allows you to import and play standard MIDI files and save them along with your sounds. Reality is a powerful, upgradeable addition to any MIDI system for far less than you'd pay for a new keyboard or sound module.","torrent":{"xt":"urn:btih:ea8b75459e9eb50228cce4a59caa494e552a14c6","amp;dn":"Seer+Systems+Reality+1.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea8b75459e9eb50228cce4a59caa494e552a14c6","infoHashBuffer":{"type":"Buffer","data":[234,139,117,69,158,158,181,2,40,204,228,165,156,170,73,78,85,42,20,198]},"announce":[],"urlList":[]}}