{"title":"Knit Mittens - 15 Cool Patterns to Keep you Warm","uid":9128508,"size":9994590,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb666315137373dcbbb113995d87aae93cebcfcc&amp;dn=Knit+Mittens+-+15+Cool+Patterns+to+Keep+you+Warm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KnitLady","files":-1,"time":1383269964,"description":"Knitting is in. Julia Roberts knits, high schoolers are knitting in the cafeteria, urbanites are knitting on the subway, college students are knitting in the dorms, and bookstores are sponsoring knitting groups. Colorful new yarns, the availability of simple patterns, gift giving, stress relief - all are reasons for picking up knitting needles and getting started on a great project. Though knitting is growing in popularity, knitters still want projects that are fast and easy, but ultimately useful and attractive. KNIT MITTENS! is a colorful die-cut book that's small enough to tuck into a knitting bag, backpack, or purse. The book begins with an easy-to-understand, illustrated overview of the basic techniques followed by 15 fun project patterns (with instructions for a range of sizes) bound between sturdy, die-cut board covers. Each pattern includes the following: a close-to-life-size color photo of the completed mitten or hat; a brief introduction to the pattern; materials and equipment lists; gauge information; a color chart; special tips and hints; and a detailed drawing of any unusual techniques involved. Because the rich palette flows through each book, knitters can mix and match hats (in Knit Hats!) and mittens to create unique sets.","torrent":{"xt":"urn:btih:eb666315137373dcbbb113995d87aae93cebcfcc","amp;dn":"Knit+Mittens+-+15+Cool+Patterns+to+Keep+you+Warm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb666315137373dcbbb113995d87aae93cebcfcc","infoHashBuffer":{"type":"Buffer","data":[235,102,99,21,19,115,115,220,187,177,19,153,93,135,170,233,60,235,207,204]},"announce":[],"urlList":[]}}