{"title":"The Silkworm - Robert Galbraith","uid":10555457,"size":603987,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:edab6915ed4889968e5b6b04a5ccfd10b4081ae3&amp;dn=The+Silkworm+-+Robert+Galbraith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1405388328,"description":"When novelist Owen Quine goes missing, his wife calls in private detective Cormoran Strike. At first, she just thinks he has gone off by himself for a few days - as he has done before - and she wants Strike to find him and bring him home.\n\nBut as Strike investigates, it becomes clear that there is more to Quine's disappearance than his wife realises. The novelist has just completed a manuscript featuring poisonous pen-portraits of almost everyone he knows. If the novel were published it would ruin lives - so there are a lot of people who might want to silence him.\n\nAnd when Quine is found brutally murdered in bizarre circumstances, it becomes a race against time to understand the motivation of a ruthless killer, a killer unlike any he has encountered before . . .\n\nA compulsively readable crime novel with twists at every turn, The Silkworm is the second in the highly acclaimed series featuring Cormoran Strike and his determined young assistant Robin Ellacott.\n\nReview\n\nPRAISE FOR THE CUCKOO'S CALLING:\n\n&quot;The master is back. . . [Rowling] returns to the strengths that made Harry Potter great--the beautiful sense of pacing, the deep but illusionless love for her characters--without sacrificing the expanded range of The Casual Vacancy.&quot; --USA Today (3.5/4 stars)\n\n&quot;A gritty, absorbing tale.&quot; --People\n\n&quot;Cleverly plotted... Rowling serves up a sushi platter of red herring, sprinkling clues along the way, before Strike draws a confession out of the killer in a climax straight out of Agatha Christie.&quot; --Entertainment Weekly\n\n&quot;Highly entertaining [with] a team whose further adventures the reader cannot help eagerly awaiting.&quot; --Michiko Kakutani, New York Times\n\n&quot;[Rowling's] literary gift is on display in this work. She crafts an entertaining story [and] comes up with an ending that I'll admit I was surprised by. . . . A fun read, with a main character you can care about and one you'll want to see again in other adventures.&quot; --The Washington Post","torrent":{"xt":"urn:btih:edab6915ed4889968e5b6b04a5ccfd10b4081ae3","amp;dn":"The+Silkworm+-+Robert+Galbraith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edab6915ed4889968e5b6b04a5ccfd10b4081ae3","infoHashBuffer":{"type":"Buffer","data":[237,171,105,21,237,72,137,150,142,91,107,4,165,204,253,16,180,8,26,227]},"announce":[],"urlList":[]}}