{"title":"Hans_Zimmer-The_Simpsons_Movie-OST-2007-SAW","uid":4107587,"size":58831512,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:efea773db1ea56b9c08c76169731290d8a039f30&amp;dn=Hans_Zimmer-The_Simpsons_Movie-OST-2007-SAW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"silicon_valley","files":-1,"time":1206893290,"description":"Artist     : Hans Zimmer\nAlbum      : The Simpsons Movie\nLabel      : Rhino\nGenre      : Soundtrack\nBitrate    : 190 kbps avg\nSource     : CD (LP)\nPlaytime   : 00:40:39  (58.8MB)\nRls date   : 2007-07-21\nStore date : 2007-07-24\n\n\n[Track List]\n1. The Simpsons Theme (Orchestral Version)         1:27\n2. Trapped Like Carrots                            2:14\n3. Doomsday Is Family Time                         2:27\n4. Release The Hounds                              2:19\n5. Clap For Alaska                                 1:55\n6. What&amp;#039;s An Epiphany?                             2:07\n7. Thank You Boob Lady                             2:45\n8. You Doomed Us All... Again                      5:52\n9. ...Lead, Not To Read                            2:05\n10.Why Does Everything I Whip Leave Me?            3:05\n11.Bart&amp;#039;s Doodle                                   1:01\n12.Worlds Fattest Fertilizer Salesman              5:05\n13.His Big Fat Butt Could Shield Us All            1:46\n14.Spider Pig                                      1:04\n15.Recklessly Impulsive                            5:27\n\n\nby Brian McVickar:\n\nI must admit that when I read Hans Zimmer had been signed\nas composer for The Simpsons Movie, I felt a bit bad for\nAlf Clausen and yet understood why the decision was made.\nOne could argue that Clausen&amp;#039;s music for The Simpsons\ntelevision series, even in its briefest statements, is\nperhaps more the soul of the series than even Danny\nElfman&amp;#039;s famous title tune. Over the years, Clausen has\nhad to accentuate, augment and play against so many\nthousands of absurd and sincere scenarios, punctuate so\nmany visual gags, that I thought it&amp;#039;d be wonderful to hear\nhis contribution stretch out on the big screen. But since\nClausen still has the series itself to score, producer\nJames Brooks often goes to Zimmer for his films and after\nlistening to the The Simpsons Movie album, I feel that\nZimmer did a pretty good job in his own right.\n\nIt opens appropriately with Elfman&amp;#039;s series main title,\nperformed by a very large orchestra in suitable\ncelebration of the grand theatrical upgrade. Following\nthis is &quot;Trapped Like Carrots&quot;, a bustling cue featuring\nZimmer&amp;#039;s sprightly new main theme for the film, which\nseems loosely based on Elfman&amp;#039;s, a few notes here and\nthere and similar phrasing, working well in this context.\nFunny enough, it emerges as a tune Bart might whistle\nabsent-mindedly as he slides down the stair banister.\n&quot;Doomsday is Family Time&quot; opens with a more sweetly\ncharming statement of the theme, essayed on piano and\nflute with strings swaying, a nice respite before the\nunexpectedly raucous, grungy, surf-rock tone of &quot;Release\nThe Hounds&quot;, a great track. &quot;Clap For Alaska&quot; begins with\na grand, mock-serious inspirational cue for orchestra and\nchoir before scaling down to woodwinds and strings, while\nin &quot;What&amp;#039;s An Epiphany&quot;, Elfman&amp;#039;s theme is led through\nseveral variations and the track itself carries an overall\nElfman vibe, due to instrumentation, some of the harmonic\nlanguage and mischievous nature.\n\nElfman&amp;#039;s theme is granted an even broader canvas in &quot;Thank\nYou Boob Lady&quot;, heard first in an exciting mold, and then\nlater moving into more sweeping statements and variations.\nThe lengthiest track, &quot;You Doomed Us All? Again&quot;,\nsurprisingly contains some of the most sensitive writing\nof the album, with a lovely, delicate, slightly melancholy\nnew secondary theme featured in a flute and piano duo, but\nsoon the tone shifts to menacing, martial brass and\npercussion, a steady ostinato and some rapid action, based\nback on Zimmer&amp;#039;s main theme. &quot;?Lead, Not To Read&quot; returns\nto shades of energetic Elfman in its bongos, upper\nregister strings and female choir and bright brass, plus a\nbold statement of his Simpsons theme, capped off by a\npropulsive finish and dovetailing directly into Zimmer&amp;#039;s\nhomage to Copland, &quot;Why Does Everything I Whip Leave Me?&quot;\n(the homage being musical, not the question asked in the\ntrack title). It&amp;#039;s a great, rousing track, still referring\nback to Zimmer&amp;#039;s theme in big brass exclamations.\n\n&quot;Bart&amp;#039;s Doodle&quot; probably could have been scored in any\nnumber of ways, but Zimmer chose hilariously chirpy, 40&amp;#039;s\nstyle female vocalists, &quot;La-De-Da&quot;ing along in a\nblissfully ignorant fashion, not unlike how Elfman scored\nNicole Kidman&amp;#039;s character in To Die For (&quot;Suzie&amp;#039;s Theme&quot;).\nThe most extensive and expansive treatment of Zimmer&amp;#039;s\ntheme occurs in &quot;World&amp;#039;s Fattest Fertilizer Salesman&quot;, as\npizzicato strings percolate and the theme moves from low\nwoodwinds, mid-range piano and onto larger orchestral\nvariations, broken up by a lumbering, waltzing section in\nthe center. It&amp;#039;s even got the signature &quot;descending\nswirling strings&quot; that Elfman has been known to employ.\n&quot;His Big Fat Butt Could Shield Us All&quot; moves back to\ngentle scoring for harp, acoustic guitar, winds and\nstrings (sort of the Good Will Hunting instrumentation) in\nits first half while the second half features sweeping\norchestral gestures, shifting between Elfman&amp;#039;s and\nZimmer&amp;#039;s thematic material. &quot;Spider Pig&quot; is an amusingly\nlarge-scale choral rendition of a tune written for the\nfilm, based on the old TV series Spiderman theme everyone\nknows. Finally, &quot;Recklessly Impulsive&quot; is a techno remix\nof Zimmer&amp;#039;s material ? fun for a bit, probably could have\nbeen half the length.\n\nI do not think it is a slight against Zimmer to note the\nElfman-esque qualities in this score, as they are\nappropriate and do not specifically borrowing anything\nfrom him except harmonic and instrumental qualities. Plus,\nZimmer has created a very enjoyable album which covers not\nonly the devilish and manic nature of the series, but also\nthat more difficult quality to highlight, that of the bond\nbetween the Simpson family members. It has always been\nscored by Clausen from a sweet and genuine approach, but\nnever saccharine or overwrought and here Zimmer rides that\nfine line perfectly in such tracks as &quot;Doomsday is Family\nTime&quot; and &quot;You Doomed Us All? Again&quot;. And yet, the Zimmer\nflair is still present at times, never overshadowing what\nthe film required, making for a colorful amalgamation of\nthe differing styles. When 2007 began, I never thought\nthat the two scores I would most greatly enjoy thus far\nwould be Zimmer&amp;#039;s Pirates of the Caribbean: At World&amp;#039;s End\nand his accomplishment with The Simpsons. D&amp;#039;oh, indeed!","torrent":{"xt":"urn:btih:efea773db1ea56b9c08c76169731290d8a039f30","amp;dn":"Hans_Zimmer-The_Simpsons_Movie-OST-2007-SAW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efea773db1ea56b9c08c76169731290d8a039f30","infoHashBuffer":{"type":"Buffer","data":[239,234,119,61,177,234,86,185,192,140,118,22,151,49,41,13,138,3,159,48]},"announce":[],"urlList":[]}}