{"title":"Ohio Express - Ohio Express","uid":4821571,"size":46825637,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f01edb93cdaf4e656a89accdd9e2e6c9b2505744&amp;dn=Ohio+Express+-+Ohio+Express&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Iron_Horse","files":13,"time":1238782909,"description":"Ohio Express - Ohio Express (1968 bubblegum pop/garage)\nCD To Mp3 192 mbit/s\nIncluded: Front Cover and this Info\n\nThe Ohio Express was a bubblegum pop/garage band, active as a recording unit from 1967 through 1970.\n\nThough marketed as a band, it would be more accurate to say that the name &quot;The Ohio Express&quot; served as a brand name used by Jerry Kasenetz and Jeffrey Katz's Super K Productions to release the music of a number of different musicians and acts. The best known hits of The Ohio Express (including their highest charting single, &quot;Yummy Yummy Yummy&quot;) were actually the work of an assemblage of studio musicians working out of New York, including singer/songwriter Joey Levine.\n\nSeveral other &quot;Ohio Express&quot; hits were the work of other, unrelated musical groups, including The Rare Breed, and an early incarnation of 10cc. In addition, a completely separate touring version of The Ohio Express appeared at all live dates, and recorded some of the band's \n\nCareer\nBeginnings: The Rare Breed (1966-67)\n\nThe question of who is the 'real' Ohio Express is a thorny one. The first record credited to The Ohio Express was &quot;Beg, Borrow And Steal&quot;, a top 40 hit in the US and Canada in late 1967. However, the exact same record had initially been issued as by The Rare Breed in early 1966 on Attack Records. This issue was a complete flop, failing to chart.\n\nThe Rare Breed issued one more single in 1966 on Attack, &quot;Come And Take A Ride In My Boat&quot;, which was a minor chart hit in the US southwest [1] though it failed to chart nationally. The Rare Breed then apparently had some sort of dispute with Super K Productions and left the company, never to record again.\n\nThe band's original recording of &quot;Beg, Borrow &amp; Steal&quot; was then re-mixed and re-issued in August 1967 on Cameo Parkway Records, now credited to The Ohio Express (a name to which Super K Productions controlled all rights). The record was a number 1 single in Columbus, Ohio by early September [2], and gradually became a hit across Canada and the US through the following months.\n\nInformation about The Rare Breed is extremely difficult to come by. The otherwise exhaustively-annotated Nuggets box set (which includes &quot;Beg, Borrow and Steal&quot;) suggests they were from New York or New Jersey, but offers no other data. However, a 2003 interview [3] and a 2009 YouTube post of a performance of &quot;Beg Borrow and Steal&quot; [4] identifies the members of the Rare Breed as John Freno (vocals, guitar) Barry Stolnick (keyboards), Joel Feigenbaum (rhythm guitar), Alexander &quot;Botts&quot; Norbit (bass) and Tony Cambria (drums), all of Brooklyn and The Bronx, New York.\n\nSir Timothy &amp; The Royals take over (1967)\n\nWith no group available to promote the single by playing live dates, Super K Productions drafted a Mansfield, Ohio band known as Sir Timothy &amp; The Royals and re-named them The Ohio Express. The lineup consisted of Doug Grassel (rhythm guitar), Dale Powers (lead guitar), Dean Kastran (bass), Jim Pfahler (keyboards), and Tim Corwin (drums). This group toured as The Ohio Express, and their touring commitments (and Ohio home base) made it difficult for them to head in to the New York-based Super K offices to record a follow-up single to &quot;Beg Borrow and Steal&quot;. Of the &quot;official&quot; group members, only Dale Powers (lead vocals) appeared on the second single credited to The Ohio Express, a cover of The Standells' &quot;Try It&quot;. The single stalled well outside the US top 40, peaking at #83.\n\nThe group soon after recorded an album called &quot;Beg Borrow and Steal&quot;. It mixed the original Rare Breed title track with tracks recorded by the Ohio Express touring group, as well as tracks recorded by the Super K staff musicians with vocals by Powers. The LP came out on Cameo-Parkway Records of Philadelphia in the autumn of 1967. Unfortunately, the record label went into bankruptcy shortly after that and was purchased by music business mogul Allen Klein, who still owns the masters to this day.\n\n(It has been rumored that a young Joe Walsh, later of the James Gang &amp; The Eagles, was part of this band but left after the &quot;Beg Borrow &amp; Steal&quot; LP was recorded. A photograph on the cover of the sole Cameo-Parkway album shows a photo that bears a striking resemblance to Walsh.)\n\nThe Joey Levine years (1968-69)\nJoey Levine in concert. Taken on May 17th, 2008.\n\nThe Ohio Express then moved to the home label of bubblegum pop, Buddah Records (purposely misspelled so as not to be sacrilegious). At the same time, Joey Levine (who had co-written &quot;Try It&quot;) was coming up with new material for The Ohio Express at the behest of Super K Productions. He recorded a demo version of the track &quot;Yummy Yummy Yummy&quot; with Super K staff musicians and his own guide vocal for the Ohio Express to record over. However, Buddha head Neil Bogart liked the demo enough that he released the record &quot;as is&quot;, with Levine's vocals intact and no input at all from the touring version of The Ohio Express. The song became an international smash hit, peaking at #4 US, #5 UK, #7 Australia, and #1 Canada.\n\nThe success of the Levine-led &quot;Yummy Yummy Yummy&quot; set a pattern for the Ohio Express: they released four LPs and a multitude of singles for Buddha between 1968 and 1970, but the &quot;official&quot; group that appeared on album sleeves and at live shows contributed not a single note to their hit singles. For the year following the release of &quot;Yummy Yummy Yummy&quot;, all Ohio Express singles were co-written and sung by Levine, with musical accompaniment by anonymous New York session musicians. Under this arrangement, in 1968 and 1969 the group scored three further top 40 hits in the US, Canada and Australia with &quot;Down at Lulu's&quot;, &quot;Chewy Chewy&quot; and &quot;Mercy&quot;.\n\nThere are no known occasions of Levine ever performing with the actual Ohio quintet, either live or in the studio. The five lads from Ohio, meanwhile, could only be heard on a few of the album tracks. Allegedly, the touring group was not even informed of the existence of &quot;Chewy Chewy&quot;, the new single that had come out under their name -- and when fans requested it at a live show, they were consequently unable to play it.\n\nThe Post-Levine era (1969-70)\nAfter five straight singles co-written and sung by Joey Levine (four of which made the US and Canadian Top 40), Levine grew dissatisfied with the amount of money he was receiving from his production deal, and left Super K Productions in early 1969. The company then turned to other hands to write, produce and perform Ohio Express singles. The Ohio touring quintet was not among them.\n\nPost-Levine, the Ohio Express never again made the top 40 in North America, although three 1969 singles made the lower reaches of the US and Canadian singles charts. One later minor hit single, &quot;Sausalito {Is The Place To Go}&quot; was co-written and sung by Graham Gouldman, and performed by the four musicians who would later make up 10cc. Another late single, &quot;Cowboy Convention&quot;, sneaked into the Australian top 40, peaking at #38.\n\nBy 1970, with the hits having stopped, the group name The Ohio Express was quietly retired. (There was a one-shot 1973 Buddha release credited to Ohio Ltd.)\n\nThe Ohio Express today\nA new touring version of The Ohio Express was convened sometime in the 1980s, and today, a lineup led by original drummer Tim Corwin (and featuring occasional appearances by original guitarist Doug Grassel) tours the oldies circuit with their bubblegum classics. Original keyboardist/vocalist/songwriter Jim Pfahler died in March 2003. Bassist Dean Kastran now plays bass for Ashland, Ohio based bluegrass band Faces Made for Radio.\n\nTracklisting:\n01. Yummy, Yummy, Yummy (2:18)\n02. Winter Skies (2:58)\n03. Into This Time (2:45)\n04. First Grade Reader (3:03)\n05. Mary-Ann (2:29)\n06. Down At Lu Lu's (1:55)\n07. Turn To Straw (4:05)\n08. Vacation (1:45)\n09. She's Not Comin' Home (2:52)\n10. It's A Sad Day (2:46)\n11. The Time You Spent With Me (5:05)","torrent":{"xt":"urn:btih:f01edb93cdaf4e656a89accdd9e2e6c9b2505744","amp;dn":"Ohio+Express+-+Ohio+Express","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f01edb93cdaf4e656a89accdd9e2e6c9b2505744","infoHashBuffer":{"type":"Buffer","data":[240,30,219,147,205,175,78,101,106,137,172,205,217,226,230,201,178,80,87,68]},"announce":[],"urlList":[]}}