{"title":"Tracey Thorn - Love &amp; Its Opposite 2010 (flac)","uid":6431805,"size":225889435,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f0c21cd7a2105a14b494093bc692f3853eda15ae&amp;dn=Tracey+Thorn+-+Love+%26+Its+Opposite+2010+%28flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"barber9","files":-1,"time":1306680273,"description":"Tracey Anne Thorn (born 26 September 1962) is an English pop singer and songwriter. She is best known as being one half of the duo Everything but the Girl, which is currently on extended hiatus. Thorn was born in Brookmans Park, Hatfield, Hertfordshire. She grew up in Hatfield and studied English at the University of Hull, where she graduated in 1984 with First Class Honours. After 28 years as a couple, Thorn married her partner Ben Watt in 2009 at Chelsea Registry Office. They live in Hampstead, North London. The couple have twin daughters born in 1998 and a son born in 2001.\n\n1979 Thorn began her musical career in the punk-pop hybrid group Stern Bops playing guitar and providing some vocal backing. Thorn then joined Marine Girls playing guitar and sharing vocals. The band released two albums (Beach Party in 1981 and Lazy Ways in 1982) and several singles. The group disbanded when Thorn decided to concentrate on her studies at Hull. Thorn met Ben Watt at the University of Hull where they were both students, and both signed as solo artists to Cherry Red Records. Their first album together was Eden, released in 1984. Everything But The Girl released a body of work that spanned two decades. Their biggest chart success came in 1995, when DJ Todd Terry remixed a song from their Amplified Heart album. Missing became a huge hit all over the world, especially in the U.S., where it reached number two in the Billboard Hot 100. Everything But The Girl has been on extended hiatus since 2000, although they released compilation albums in 2002 and 2005. Ben Watt has concentrated on his DJ work, and Thorn has been a full-time parent and, most recently, writing and recording her solo material. \n\nThorn's first solo work was a mini-album entitled A Distant Shore (1982). A re-recorded version of the track Plain Sailing was released as a single, and was included on the Pillows &amp; Prayers Cherry Red records compilation album. In the 1980s, Thorn contributed guest vocals and backing vocals for The Style Council on the track Paris Match (from the album CafÃƒÂ© Bleu), The Go-Betweens on their track Head Full of Steam, Working Week on the single Venceremos (We Will Win), Lloyd Cole and the Commotions on the track Big Snake, and Adam F on The Tree Knows Everything, from Colours. In the 1990s, she collaborated with Massive Attack on several projects, including the soundtrack for the motion picture Batman Forever where she contributed with The Hunter Gets Captured by the Game. Their first project together was the song Protection from the album by Massive Attack of the same name. She also sings on the track Better Things.  Just prior to her return to recording in 2007, Thorn contributed vocals to the song Damage by the band Tiefschwarz on the album Eat Books.In March 2007, Tracey Thorn released her second solo album Out of the Woods on Virgin Records (Worldwide) and on Astralwerks (USA). Thorn cited her peers Terry Hall and Siouxsie Sioux in the song Hands Up To The Ceiling. The record includes contributions from Cagedbaby, Ewan Pearson, Charles Webster, Sasse, Darshan Jesrani, Martin Wheeler and Alex Santos. Thorn's MySpace page includes several mixes of the single and the music video.\nThe first single from the album, It's All True, accompanied by remixes from the likes of Kris Menace &amp; Martin Buttrich, was released on 7 February and the second single, Raise the Roof was released on 18 June. The third single, Grand Canyon was released on 30 October. A fourth single, King's Cross (which is a cover version of a Pet Shop Boys song) was released on 12 December. In 2008, Thorn collaborated with the Hungarian acoustic downtempo group The Unbending Trees on their single Overture, which also featured on their album Chemically Happy (Is The New Sad), published by her partner and husband Ben Watt. In 2009, Thorn collaborated with the Swedish singer-songwriter Jens Lekman for a cover of The Magnetic Fields' Yeah! Oh Yeah! for a compilation album commemorating twenty years of Merge Records. \nThorn's third solo album Love And Its Opposite was released in May 2010 on her husband Ben Watt's Strange Feeling Records in the UK, and on Merge Records in the US. Recorded in London and Berlin and produced by Ewan Pearson, it contains eight new songs and two cover versions, Come On Home To Me by Lee Hazlewood, and You Are A Lover by The Unbending Trees. (wikipedia)\n\nThe quote accompanying Love and Its Opposite is mildly terrifying. When I was young, I imagined middle age to be a kind of comfort zone, says Thorn, but in fact, having got here, I feel it's more of a war zone. The songs are where I dump all that shit so that I can get on with my life without jumping off a bridge. And though this hardly qualifies as an inducement to listen, there's something delightfully honest about it. It's almost anti-press.\nSuch painfully spare sentiment is echoed in both the lyrics and the pared-down arrangements on Thorn's latest, on which she's worked with musicians as disparate as Hot Chip's Al Doyle, Swedish alt-pop's Jens Lekman and Nashville singer-songwriter Cortney Tidwell. But the Ewan Pearson-produced, back-to-basics approach does mean those honest lyrics stand out more, and seem even starker. On Singles Bar she asks, Can you guess my age in this light over a simple, swaying twang, before revealing how she laid on her back for a Hollywood wax. It might be that it's simply too honest for some.\nBut that's not to say Love and Its Opposite is all over-share. Lee Hazelwood cover Come on Home to Me has swirling atmospherics; there's a sort of triumphant sweetness to Long White Dress's acoustic melancholy. 60s handclaps inform the giddier Hormones and there's even some bare electro-pop in the pulsing Why Does the Wind. Swimming proves to be the highlight, though, with its provocation to go on over a building accompaniment that swirls like the water Thorn's determined to wade through.\nAnd through it all, there's That Voice, nobody else sounds like Thorn. When you're blessed with an instrument this pure, and this suited to melancholy, it's easy to see how the ex-Marine Girl might be headed for Pop Treasure status. Her enviable clarity of tone and the disarming beauty of her vocals lend Love and Its Opposite a dreamy, if uncomfortable, sort of truth. But blithe, sunny romantics are advised to keep a stiff drink (and a hanky) within very easy reach. (Wendy Roby)\n\n 1. Oh the divorces\n 2. Long white dress\n 3. Hormones\n 4. Kentish town\n 5. Why does the wind\n 6. You are a lover\n 7. Singles bar\n 8. Come on home to me\n 9. Late in the afternoon\n10. Swimming\n","torrent":{"xt":"urn:btih:f0c21cd7a2105a14b494093bc692f3853eda15ae","amp;dn":"Tracey+Thorn+-+Love+%26+Its+Opposite+2010+%28flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0c21cd7a2105a14b494093bc692f3853eda15ae","infoHashBuffer":{"type":"Buffer","data":[240,194,28,215,162,16,90,20,180,148,9,59,198,146,243,133,62,218,21,174]},"announce":[],"urlList":[]}}