{"title":"North And South (Part 1 of 15)","uid":3699780,"size":936401157,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f20ee752371567fa0e82b816c4064673bd3f515a&amp;dn=North+And+South+%28Part+1+of+15%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Baba2u","files":2,"time":1180394454,"description":"Not quit war or western. But a little of each. \n\nFormat= DivX \nLanguage= English Only \nRuntime= 1:33  &lt;a href=&quot;\nhttp://www.amazon.com/North-South-Collection-Patrick-Swayze/dp/B0002MFGDC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/North-South-Collection-Patrick-Swayze/dp/B0002MFGDC&lt;/a&gt; \n\nStars---Patrick Swayze, James Read, Lesley-Anne Down, Wendy Kilbourne, Kirstie Alley \n\nHBO Mini-series \n\n1842, a special summer day at the huge plantation of Mont Royal. A South Carolinian young man, Orry Maine, leaves his rich home for West Point Academy. On his way northwards, in very strange circumstances, he meets two people who will play a decisive role in his life: beautiful lady Madeleine Fabray whom Orry helps and with whom he falls in love and a \\&quot;Yankee\\&quot; George Hazard by whom Orry is helped and who is also on his way to West Point Academy. From that time, Orry and George are best friends and help each other at every moment, they fight for the USA in the Mexican War at Churubusco where George saves Orry\\&amp;#039;s life. A few years later, the friendship of Orry and George spread to the friendship of their families, the Maines from South Carolina and the Hazards from Pennsylvania. Yet, the love of Orry\\&amp;#039;s life, Madeleine gets married to Justin LaMotte, a rich cruel owner of nearby plantation in South Carolina. Their love cannot be fulfilled and they only meet in secret. Years pass by and the relations between north and south are not that calm as in the past. Northern abolitionists demand the end of slavery while the south demands secession and separation from the \\&quot;damn Yankees.\\&quot; Although George and Orry badly want peace between north and south, there is no escape from the inescapable fate. April, the 12th, 1861 and the attack on the northern fortress Fort Sumter done by the southerners means the beginning of war. These who fought together at Churubusco will have to fight against each other. Friends will have to become enemies. Will war be stronger than peace of mind? May the storm and noise of canons, rifles and bullets destroy honor, respect and true friendship? \n\nPlease seed this, there are 15 parts so I can&amp;#039;t seed it forever. \nAlso let me know how the quality is. If it isn&amp;#039;t very good I could upload it unconverted but the files would be rather large.","torrent":{"xt":"urn:btih:f20ee752371567fa0e82b816c4064673bd3f515a","amp;dn":"North+And+South+%28Part+1+of+15%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f20ee752371567fa0e82b816c4064673bd3f515a","infoHashBuffer":{"type":"Buffer","data":[242,14,231,82,55,21,103,250,14,130,184,22,196,6,70,115,189,63,81,90]},"announce":[],"urlList":[]}}