{"title":"Breaking Bad - David Pierson","uid":11151938,"size":865324,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f270893e41f7d7bb82bc6fa0fa48d272ffceaf70&amp;dn=Breaking+Bad+-+David+Pierson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1412354424,"description":"Breaking Bad: Critical Essays on the Contexts, Politics, Style, and Reception of the Television Series, edited by David P. Pierson, explores the contexts, politics, and style of AMC's original series Breaking Bad. The book's first section locates and addresses the series from several contemporary social contexts, including neo-liberalism, its discourses and policies, the cultural obsession with the economy of time and its manipulation, and the epistemological principles and assumptions of Walter White's criminal alias Heisenberg. Section two investigates how the series characterizes and intersects with current cultural politics, such as male angst and the re-emergence of hegemonic masculinity, the complex portrayal of Latinos, and the depiction of physical and mental impairment and disability. The final section takes a close look at the series' distinctive visual, aural, and narrative stylistics. Under examination are Breaking Bad's unique visual style whereby image dominates sound, the distinct role and use of beginning teaser segments to disorient and enlighten audiences, the representation of geographic space and place, the position of narrative songs to complicate viewer identification, and the integral part that emotions play as a form of dramatic action in the series.","torrent":{"xt":"urn:btih:f270893e41f7d7bb82bc6fa0fa48d272ffceaf70","amp;dn":"Breaking+Bad+-+David+Pierson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f270893e41f7d7bb82bc6fa0fa48d272ffceaf70","infoHashBuffer":{"type":"Buffer","data":[242,112,137,62,65,247,215,187,130,188,111,160,250,72,210,114,255,206,175,112]},"announce":[],"urlList":[]}}