{"title":"Din's Curse","uid":5634115,"size":105196781,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f293bed3aeaf4f8bb9f99a20a652dd784196bf1f&amp;dn=Din%5C%27s+Curse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"esharoth","files":2,"time":1276811273,"description":"Title: Din's Curse\nDeveloper: Soldak Entertainment\nPublisher: Soldak Entertainment\nGenre: Action RPG\nReleased: 2010\nDescription:\nDin, champion of the gods, has cursed you into a second life of service because you selfishly squandered your first one while causing misfortune to those around you. To redeem yourself, you must impress Din by building a reputation for helping others. Travel the spacious western plains of Aleria and save desperate towns from the brink of annihilation. Until you're redeemed, you're doomed to wander the earth alone for all eternity.\n\nIn Din's Curse, you will explore an extensive underground, slaying dangerous monsters, solving dynamic quests, dodging deadly traps, and in your spare time, plundering loot. Quell uprisings, flush out traitors, kill assassins, cure plagues, purge curses, end wars, and complete other dangerous quests or the danger WILL escalate. Not all is as it seems though, traitors will gladly stab you in the back, renegades can revolt against the town, spies can set up ambushes, and items might even curse or possess your friends.\n\nChoose one of 141 class combinations and journey to an infinite number of dynamically generated towns with vastly different problems. Every game is a surprise! Your actions have real consequences in this dynamic, evolving world. Your choices actually matter!\n\nOpen the door to Din's Curse. Surprising adventures await!\n\nWebsite: http://www.soldak.com/Dins-Curse/Overview.html\n\nInstallation:\nInstall the game by running 'setup.exe'. After the installation has finished, run the game by using its executable.\n\nIf you like the game, BUY the original.","torrent":{"xt":"urn:btih:f293bed3aeaf4f8bb9f99a20a652dd784196bf1f","amp;dn":"Din%5C%27s+Curse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f293bed3aeaf4f8bb9f99a20a652dd784196bf1f","infoHashBuffer":{"type":"Buffer","data":[242,147,190,211,174,175,79,139,185,249,154,32,166,82,221,120,65,150,191,31]},"announce":[],"urlList":[]}}