{"title":"Allo Allo AVI Season9","uid":4266557,"size":1460502154,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f2c80991945968c25b4f04dd8daa423997229697&amp;dn=Allo+Allo+AVI+Season9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":12,"time":1214717066,"description":"Once again, I take the trouble to write an intro for this series, knowing full well almost nobody will bother to read it. Some months ago, an uploader released all of Allo Allo in one massive torrent that nobody would seed because it took up about 22 gig. The OP gave up in disgust because he had no seeds and no thanks. I thought it would be nice if someone who waited a month to download it would chop it up into seasons and re-release it, hoping people would seed the smaller chunks. This was when I was new to torrenting and thought human decency still existed. Decent seeding has not happened, nor do many people bother to leave a comment except to bitch and whine about the quality of the original recordings.\n\nSo?\n\nI am going to get out the last two seasons over this weekend. I will seed each until it?s at about 2.50 on ratio, and then just walk away. If series 8 and 9 are anything like 1 thru 7, there will be about 5 seeds and maybe 80 leechers. Best of luck to all of you. There will be few to no comments except bitching from whiney little ungrateful bastards. I?m cool, it isn?t my original torrent, and I have gotten nice comments on stuff that WAS my original torrent, so my poor ?lil ego will live. HOWEVER, I don?t want to hear a damned word about the quality. First of all, it?s pretty good. Secondly, *I* didn?t burn these. Thirdly, all gripers should consider how much they paid for this ?product? and then go slash their wrists. Lastly, If you don?t like it, then rent all the DVDs and burn your own superior torrent. Not that I?m bitter or anything.\n\nJewish mother guilt trip rant now ends. Many thanks to the original uploader. Also, would the moron who keeps posting links to some new age eastern medicine Tibetan nonsense in my torrents kindly knock it off and go play in traffic? I don?t like you and neither does Buddha. At least, that?s what Buddha said when he was over here with Jesus and Moses playing poker last night. We all agree you suck.","torrent":{"xt":"urn:btih:f2c80991945968c25b4f04dd8daa423997229697","amp;dn":"Allo+Allo+AVI+Season9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2c80991945968c25b4f04dd8daa423997229697","infoHashBuffer":{"type":"Buffer","data":[242,200,9,145,148,89,104,194,91,79,4,221,141,170,66,57,151,34,150,151]},"announce":[],"urlList":[]}}