{"title":"Massive Attack - Heligoland -2010(split tracks+cover)barney's","uid":5297724,"size":99390840,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f2ce46c77b89cf8478be20634e2ce8c9ae779a8d&amp;dn=Massive+Attack+-+Heligoland+-2010%28split+tracks%2Bcover%29barney%5C%27s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"michelinman","files":12,"time":1264113800,"description":"[img]http://images.play.com/covers/10108960x.jpg[/img]\n\n    * Massive Attack are a seminal group of musical innovators whose early work detonated the Bristol music scene of the early 90's and unwittingly gave birth to 'trip-hop'. The group formed in 1987 around their influential and legendary Dug Out club and Jamaican-style soundsystem, playing a groundbreaking blend of hip hop, new wave reggae, early house and techno which shaped their hugely acclaimed 1991 debut, Blue Lines. Mezzanine, their third album released in 1998 proved to be a creative and commercial peak selling in excess of 3 million albums.\n\n      8th February 2010 sees the release of the fifth Massive Attack studio album. It will be four years since the release of their best of album 'Collected' and seven years since their last studio album '100th Window'. The new studio album 'Heligoland', features original band members Daddy G and 3D, long time cohort Horace Andy and guest vocals from Damon Albarn, Hope Sandoval, Martina Topley-Bird, Guy Garvey and Tunde Adebimpe.\n\n      Play.com Review\n\n      19 years after their remarkable debut, 'Blue Lines', hit the charts - an album which is largely considered to be the first ever 'trip hop' album - genre-crossing production geniuses Massive Attack return with their hugely anticipated fifth long-player, Heligoland.\n\n    * With their first new material in 7 years, the pioneering Bristol duo pull out all the stops with 10 innovative new recordings, surrounded by a plethora of top-quality guests. Elbow frontman Guy Garvey adds his highly recognisable vocals to 'Flat Of The Blade', whilst Martina Topley-Bird, famed for her outstanding collaborations with Tricky, features on two tracks. With the sad news of original programmer/producer Jonny Dollar's death in 2009, there is an element of understandable poignancy to the album, but there is also a renewed sense of optimism throughout the recordings.\n\n      Continually pushing the boundaries, and littered with both thought provoking and thrilling moments, Heligoland is another inspiring release from one of the most challenging bands in chart history.\n\n   1. Pray For Rain\n   2. Babel\n   3. Splitting The Atom\n   4. Girl I Love You\n   5. Psyche\n   6. Flat Of The Blade\n   7. Paradise Circus\n   8. Rush Minute\n   9. Saturday Come Slow\n  10. Atlas Air\n[IMG]http://i78.photobucket.com/albums/j81/wrcfoucs/watching3vemq8.gif[/IMG]\n\n[img]http://i121.photobucket.com/albums/o219/uuffoo/vghlr7.png[/img]\n\n","torrent":{"xt":"urn:btih:f2ce46c77b89cf8478be20634e2ce8c9ae779a8d","amp;dn":"Massive+Attack+-+Heligoland+-2010%28split+tracks%2Bcover%29barney%5C%27s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2ce46c77b89cf8478be20634e2ce8c9ae779a8d","infoHashBuffer":{"type":"Buffer","data":[242,206,70,199,123,137,207,132,120,190,32,99,78,44,232,201,174,119,154,141]},"announce":[],"urlList":[]}}