{"title":"Wars Against Napoleon - General Michael Franceschi &amp; Ben Wei","uid":9235259,"size":6056844,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f4460f112b08a6f685e0dbe59e2350d6143ee0bd&amp;dn=Wars+Against+Napoleon+-+General+Michael+Franceschi+%26amp%3B+Ben+Wei&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":4,"time":1385159640,"description":"Popular and scholarly history presents a one-dimensional image of Napoleon as an inveterate instigator of war who repeatedly sought large-scale military conquests. General Franceschi and Ben Weider dismantle this false conclusion in The Wars Against Napoleon, a brilliantly written and researched study that turns our understanding of the French emperor on its head. Avoiding the simplistic cliche's and rudimentary caricatures many historians use when discussing Napoleon, Franceschi and Weider argue persuasively that the caricature of the megalomaniac conqueror who bled Europe white to satisfy his delirious ambitions and insatiable love for war is groundless. By carefully scrutinizing the facts of the period and scrupulously avoiding the sometimes confusing cause and effect of major historical events, they paint a compelling portrait of a fundamentally pacifist Napoleon, one completely at odds with modern scholarly thought. This rigorous intellectual presentation is based upon three principal themes. The first explains how an unavoidable belligerent situation existed after the French Revolution of 1789. The new France inherited by Napoleon was faced with the implacable hatred of reactionary European monarchies determined to restore the ancient regime. All-out war was therefore inevitable unless France renounced the modern world to which it had just painfully given birth. The second theme emphasizes Napoleon's determined efforts (&quot;bordering on an obsession,&quot; argue the authors) to avoid this inevitable conflict. The political strategy of the Consulate and the Empire was based on the intangible principle of preventing or avoiding these wars, not on conquering territory. Finally, the authors examine, conflict by conflict, the evidence that Napoleon never declared war. As he later explained at Saint Helena, it was he who was always attacked-not the other way around. His adversaries pressured and even forced the Emperor to employ his unequalled military genius. After each of his memorable victories Napoleon offered concessions, often extravagant ones, to the defeated enemy for the sole purpose of avoiding another war. Lavishly illustrated, persuasively argued, and carefully illustrated with original maps and battle diagrams, The Wars Against Napoleon presents a courageous and uniquely accurate historical idea that will surely arouse vigorous debate within the international historical community.\n","torrent":{"xt":"urn:btih:f4460f112b08a6f685e0dbe59e2350d6143ee0bd","amp;dn":"Wars+Against+Napoleon+-+General+Michael+Franceschi+%26amp%3B+Ben+Wei","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4460f112b08a6f685e0dbe59e2350d6143ee0bd","infoHashBuffer":{"type":"Buffer","data":[244,70,15,17,43,8,166,246,133,224,219,229,158,35,80,214,20,62,224,189]},"announce":[],"urlList":[]}}