{"title":"Amber Rayne - Slave 2.avi","uid":4977981,"size":728633344,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f70d96353fdbbfe9d500e0b703108984e48ab229&amp;dn=Amber+Rayne+-+Slave+2.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":1,"time":1246108246,"description":"Amber Rayne stars in this super nasty bit of video debauchery that would humble Max Hardcore in the realm of verbal abuse, humiliation and misogyny. \n\nThis tale of woe opens with &quot;Master&quot; Otto sitting on the crapper who gets angry finding the toilet paper dispenser empty. Disgusted, he marches out of the house to a shed in the back yard where, tied up and helpless, is slave Amber, who is then reduced to licking clean Master's ass. \n\nAfter some serious ass licking and tongue fucking Master's asshole, Amber later finds herself being brutally face-fucked while her ass is being cleaned out by an enema hose. This culminates with Amber's head being placed under the toilet seat and her face and mouth receiving and load of Master's cum. \n\nBefore her day is over Amber is trussed up on some backyard fence, adorned in a pig mask and sporting a sign around her neck that says: FOR SALE, PIG FUCK. After Master thoroughly reams Amber's pussy and ass he takes her inside and continues to use and abuse Amber's ass until he drops his load in her rectum. Amber then uses her sphincter to push Master's creamy gift onto a paddle with which she's beaten, and then lovingly licks the paddle clean. \n","torrent":{"xt":"urn:btih:f70d96353fdbbfe9d500e0b703108984e48ab229","amp;dn":"Amber+Rayne+-+Slave+2.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f70d96353fdbbfe9d500e0b703108984e48ab229","infoHashBuffer":{"type":"Buffer","data":[247,13,150,53,63,219,191,233,213,0,224,183,3,16,137,132,228,138,178,41]},"announce":[],"urlList":[]}}