{"title":"Digital Wedding Photographers Planner.pdf Gooner","uid":8627265,"size":15387959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f73f91cd20472453aaf1fdd745d397414f9aea99&amp;dn=Digital+Wedding+Photographers+Planner.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1372541112,"description":"Book Description:\n\nPublication Date: April 26, 2010 | ISBN-10: 0470570938 | ISBN-13: 978-0470570937 | Edition: 1\nA full-color reference to planning for and executing a successful wedding day shoot\nWedding photography has become a major industry, and the number of photographers getting into this field is rapidly increasing?making it even more competitive. Written by top wedding photographer, Kenny Kim, this full-color reference walks you through all the major (and minor) steps involved in planning and organizing a successful wedding day shoot.\n\nYou'll get unique advice on everything from your initial meeting with the engaged couple to the final presentation of the commemorative book. Packed with checklists, schedules, etiquette tips, and much more, this book is an essential wedding photography resource for every wedding photographer.\n\nProvides detailed coverage of all the major and minor steps in preparing for a successful wedding day shoot\nExplores preparation for every detail of taking unique and memorable wedding day photos\nSpans the initial meeting with the couple all the way to presenting them with their photo album\nReassures you of your preparation, using checklists, schedules, etiquette tips, answers to questions, and more\nFrom rings and vows to dancing and &quot;wows&quot;, this resource will help you prepare to capture every moment of a couple's special day.","torrent":{"xt":"urn:btih:f73f91cd20472453aaf1fdd745d397414f9aea99","amp;dn":"Digital+Wedding+Photographers+Planner.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f73f91cd20472453aaf1fdd745d397414f9aea99","infoHashBuffer":{"type":"Buffer","data":[247,63,145,205,32,71,36,83,170,241,253,215,69,211,151,65,79,154,234,153]},"announce":[],"urlList":[]}}