{"title":"Susan James - Driving Toward The The Sun [2013][EAC,log,cue.FLAC","uid":9158974,"size":227233727,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f7f5599612fd9e64404f266273ababb47960d342&amp;dn=Susan+James+-+Driving+Toward+The+The+Sun+%5B2013%5D%5BEAC%2Clog%2Ccue.FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":14,"time":1383842086,"description":"Artist: Susan James\nRelease: Driving Toward The The Sun \nReleased: 2013\nLabel: Susan James Music\nCatalog#: \nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: Folk\n\nimage\n\n\n1. Driving Toward The Sun (3:57)\n2. Wandering (3:15)\n3. Agua Dulce Tears (4:48)\n4. U-Haul In The Driveway (4:14)\n5. Anniversary (3:16)\n6. House Of Love (4:31)\n7. Tule Fog (4:09)\n8. Mission Bells (3:48)\t\n\n\n\nThey're going to throw Susan James' Driving Toward the Sun under the Americana bus. I just know it and it upsets me. I don't know how it happened, but Americana has become this huge umbrella of a genre under which you toss any song or album which has a banjo or even just an acoustic instrument on it, a lazy man's way of categorization or maybe just a classification for people who do not understand how to listen to or hear music. \n\nIn the early seventies, I surrounded myself with people who knew not only how to listen but who appreciated what they were hearing. We called music like this Country Rock back in those days and we fed upon the likes of Cowboy and Pure Prairie League and Heartsfield and a handful of others which had little more than regional success (though PPL did break out nationally in an after-the-fact kind of way--- it's a long story). We loved the smooth harmonies and the references to love and the back-to-the-earth philosophy many of us cherished, especially in a world we saw as having run amok. Does Susan James reflect that? Enough. In fact, in a cynical world, she is a breath of fresh air--- a throwback. Because she writes and sings from the heart.\n\n&quot;House of Love&quot; puts me in mind of Devon Sproule's song &quot;Julie&quot;, a monster of a song--- fond memories of a person past. More than fond, actually, Sproule painting a variety of emotions with strokes of her lyrical pen and backing it up with music to accentuate those strokes. James does the same with &quot;House of Love&quot;, borrowing emotions and all, though not borrowing as much as creating. Play these songs back-to-back and you get the feeling of a parallel universe, bookends not identical but so similar it catches you by surprise. I wrote a semi-review on James' album and included this self-same comparison and James wrote to me later, saying that she had not heard of Sproule before but had since reading my column and was thrilled with the comparison. Funny thing. I play these songs back-to-back regularly and keep wondering if maybe the comparison was the results of the pedal steel in each instance (that of B.J. Cole in Sproule's and Chris Lawrence in James') but, no, it is way more than that. They each, it appears, occupy similar places at different times and I am grateful for that because &quot;House of Love&quot; and &quot;Julie&quot; are sisters of songs and I love them both.\n\n&quot;Agua Dulce Tears&quot; contains ghosts of The Georgian Company, a somewhat unknown band from Austin which I stumbled upon some years ago. Perhaps it is the tempo or, again, the pedal steel, but there is something there I cannot quite put a finger on and, in a way, that makes the comparison even stronger. It is something--- a sound or even just a feeling--- and I embrace &quot;Agua Dulce Tears&quot; every bit as much as I embrace The Georgian Company's &quot;Apology&quot; or &quot;Day To Day (After a Storm)&quot;, all emotional and musical triumphs I welcome with each listen.\n\nBut this is not about Sproule or The Georgians. This is about a Susan James album people should be hearing and sharing. This is about good music and James has packed Driving Toward the Sun with nothing but. Hopefully, you will make the effort to listen because you deserve to hear the best as much as James deserves to be heard. If you don't know the artists mentioned, think Linda Ronstadt or Eagles or any of the smooth country-rockin' artists of the past. No, James won't sound exactly like them, but she sure as hell gets what rockin' country is all about. This is a gem of an album. I know I say this all too often, but I'm in love.\n\nProduction? A-plus. Performance? A-plus. Songwriting? A-plus. No need to go on. This is A-plus across the boards..","torrent":{"xt":"urn:btih:f7f5599612fd9e64404f266273ababb47960d342","amp;dn":"Susan+James+-+Driving+Toward+The+The+Sun+%5B2013%5D%5BEAC%2Clog%2Ccue.FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7f5599612fd9e64404f266273ababb47960d342","infoHashBuffer":{"type":"Buffer","data":[247,245,89,150,18,253,158,100,64,79,38,98,115,171,171,180,121,96,211,66]},"announce":[],"urlList":[]}}