{"title":"Entering Space (1999) by Robert Zubrin","uid":10277436,"size":24201233,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8536aac694df9c8eaf21eb83c83212600c60b60&amp;dn=Entering+Space+%281999%29+by+Robert+Zubrin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1401662809,"description":"Entering Space - Creating a Spacefaring Civilization (1999) by Robert Zubrin.pdf\n\nAstronautical engineer Zubrin stirred up more than a few imaginations with his 1996 The Case for Mars, which explained how and why humans could visit the red planet cheaply and soon. Zubrin's confident followup divides its predictions and programs into three sections: the first covers near-term projects in Earth orbit, with a view to commercial possibilities. The second part takes on the Moon, Mars, asteroids and the outer solar system, and the third adopts an optimistic view of interstellar travel and extraterrestrial life. Zubrin's range can amaze: he begins with the Space Shuttle (misguided and inefficient, he argues) and ends with speculation about how humanity might &quot;change the laws of the universe.&quot; In between, Zubrin (privy to some of the dealings involved) shows how American politics quashed recent chances of cheap space flight; how &quot;shake-and-bake&quot; processing can profitably mine helium from the Moon; what we can do to defend life on Earth against a real-life Armageddon asteroid; and how a magnetic sail might speed up and slow down a starship. Zubrin's engineering background and his crisp prose make him a confident explainer, as technical as he needs to be but rarely more so. Regular readers of science fiction and anyone else with high school chemistry and physics will understand his arguments about the engines, ships and industries he proposes to create. His gung-ho clarity may even raise suspicions, especially when he moves from physics to metaphysics: Will the species really stagnate unless we become a &quot;Type II&quot; civilization? But anyone who cares about space travel will care about some part of this book. While some will gravitate to the near-term proposals, others will happily escape their pull and reach, with Zubrin, for the stars.\n\n305 pages\nPublisher: Tarcher; First Edition edition (August 30, 1999)\nLanguage: English\nISBN-10: 0874779758\nISBN-13: 978-0874779752\n","torrent":{"xt":"urn:btih:f8536aac694df9c8eaf21eb83c83212600c60b60","amp;dn":"Entering+Space+%281999%29+by+Robert+Zubrin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8536aac694df9c8eaf21eb83c83212600c60b60","infoHashBuffer":{"type":"Buffer","data":[248,83,106,172,105,77,249,200,234,242,30,184,60,131,33,38,0,198,11,96]},"announce":[],"urlList":[]}}