{"title":"OpenLayers 2.10 Beginner's Guide{BBS}","uid":6628164,"size":6901237,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f87dd383894f505977c6a507429bb63ecb9f6cf0&amp;dn=OpenLayers+2.10+Beginner%5C%27s+Guide%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314230022,"description":"Create, optimize, and deploy stunning cross-browser web maps with the OpenLayers JavaScript web mapping library\n\n    * Learn how to use OpenLayers through explanation and example\n    * Create dynamic web map mashups using Google Maps and other third-party APIs\n    * Customize your map's functionality and appearance\n    * Deploy your maps and improve page loading times\n    * A practical beginner's guide, which also serves as a reference with the necessary screenshots and exhaustive code explanations\n\nIn Detail\n\nWeb mapping is the process of designing, implementing, generating, and delivering maps on the World Wide Web and its products. OpenLayers is a powerful, community driven, open source, pure JavaScript web mapping library. With it, you can easily create your own web map mashup using WMS, Google Maps, and a myriad of other map backends. Interested in knowing more about OpenLayers? This book is going to help you learn OpenLayers from scratch.\n\nOpenLayers 2.10 Beginner's Guide will walk you through the OpenLayers library in the easiest and most efficient way possible. The core components of OpenLayers are covered in detail, with examples, structured so that you can easily refer back to them later.\n\nThe book starts off by introducing you to the OpenLayers library and ends with developing and deploying a full-fledged web map application, guiding you through every step of the way.\n\nThroughout the book, you'll learn about each component of the OpenLayers library. You'll work with backend services like WMS, third-party APIs like Google Maps, and even create maps from static images. You'll load data from KML and GeoJSON files, create interactive vector layers, and customize the behavior and appearance of your maps.\n\nThere is a growing trend in mixing location data with web applications. OpenLayers 2.10 Beginner's Guide will show you how to create powerful web maps using the best web mapping library around.\n\nThis book will guide you to develop powerful web maps with ease using the open source JavaScript library OpenLayers.\n\nWhat you will learn from this book\n\n    * Learn how to set up OpenLayers and use it to create your own web maps\n    * Debug your map to find out how it works and how to fix things that break\n    * Investigate the multitude of different layer types OpenLayers supports out of the box\n    * Customize your map's settings to support different projections, resolutions, controls, and more\n    * Learn about what projections are and how to work with them\n    * Use Google, Bing, Yahoo, and other third-party maps directly in your own map\n    * Understand the numerous map controls provided out of the box and learn how to develop and customize your own\n    * Add real-time, client-side interaction with the Vector layer and customize its appearance\n    * Work with external data formats like KML, GeoJSON, and many others\n    * Develop a complex web map application using external data sources from Flickr, Twitter, and more\n    * Learn how to deploy and optimize your web map\n\nApproach\n\nThis is a beginner's guide with the essential screenshots and clearly explained code, which also serves as a reference.\n\nWho this book is written for\n\nThis book is for anyone who has any interest in using maps on their website, from hobbyists to professional web developers. OpenLayers provides a powerful, but easy-to-use, pure JavaScript and HTML (no third-party plug-ins involved) toolkit to quickly make cross-browser web maps. A basic understanding of JavaScript will be helpful, but there is no prior knowledge required to use this book. If you've never worked with maps before, this book will introduce you to some common mapping topics and gently guide you through the OpenLayers library. If you're an experienced application developer, this book will also serve as a reference to the core components of OpenLayers\nAbout the Author\n\nErik Hazzard\n\nErik Hazzard is a web developer - designer, Open Source advocate, and VI user. He loves to learn, teach, and occasionally blogs on his website at vasir.net. As a professional web developer of five years, Erik specializes in Python and Javascript, using open source software whenever possible. When he's not developing web applications, he's often developing or designing video games.\n\n    * Paperback: 372 pages\n    * Publisher: Packt Publishing (March 18, 2011)\n    * Language: English\n    * ISBN-10: 1849514127\n    * ISBN-13: 978-1849514125","torrent":{"xt":"urn:btih:f87dd383894f505977c6a507429bb63ecb9f6cf0","amp;dn":"OpenLayers+2.10+Beginner%5C%27s+Guide%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f87dd383894f505977c6a507429bb63ecb9f6cf0","infoHashBuffer":{"type":"Buffer","data":[248,125,211,131,137,79,80,89,119,198,165,7,66,155,182,62,203,159,108,240]},"announce":[],"urlList":[]}}