{"title":"Captain America Comics 98% Complete by knoxbox Part 3","uid":5434946,"size":2176879852,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f8adbbcc1af95e0b519e84807d4b012b9f20e677&amp;dn=Captain+America+Comics+98%25+Complete+by+knoxbox+Part+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"knoxbox","files":-1,"time":1268562053,"description":"The Compilation was so big I had to break it down into 4 torrents.\n\n1. Movies &amp; TV\nhttp://thepiratebay.se/torrent/5434891/Captain_America_Movies__amp__TV_98__Complete_by_knoxbox\n\n2. Comics Part 1\nhttp://thepiratebay.se/torrent/5434936/Captain_America_Comics_98__Complete_by_knoxbox_Part_1\n\n3. Comics Part 2\nhttp://thepiratebay.se/torrent/5434942/Captain_America_Comics_98__Complete_by_knoxbox_Part_2\n\n4. Comics Part 3\nhttp://thepiratebay.se/torrent/5434946/Captain_America_Comics_98__Complete_by_knoxbox_Part_3\n\n-----------------------------------------------------------------------\n\nIn Honor of the 2011 Film The First Avenger: Captain America\n\nI Scoured the net, using the below sources:\nhttp://en.wikipedia.org/wiki/Captain_America\nhttp://en.wikipedia.org/wiki/Captain_America_in_other_media\n\nTo bring you the largest, collection of Captain America media all in one place.\n\nIt isn't exactly complete, but is complete to best of my abilities, following the above wiki's.\n\nI have uploaded this collection as a Directory, to make it easier if you wish to pick and choose what you want to download as it is 15 gigs of Captain America Media. \n\nThis collection will include:\nAnimated Series:\nIncluded are series about Captain America, or episodes were he was involved in other series. All credit goes to original rippers and uploaders.\n\nComics:\nincluded the essentials listed on the wiki, this is not complete as I could not find the first series or some of the comics in which he made appearances. All Credit goes to original scanners and uploaders.\n\nMovies &amp; TV:\nincluded All known movies up to 2010, including a 1985 Public Service Announcement, and 3 dev adam (a Turkish movie, with Spiderman &amp; Captain America.)\n\nQuality:\nThe quality of the files varies depending on the whether it was a dvd/vhs/rip or the quality of the scanner both of which were out of my control. On the movies 1979 1 &amp; 2 and 1990, they were vhs converted to dvd, and uploaded to save on the size, i used handbreak to convert them to mkvs and m4v. I have fully watched all 3 movies and they are watchable and for the most part the voices are in sync. I used VLC to watch all the files.\n\nEach folder, will have a seperate read me.txt containing information about the files inside. Please read them as they will give you more information than is listed in this read me.\n\nIf you enjoyed this or would like to help me complete this further please give me a shout @knoxbox on twitter.\n\nIf this goes over well, i may consider doing other super hero compilations in the future. I will seed this as long as possible, please seed for as long as you can so others can enjoy this great torrent.","torrent":{"xt":"urn:btih:f8adbbcc1af95e0b519e84807d4b012b9f20e677","amp;dn":"Captain+America+Comics+98%25+Complete+by+knoxbox+Part+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8adbbcc1af95e0b519e84807d4b012b9f20e677","infoHashBuffer":{"type":"Buffer","data":[248,173,187,204,26,249,94,11,81,158,132,128,125,75,1,43,159,32,230,119]},"announce":[],"urlList":[]}}