{"title":"Jeff Buckley - The Grace EPs - 5CD-BOX 2011","uid":7227971,"size":900967644,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f92a1dbc36c950bf71e1ceed7b1f57d80348b502&amp;dn=Jeff+Buckley+-+The+Grace+EPs+-+5CD-BOX+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1335738047,"description":"It's a shame we'll never know how good Jeff Buckley could have been, but the indications are that, up to his death in 1997, he was set to shine.\n\nHis credentials were promising, he was the son of Tim Buckley, though he had barely met him, and his mother and stepfather were musical, encouraging his interests to the point that, at 12, he had decided to become a musician. After attending a one year music course when he left school, he went on to play guitar in several bands while working in hotels.\n\nHe moved to New York in 1990 and became interested in Qawwali - music of India and Pakistan. Around this time he was offered the opportunity to record a demo, and the result was Babylon Dungeon Sessions. In the Spring after releasing the demo, he took part in a tribute concert for his father and it was this appearance which raised his profile with the record industry. After a brief stint with the band Gods and Monsters in 1991/2 he went back to performing solo, earning a reputation in the folk cafe club circuit in New York.\n\nThis growing reputation eventually landed him a record deal and an EP Live at Sin-e followed, in 1994, by Grace. Grace was a slow burner though it gained immediate critical acclaim, sales built more slowly. Soon Buckley was praised by his idols including, amongst many, Jimmy Page and Bob Dylan.\n\nAfter touring extensively with the first album he started to write for a new album in 1996, My Sweetheart the Drunk. However, it was never completed, after Buckley drowned in a tragic swimming accident. The album was renamed Sketches for My Sweetheart the Drunk and released posthumously. The gentle singer-songwriter with the fragile voice died before he could capitalize on his earlier promise, in an eerie reflection of the promise shown by his father. (amazon.com)\n\n- - -\n\nJeff Buckley - Original Album Classics- The Grace EPs 1994-1996\n(5CD Sony Music 2011)\n\nCD1  Jeff Buckley - Grace EPs (Peyote Radio Theatre) 1994\n\n 1. Mojo Pin   \n 2. Dream Brother (Nag Champa Mix)   \n 3. Kanga-Roo\n\nCD2  Jeff Buckley - The Grace EPs (So Real) 1995\n\n 1. So Real (Live)   \n 2. Grace (Live)   \n 3. Dream Brother (Live)\n\nCD3  Jeff Buckley - Live From The Bataclan 1995\n\n 1. Dream Brother (Live)   \n 2. The Way Young Lovers Do (Live)   \n 3. Medley: Je N'en Connais Pas La Fin (Live) / Hymne A L'Amour (Live)   \n 4. Hallelujah (Live)  \n\nCD4  Jeff Buckley - The Grace EPs (The Grace EP) 1996\n\n 1. Grace    \n 2. Grace (Live)    \n 3. Mojo Pin (Live)    \n 4. Hallelujah (Live)   \n 5. Tongue\n\nCD5  Jeff Buckley - The Grace EPs (Last Goodbye) 1995\n\n 1. Last Goodbye (Edit)   \n 2. Mojo Pin (Live)  \n 3. Kanga-Roo   \n 4. Lost Highway  \n","torrent":{"xt":"urn:btih:f92a1dbc36c950bf71e1ceed7b1f57d80348b502","amp;dn":"Jeff+Buckley+-+The+Grace+EPs+-+5CD-BOX+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f92a1dbc36c950bf71e1ceed7b1f57d80348b502","infoHashBuffer":{"type":"Buffer","data":[249,42,29,188,54,201,80,191,113,225,206,237,123,31,87,216,3,72,181,2]},"announce":[],"urlList":[]}}