{"title":"The Name of the Rose [128] by Umberto Eco 2013","uid":13705789,"size":1215181893,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f9723c7d10c3b38b343c74bf9cba867d2e1672c2&amp;dn=The+Name+of+the+Rose+%5B128%5D+by+Umberto+Eco+2013&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":51,"time":1456827510,"description":"The international best seller! A masterful gothic thriller set against the turbulence of medieval Italy.\r\n\r\nThe year is 1327. Franciscans in a wealthy Italian abbey are suspected of heresy, and Brother William of Baskerville arrives to investigate. But his delicate mission is suddenly overshadowed by seven bizarre deaths that take place in seven days and nights of apocalyptic terror.\r\n\r\nBrother William turns detective, and a uniquely deft one at that. His tools are the logic of Aristotle, the theology of Aquinas, the empirical insights of Roger Bacon - all sharpened to a glistening edge by his wry humor and ferocious curiosity. He collects evidence, deciphers secret symbols and coded manuscripts, and digs into the eerie labyrinth of the abbey where &quot;the most interesting things happen at night&quot;.\r\nAs Brother William goes about unraveling the mystery of what happens at the abbey by day and by night, listeners step into a brilliant re-creation of the 14th century, with its dark superstitions and wild prejudices, its hidden passions and sordid intrigues. Virtuoso storyteller Umberto Eco conjures up a gloriously rich portrait of this world with such grace, ease, wit, and love that you will become utterly intoxicated with the place and time.\r\n \nhttp://www.naxosaudiobooks.com/name-of-the-rose-the-unabridged/","torrent":{"xt":"urn:btih:f9723c7d10c3b38b343c74bf9cba867d2e1672c2","amp;dn":"The+Name+of+the+Rose+%5B128%5D+by+Umberto+Eco+2013","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9723c7d10c3b38b343c74bf9cba867d2e1672c2","infoHashBuffer":{"type":"Buffer","data":[249,114,60,125,16,195,179,139,52,60,116,191,156,186,134,125,46,22,114,194]},"announce":[],"urlList":[]}}