{"title":"learnflash.com -Integrating Flash with XML","uid":4711995,"size":294884556,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f994711bfc0ac0305ec595a59ae4092be072497e&amp;dn=learnflash.com+-Integrating+Flash+with+XML&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"coolhot","files":92,"time":1234065025,"description":"Applications : Windows : English\nLearnFlash.com\nIntegrating Flash with XML\nBy Craig Campbell\n\nRunning Time: 4 hours, 4 minutes\n\n\n\nOverview\n\nAt its core, XML is simply a way of sharing and storing data on the Internet, and it allows you to create some highly dynamic content. And when you combine XML with Flash, it becomes even more powerful. In this video series, Flash trainer Craig Campbell discusses how to import XML data into Flash, and then he walks you through several projects, demonstrating how to create a slideshow, a music player, and a video player that all pull their information from XML text files.\n\nDetailed Video Descriptions\n* Introduction (2:18)\nIn this brief video, Craig introduces himself and tells you what you can expect to learn from this video series.\n* 1 - What is XML? (5:31)\nIn this video, Craig defines XML, explains many of its uses, and lists the advantages of using XML to store dynamic data.\n* 2 - Looking at an XML Document (8:44)\nIn this video, Craig walks you through an XML document that stores a number of news stories, and he explains to you how the document is structured. Understanding this structure is crucial in order to use it properly in Actionscript.\n* 3 - Loading XML into Flash (9:43)\nNow that we understand the structure of an XML document, we can make use of it. In this video, you'll learn how to load the XML file into your Flash file using Actionscript.\n* 4 - Extracting XML Data (14:07)\nWith your XML document loaded into Flash, Craig now shows you how to extract information from the XML and display it in the output window.\n* 5 - Displaying XML Data in a Text Field (12:58)\nIn this video, you will learn how to update the text in a dynamic text field with the data you pulled in from your XML file. You'll also learn a few tricks for formatting the text that you pull in.\n* 6 - Using Loops to Display All Data (9:16)\nIn this video, Craig will show you how to make this file truly dynamic by creating a for() loop that will iterate through the news stories in your XML file and display information for every single story.\n* 7 - Finishing Touches (3:42)\nIn the current project, if we decided to add any more stories to our XML file, the text would disappear beyond the bottom of the text file, so in this video, after updating the XML file with a new news story, Craig will demonstrate how to add a quick scrollbar to your dynamic text field.\n* 8 - XML Attributes (7:39)\nIn this video, Craig will show you a different way to set up your XML file. Instead of having so many nested elements, like we had in the news example, Craig will show you how to set up attributes for your elements.\n* 9 - Setting Up the Slideshow (6:23)\nIn this video, Craig pulls out the drawing tools and sets up the Flash stage for the slideshow. Once your slideshow is set up, all that's left is to make it work with Actionscript.\n* 10 - Displaying the First Image (10:31)\nWith your slideshow elements set up visually, Craig jumps into Actionscript and shows you all the code necessary to set up your XML object, read your XML file, and display the first image listed in the XML file.\n* 11 - Creating Arrays for XML Attributes (9:49)\nWith the new attribute structure in the XML document, Craig shows you how to set up multiple arrays in Actionscript to help you keep track of the information stored in the attributes of your XML elements.\n* 12 - Cycling Through the Pictures (12:45)\nIn this video, we'll take advantage of the arrays that we created in the last lesson. Craig will show you how to add code to the 'next' and 'previous' buttons that will allow the user to cycle through the images and the corresponding captions.\n* 13 - Cycling with Arrow Keys (6:19)\nUsing the nextPicture() and prevPicture() functions that have already been created, Craig will now show you how to use these functions again in order to allow the user to cycle through the images of the slideshow using the left and right arrow keys.\n* 14 - Setting Up the Music Player (15:29)\nReady to create your own dynamic music player? In this video, Craig will introduce you to the new jukebox xml file and then walk you through creating the controls for your music player.\n* 15 - Setting Up the Jukebox XML Object (8:44)\nIn this video, we'll once again go over the familiar task of creating a new XML object for our music player and extracting information from our XML file to make sure it's working.\n* 16 - Getting the First Song to Play (5:28)\nIn this video, we'll give the music player its basic functionality by getting it to play the first song in the list.\n* 17 - Storing Song Attributes in Arrays (5:18)\nJust like we did with the slideshow, in this video, we're going to store all the values for the song titles and urls in their own respective arrays.\n* 18 - Stop, Play, Pause, and Mute (16:33)\nIn this video, we'll take a break from all the XML talk, and we'll set up the code for the basic controls on the music player.\n* 19 - Cycling Through the Songs (17:31)\nIn this video, Craig will demonstrate how to add code to the 'next' and 'previous' buttons in order to cycle through the songs in your XML playlist. He also shows you how to automatically start playing the next song when the first song is finished playing.\n* 20 - Setting Up the Video Player (14:18)\nIn this video, we'll take a quick look at the videos.xml file that we'll be using for our video player project, and then we'll jump into Flash and create all the visual assets for the player.\n* 21 - Getting a Video to Play (6:16)\nBefore setting up the XML object, Craig demonstrates how to get a video to start playing in Actionscript.\n* 22 - Setting Up the Video XML Object (7:32)\nBy now, you should all be experts at setting up an XML object in Actionscript, but just in case you need a little more repetition, Craig will demonstrate how to set up the XML object for the video project.\n* 23 - Populating a List Component with XML Data (8:36)\nFor the video project, we'll allow the user to change videos by selecting a title from a List Component. In this video, you'll learn how to populate this List with information from the XML object.\n* 24 - Changing Videos with the List Component (5:32)\nNow that the List Component is populated, Craig will show you how to create an event listener that will listen for the user to select a new item on the list, and then once that item is selected, the listener will cause the appropriate video to start playing.\n* 25 - Video Player Controls (12:07)\nIn this video, Craig wraps up the video player project by adding code to the stop, pause, play, and mute buttons.\n* 26 - Conclusion (0:38)","torrent":{"xt":"urn:btih:f994711bfc0ac0305ec595a59ae4092be072497e","amp;dn":"learnflash.com+-Integrating+Flash+with+XML","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f994711bfc0ac0305ec595a59ae4092be072497e","infoHashBuffer":{"type":"Buffer","data":[249,148,113,27,252,10,192,48,94,197,149,165,154,228,9,43,224,114,73,126]},"announce":[],"urlList":[]}}