{"title":"A Fistful of Dollars","uid":4520516,"size":912926720,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f9bf1ddcaf0e3d7684a545dd2704c40a3d465ae5&amp;dn=A+Fistful+of+Dollars&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mcguone5","files":1,"time":1227141121,"description":"DVD RIP of a Fistful of dollars staring Clint Eastwood\nProduct Details\n\n    * Actors: Clint Eastwood, Marianne Koch, Gian Maria VolontÃƒÂ¨, Wolfgang Lukschy, Sieghardt Rupp\n    * Directors: Monte Hellman, Sergio Leone\n    * Format: Closed-captioned, Color, DVD-Video, Full Screen, Letterboxed, Widescreen, NTSC\n    * Language: English (Dolby Digital 2.0 Mono)\n    * Subtitles: English, French\n    * Region: Region 1 (U.S. and Canada only. Read more about DVD formats.)\n    * Aspect Ratio: 2.35:1\n    * Number of discs: 1\n    * Rating:\n    * Studio: MGM (Video &amp; DVD)\n    * DVD Release Date: October 5, 1999\n    * Run Time: 100 minutes\n    * Average Customer Review:\n       \n         * For more information about &quot;A Fistful of Dollars&quot; visit the Internet Movie Database (IMDb)\n\n    * This is item 1 in The Man with No Name Series.\n\nEditorial Reviews\n\nAmazon.com essential video\nA Fistful of Dollars launched the spaghetti Western and catapulted Clint Eastwood to stardom. Based on Akira Kurosawa&amp;#039;s 1961 samurai picture Yojimbo, it scored a resounding success (in Italy in 1964 and the U.S. in 1967), as did its sequels, For a Few Dollars More and The Good, the Bad and the Ugly. The advertising campaign promoted Eastwood&amp;#039;s character--laconic, amoral, dangerous--as the Man with No Name (though in the film he&amp;#039;s clearly referred to as Joe), and audiences loved the movie&amp;#039;s refreshing new take on the Western genre. Gone are the pieties about making the streets safe for women and children. Instead it&amp;#039;s every man for himself. Striking, too, was a new emphasis on violence, with stylized, almost balletic gunfights and baroque touches such as Eastwood&amp;#039;s armored breastplate. The Dollars films had a marked influence on the Hollywood Western--for example, Sam Peckinpah&amp;#039;s The Wild Bunch--but their most enduring legacy is Clint Eastwood himself. --Edward Buscombe\n\nProduct Description\nClint Eastwood&amp;#039;s legendary &quot;Man With No Name&quot; makes his powerful debut in this thrilling, action-packed &quot;new breed of western&quot; (Motion Picture Herald) from the acclaimed director of The Good, the Bad and the Ugly and For a Few Dollars More. Exploding with blistering shootouts, dynamic performances and atmospheric cinematography, it&amp;#039;s an undisputed classic of the genre. A mysterious gunman (Eastwood) has just arrived in San Miguel, a grim, dusty border town where two rival bands of smugglers are terrorizing the impoverished citizens. A master of the &quot;quick-draw,&quot;the stranger soon receives offers of employment from each gang. But his loyalty cannot be bought; he accepts both jobs...and sets in motion a plan to destroy both groups of criminals, pitting one against the other in a series of brilliantly orchestrated setups, showdowns and deadly confrontations.\n","torrent":{"xt":"urn:btih:f9bf1ddcaf0e3d7684a545dd2704c40a3d465ae5","amp;dn":"A+Fistful+of+Dollars","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9bf1ddcaf0e3d7684a545dd2704c40a3d465ae5","infoHashBuffer":{"type":"Buffer","data":[249,191,29,220,175,14,61,118,132,165,69,221,39,4,196,10,61,70,90,229]},"announce":[],"urlList":[]}}