{"title":"Blood of the Vikings   (BBC 2001 - Complete Series)","uid":6543421,"size":3672018990,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:faf077934ad270d2803d5476a3f1ecddc1345a68&amp;dn=Blood+of+the+Vikings+++%28BBC+2001+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"neil1966hardy","files":6,"time":1310771122,"description":"Julian Richards investigates Viking Britain, from the first raids to their settlement of the British Isles and traces their legacy through a genetics survey\n\nJourney back to 793 on the coast of Holy Island, home to the peaceful monks of Lindisfarne who were brutally murdered by raiders from the sea. The Norwegian countryside reveals Viking graves, littered with treasures that once belonged to the monks!\n\nIn Oseburg, Norway, uncover an entire Viking ship, preserved in a massive Pagan burial ground. On board, discover the bowels of the vessel bursting with treasure that archaeological evidence connects to a Scottish monastery, burned and pillaged hundreds of years before.\n\nOn the salty bluffs of northern Scotland, where the ancient Pictish people lived, explore a still-popular debate. Historians argue that the Vikings maintained peaceful relations with the Picts, trading with them freely. Now, hear others contend that the Vikings wiped these pre-Scotsmen off the map! Whichever the case, one thing seems certain: the Vikings took every available opportunity and life to make money.\n\nThe Survey\n\nThe UCL genetics survey set out to discover if any genetic traces of the Vikings remained in the British Isles - and what this might reveal about the Viking Age. We hoped to find out where Vikings settled and roughly how significant those settlements were. DNA samples were taken from men at a number of sites. In the main, small towns were chosen and the men tested were required to be able to trace their male line back two generations in the same rural area - within 20 miles of the town chosen. The aim was to reduce the effects of later population movements, assuming that in between the Norman invasion of 1066 and the 20th century movement would have been limited.\n\nThe tests looked at the Y chromosome, which is only carried by men. This chromosome is particularly useful for population genetics studies as it is passed directly from father to son with virtually no alteration. Other chromosomes exist in pairs, one member of which is passed on from the mother and the other from the father. But because women do not carry a Y chromosome, geneticists can always be sure that this part of a man's DNA has come from his father, and from his grandfather before him. This chromosome allows geneticists to begin to unravel the male ancestry of the British Isles.\n\n1. First Blood\n\nLoot found secreted in pagan graves in Norway provides some major clues that point to Viking perpetrators following the discovery of murder victims in Wales and a monastery razed to the ground in Scotland.\n\n2. Invasion\n\nIn AD 856, a massive fleet of Viking ships appeared off the coast of East Anglia, heralding a change in Viking tactics - from raiding to invasion. Richards charts the years of attempted conquest that followed.\n\n3. The Sea Road\n\nJulian Richards investigates the impact of the Vikings in Britain. This edition focuses on the archaeological trail left by the Vikings as they travelled from Norway along the sea road to Dublin. Settlements, a boat burial and evidence of trading have been discovered on the Scottish isles, and silver hoards found in Ireland suggest that Dublin was not only wealthy and important, but also a centre for trade in slaves.\n\n4. Rulers\n\nJulian Richards recalls how, after years of raiding, England's resistance was so weakened that, in the early 11th century, the Vikings were finally able to seize the throne. In other parts of the British Isles however, they gained and maintained power by integration.\n\n5. Last of the Vikings\n\nIn the last of the series, Julian Richards uncovers new information from the battle in 1066 between Viking warlord Harald Hardrada and King Harold of England that marked the end of the Viking age in Britain. Results from a nationwide genetic survey show where in Britain the Vikings left a measurable contribution. \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:faf077934ad270d2803d5476a3f1ecddc1345a68","amp;dn":"Blood+of+the+Vikings+++%28BBC+2001+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"faf077934ad270d2803d5476a3f1ecddc1345a68","infoHashBuffer":{"type":"Buffer","data":[250,240,119,147,74,210,112,210,128,61,84,118,163,241,236,221,193,52,90,104]},"announce":[],"urlList":[]}}