{"title":"LMSOFT Web Creator Pro 6.0.0.6","uid":7840065,"size":81132565,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fbdb78b1a710c8d2670721b5d4197674d471f90b&amp;dn=LMSOFT+Web+Creator+Pro+6.0.0.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NZupload","files":-1,"time":1353317247,"description":"Year / Date: 2012 \nVersion: 6.0.0.6 \nDeveloper: LMSOFT \n Bit: 32bit \nLanguage: Multilingual \n Medicine: Present \nSystem Requirements: Windows XP/Vista/7 \n\nDescription: About: Web Creator Pro - a powerful software tool to create a website design without any knowledge of programming languages. The set of templates with the possibility of further trouble. Good tool for those who do not know programming languages, but I would like to express themselves in creating the site. Features: - getting their envy graphic designers using generators menus and buttons. - Set opacity, overlay, etc. - Create field controlled forms and passwords to gather information and communicate with your visitors. - Insert Flash animation, paste and edit HTML and JavaScript. - Includes a fully revised help and tutorial. - Get professional results with just a few actions. - Choose a template library with thousands sites and pages with themes including: industry, commerce and the service sector. - Group elements on the same level with a unique service program overlay layers for movement or interaction with multiple elements with a single command. - Insert elements: images, logos, animation. - Customize your template to give color to match your logo or any image using the service program sample color. - Add your visual effects (transparency, drop shadows, frames and more) directly from the graphics library. - Access Internet: using simple integrated module of the transmission and analysis of pages in one click publish and upload finished pages or web sites. Extras. : In contrast to the fifth version of the language is not kosyachit meta tags (for me at least). New templates. Backward compatibility.","torrent":{"xt":"urn:btih:fbdb78b1a710c8d2670721b5d4197674d471f90b","amp;dn":"LMSOFT+Web+Creator+Pro+6.0.0.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbdb78b1a710c8d2670721b5d4197674d471f90b","infoHashBuffer":{"type":"Buffer","data":[251,219,120,177,167,16,200,210,103,7,33,181,212,25,118,116,212,113,249,11]},"announce":[],"urlList":[]}}