{"title":"Charles Mingus with Eric Dolphy - Cornell 1964 [2CD] [2007]","uid":3880507,"size":193268424,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fcc5adf920c1d2c2fdf4d745478a8c8d1b4af5e3&amp;dn=Charles+Mingus+with+Eric+Dolphy+-+Cornell+1964+%5B2CD%5D+%5B2007%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"naxosking","files":16,"time":1194647259,"description":"JAZZ\n\nCharles Mingus with Eric Dolphy - Cornell 1964 [2CD] [2007]\n\nThe band that Charles Mingus, the doyen of jazz&amp;#039;s mercurial polymaths, pulled together for his early-1964 European tour was phenomenal?and here they are playing 130 minutes worth of live music no one?s ever heard. Pianist Jaki Byard, alto saxophonist/flutist/bass clarinetist Eric Dolphy, tenor saxophonist Clifford Jordan, trumpeter Johnny Coles, and longtime drummer Dannie Richmond came together for the Mingus tour knowing that Dolphy would be staying in Europe after their gigs?he died tragically just 12 weeks after this gig. And Coles would come perilously close to death himself with a stomach ulcer within a month of the band?s Cornell date, forcing him off the tour. So the music here is particularly special and musically resplendent. There is considerable overlap with the The Great Concert of Charles Mingus, but that 2-CD set is sans the ailing Coles, who fattens the sound here: playing beautifully as &quot;Johnny O&amp;#039;Coles&quot; on the unlikely &quot;When Irish Eyes Are Smiling.&quot; But Eric Dolphy, his every breath is poetry: from his palpitating bass clarinet on the pugnacious &quot;Fables of Faubus&quot; to the tipsy, whirling flute he plays on &quot;Jitterbug Waltz,&quot; a tune he loved playing. The sound here is less crisp than The Great Concert, thick in the middle and ill-defined when it comes to Richmond&amp;#039;s drums, leaving the group&amp;#039;s interplay like an ear-magnet. &quot;Take the &amp;#039;A&amp;#039; Train&quot; pays soulful, blossoming homage to Billy Strayhorn even as you can hear the band tightening their grip collectively, learning to fly as a unit. Unheard music of this caliber demands a listen, and here the rewards are bountiful.\n\n2CDs ripped into MP3 format, 192kbps.","torrent":{"xt":"urn:btih:fcc5adf920c1d2c2fdf4d745478a8c8d1b4af5e3","amp;dn":"Charles+Mingus+with+Eric+Dolphy+-+Cornell+1964+%5B2CD%5D+%5B2007%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcc5adf920c1d2c2fdf4d745478a8c8d1b4af5e3","infoHashBuffer":{"type":"Buffer","data":[252,197,173,249,32,193,210,194,253,244,215,69,71,138,140,141,27,74,245,227]},"announce":[],"urlList":[]}}