{"title":"Iron Curtain - Anne Applebaum.epub","uid":9363011,"size":3140806,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd080fb7d281c0d1d9a87007263adf9a851ff4a7&amp;dn=Iron+Curtain+-+Anne+Applebaum.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387361252,"description":"In the long-awaited follow-up to her Pulitzer Prize-winning Gulag, acclaimed journalist Anne Applebaum delivers a groundbreaking history of how Communism took over Eastern Europe after World War II and transformed in frightening fashion the individuals who came under its sway.\n\nAt the end of World War II, the Soviet Union to its surprise and delight found itself in control of a huge swath of territory in Eastern Europe. Stalin and his secret police set out to convert a dozen radically different countries to Communism, a completely new political and moral system. In Iron Curtain, Pulitzer Prize-winning journalist Anne Applebaum describes how the Communist regimes of Eastern Europe were created and what daily life was like once they were complete. She draws on newly opened East European archives, interviews, and personal accounts translated for the first time to portray in devastating detail the dilemmas faced by millions of individuals trying to adjust to a way of life that challenged their every belief and took away everything they had accumulated. Today the Soviet Bloc is a lost civilization, one whose cruelty, paranoia, bizarre morality, and strange aesthetics Applebaum captures in the electrifying pages of Iron Curtain.","torrent":{"xt":"urn:btih:fd080fb7d281c0d1d9a87007263adf9a851ff4a7","amp;dn":"Iron+Curtain+-+Anne+Applebaum.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd080fb7d281c0d1d9a87007263adf9a851ff4a7","infoHashBuffer":{"type":"Buffer","data":[253,8,15,183,210,129,192,209,217,168,112,7,38,58,223,154,133,31,244,167]},"announce":[],"urlList":[]}}