{"title":"Scemo Di Guerra (1985), [XviD - Ita Mp3] TNT Village","uid":12771906,"size":1048608768,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fdc9337eb3bf24999553c0d81aed4629b2ba5324&amp;dn=Scemo+Di+Guerra+%281985%29%2C+%5BXviD+-+Ita+Mp3%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ebasso","files":2,"time":1447687586,"description":".: Release Originale:.\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=93365\r\n\r\n.: Copertina :.\r\n] \nhttp://www.claudiobisio.it/img/cinema/locandine/claudiobisio_05.jpg\r\n\r\n.: Trama :.\r\n\r\nOasi di Sorman (Libia), 1941. Il Sottotenente Marcello Lupi, ufficiale medico, viene assegnato ad una sezione sanitaria installata vicino all'Oasi e comandata dal Maggiore Beluschi, il quale ad altro non aspira che ad essere trasferito in patria. Là Lupi conosce il Capitano Oscar Pilli e, in quanto sta specializzandosi in psichiatria, resta subito colpito dalla personalità psicopatica di quell'uomo puerile ed arrogante, vulnerabile e contraddittorio, irriso ed isolato tra gli stessi militari. Lupi intuisce che il disturbo di Pilli ha ragioni profonde (non ha nessuno, eppure continua a scrivere lettere all'adorata madre, che è defunta) e che egli costituisce un pericolo per sé e per tutti gli altri. Il Maggiore Beluschi non ha il minimo interesse a che Oscar Pilli sia rimosso (e ciò proprio perché è Pilli che dovrà assumere il comando quando lui, come spera, se ne andrà). E, infatti, partito Beluschi, lo strampalato ufficiale diventa il capo dell'unità sanitaria. Poiché la situazione è ormai intollerabile, gli ufficiali decidono di spedire una lettera anonima al competente comando, il quale invia una commissione rispettiva per accertare le effettive condizioni di Pilli, ma essa, pur non nutrendo dubbi circa la stabilità mentale del soggetto, apprende sul posto da Lupi che Pilli risulta in buoni rapporti con il Maresciallo d'Italia Rodolfo Graziani e, di conseguenza, nessun provvedimento verrà preso. Solo dopo che Graziani si sarà dimesso, il Comandante Pilli è rimosso dall'incarico per un lungo periodo di sospensione. Lupi, trasferito ad un ospedale da campo al fronte, incontra in una cittadina Oscar Pilli, ancora più grasso ed imborghesito, il quale vive come &quot;factotum&quot; in un modesto bordello. E là lo lascia, per ritrovarlo più tardi, reintegrato nel grado, più bellicoso e allucinato che mai, proprio in prima linea, dove Pilli arriva in un momento delicatissimo: le forze dell'Asse e quelle britanniche hanno pattuito una breve tregua mentre italiani e tedeschi hanno il tempo necessario per sgomberare prima della prevedibile avanzata nemica. Ma Pilli è troppo battagliero ed esaltato e muove da solo, gesticolando e urlando, impugnando una bomba a mano, in direzione degli inglesi. Il comandante tedesco, temendo il peggio, lo fa abbattere con un fucilata. Lupi corre a recuperare il morto, al quale italiani e tedeschi rendono gli onori militari, al canto della canzone &quot;Mamma&quot;.\r\n\r\n.: Scheda Tecnica DivX :.\r\n\r\nName.........: Scemo di guerra 1.avi\r\nFilesize.....: 500 MB (or 512,022 KB or 524,310,528 bytes)\r\nRuntime......: 00:58:03 (87,066 fr)\r\nVideo Codec..: XviD\r\nVideo Bitrate: 1072 kb/s\r\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-1 Layer 3\r\nAudio Bitrate: 128 kb/s (64/ch, stereo) CBR\r\nFrame Size...: 544x368 (1.48:1) [=34:23]\r\n\r\nName.........: Scemo di guerra 2.avi\r\nFilesize.....: 500 MB (or 512,010 KB or 524,298,240 bytes)\r\nRuntime......: 00:46:28 (69,696 fr)\r\nVideo Codec..: XviD\r\nVideo Bitrate: 1372 kb/s\r\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-1 Layer 3\r\nAudio Bitrate: 128 kb/s (64/ch, stereo) CBR\r\nFrame Size...: 544x368 (1.48:1) [=34:23]","torrent":{"xt":"urn:btih:fdc9337eb3bf24999553c0d81aed4629b2ba5324","amp;dn":"Scemo+Di+Guerra+%281985%29%2C+%5BXviD+-+Ita+Mp3%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdc9337eb3bf24999553c0d81aed4629b2ba5324","infoHashBuffer":{"type":"Buffer","data":[253,201,51,126,179,191,36,153,149,83,192,216,26,237,70,41,178,186,83,36]},"announce":[],"urlList":[]}}