{"title":"[Chris_Robinson]Animators Unearthed A Guide to the Best of Conte","uid":11087683,"size":1446406,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe10dddb36fd65d3cbf5cc01e76c9d64750601d3&amp;dn=%5BChris_Robinson%5DAnimators+Unearthed+A+Guide+to+the+Best+of+Conte&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1411479559,"description":"&quot;Animators Unearthed&quot; is an introduction to some of the world's top animation filmmakers, whose faces and voices remain largely unseen and unappreciated outside of the animation community. Chris Robinson discusses why it's been neglected and where you can find the work. He aims to bring this art form, and its creators, to the forefront by tracing the history of this personal and artistic animation. Throughout its history, animation has been primarily defined as cartoons that make people laugh, a medium of gags, caricatures, animals and fart jokes. Most people have no idea that there also exists a more personal, provocative and poetic side of animation, one that is not made for money and mass audiences. Robinson profiles 20 animators, known in the field, including: Patrick Smith, Don Hertzfelt, Chris Landreth (2004 Oscar winner for &quot;Ryan&quot;), John Canemaker (2005 Oscar Winner for &quot;The Moon and The Son&quot;), Joanna Quinn, Run Wrake, Chris Hinton (Oscar nominee), Bob Sabiston (&quot;Waking Life&quot;, &quot;A Scanner Darkly&quot;). After spending 16 years fighting the stereotype that animation exists for kids and laughs, Robinson's tome spreads that message to introduce these incredible artists to a wider audience. Most of all, he hope that people will come away with the feeling that animation is a great art form that rivals any of the classic arts. \n\nChris Robinson, &quot;Animators Unearthed: A Guide to the Best of Contemporary Animation&quot;\nContin.um | 2010 | ISBN: 0826429564 | 256 pages | File type: PDF | 1,4 mb\n\nEditorial Reviews\nAbout the Author\n\nA noted animation commentator, curator and historian, Chris Robinson has been a director of the Ottawa International Animation Festival (OIAF) since 1994. His previous books include Unsung Heroes of Animation (John Libbey &amp;Co., 2006), Estonian Animation: Between Genius and Utter Illiteracy (IUP, 2007) and The Animation Pimp: AWN Official Guide (Course Technology, 2007).","torrent":{"xt":"urn:btih:fe10dddb36fd65d3cbf5cc01e76c9d64750601d3","amp;dn":"%5BChris_Robinson%5DAnimators+Unearthed+A+Guide+to+the+Best+of+Conte","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe10dddb36fd65d3cbf5cc01e76c9d64750601d3","infoHashBuffer":{"type":"Buffer","data":[254,16,221,219,54,253,101,211,203,245,204,1,231,108,157,100,117,6,1,211]},"announce":[],"urlList":[]}}