{"title":"Fermin Muguruza Bass-que Culture ISO","uid":6880061,"size":7939883008,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fe8539a06203c64d37aa7952258f531a74c56f5f&amp;dn=Fermin+Muguruza+Bass-que+Culture+ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"griyermo","files":1,"time":1323621865,"description":"Fermin Muguruza culmina su actual proyecto personal de reivindicaciÃƒÂ³n con raÃƒÂ­ces, estableciendo un puente entre Jamaica y el PaÃƒÂ­s Vasco. Con la cÃƒÂ¡mara en mano, dirige este documental, que tomando como hilo narrativo la grabaciÃƒÂ³n de su ÃƒÂºltimo disco &quot;Euskal Herria Jamaika Clash&quot; (una colecciÃƒÂ³n de canciones nuevas con el apoyo de algunos de los mejores mÃƒÂºsicos y cantantes de la escena sincopada de Jamaica, en los estudios Tuff Gong de Kingston, el cuartel general de los Marley, y Big Yard, centro operativo de la crew de Shaggy), nos ofrece una mirada social, cÃƒÂ³mplice y cercana sobre los vÃƒÂ­nculos entre pueblos pequeÃƒÂ±os, en este caso, dos pueblos-isla, tenaces en mantenerse vivos y dignos, primero frente al colonialismo, ahora, frente a un uniformismo global, que les exige el cese de su particular rebeldÃƒÂ­a polÃƒÂ­tica y cultural. Diferentes lÃƒÂ­neas transversales nos irÃƒÂ¡n ofreciendo distinta informaciÃƒÂ³n sobre lo que significa la mÃƒÂºsica como herramienta de transformaciÃƒÂ³n, &quot;WeÃ‚Â´ll free the People with music&quot;, el sonido jamaicano como catalizador de primer orden en la ya dilatada carrera musical de Muguruza, quien reivindicarÃƒÂ¡ y revisitarÃƒÂ¡ el tema de Kortatu que escribiera hace 20 aÃƒÂ±os : &quot;La lÃƒÂ­nea del frente&quot;, donde ya cantaba &quot;Siempre me ha interesado, esa jerga que emplean los rastas&quot;, la sonoridad y misterio de la lengua vasca y el origen y evoluciÃƒÂ³n de la mÃƒÂºsica reggae , la violencia estructural y el intervencionismo yanqui, la vida en el ghetto y el encuentro de culturas. Con una factura guerrillera, lejos de un montaje convencional de imagen y sonido, consigue un testimonio humano, con una sensaciÃƒÂ³n de cercanÃƒÂ­a extraordinaria. U-Roy, Luciano, Toots, Rita Marley, Marcia Griffiths, todos los mÃƒÂºsicos y gente que va participando en esta aventura, saluda este choque cultural entre Jamaica y Euskal Herria, la &quot;Bass Culture&quot; confluyendo con la Basque Culture, fundiÃƒÂ©ndose en una ceremonia de los abrazos, que mediante la mÃƒÂºsica celebrarÃƒÂ¡ la vida, denunciando las injusticias. Un puente sÃƒÂ³lido, que llama a otras islas en la bÃƒÂºsqueda de un nuevo archipiÃƒÂ©lago, planetario pero diverso, de islas unidas y solidarias. En una prueba mÃƒÂ¡s de su talento y de su capacidad para sorprender Fermin nos presenta una deconstrucciÃƒÂ³n de su Euskalherria Jamaika Clash presentandonos una atrevida colecciÃƒÂ³n de remezclas en las que el original ritmo reggae va tomando una serie de formas un tanto abstractas, a veces incluso casi irreconocibles modeladas por las paletas de unos mezcladores que ofrecen un audaz ejercicio de creaciÃƒÂ³n. En un brillante ejercicio de hedonismo socialista, drum &amp; bass ,disco , funk , raggamuffin, dub, o rai protagonizan una placentera fiesta rÃƒÂ­tmica destinada al disfrute de los sentidos.","torrent":{"xt":"urn:btih:fe8539a06203c64d37aa7952258f531a74c56f5f","amp;dn":"Fermin+Muguruza+Bass-que+Culture+ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe8539a06203c64d37aa7952258f531a74c56f5f","infoHashBuffer":{"type":"Buffer","data":[254,133,57,160,98,3,198,77,55,170,121,82,37,143,83,26,116,197,111,95]},"announce":[],"urlList":[]}}