{"title":"Juan Son - Mermaid Sashimi [TQMP]","uid":5790012,"size":408247214,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ff1bcdb3999ea8b67b2254a4c665ab0a12a0f1c5&amp;dn=Juan+Son+-+Mermaid+Sashimi+%5BTQMP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"niuqelra","files":-1,"time":1282813333,"description":"Juan Son is a Latin alternative singer/songwriter from Mexico who rose to fame in the experimental rock band Porter during the late 2000s before making his critically acclaimed solo album debut in 2009. Born Juan Carlos Pereda on January 24, 1984, in Guadalajara, Jalisco, Mexico, he founded Porter in 2001. He subsequently went abroad to study music in London for a year, and the band dissolved in his absence. Upon his return to Mexico, Juan Son revived Porter and went about recording the band's seven-track debut EP, Donde los Ponys Pastan (2005). A couple years later the band made its full-length album debut with Atemahawke (2007). The album was a Top Five hit on the Mexican charts and includes the single &quot;Host of a Ghost.&quot; In the wake of Porter's debut album success and high-profile appearances at the Vive Latino and Coachella festivals, the band split up in 2008 and Juan Son promptly embarked on a solo career. He made his solo album debut in 2009 with Mermaid Sashimi, a critically acclaimed Top Ten success that includes the singles &quot;Nada&quot; and &quot;Goldfish.&quot; ~ Jason Birchmeier, Rovi &lt;a href=&quot;\nhttp://itunes.apple.com/us/artist/juan-son/id282060640?showBio=1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://itunes.apple.com/us/artist/juan-son/id282060640?showBio=1&lt;/a&gt;\n\nThe solo debut of former Porter frontman Juan Son, Mermaid Sashimi is a daring debut effort that bridges the gap between indie electronic and alternative rock. It's quite experimental for mainstream Latin pop, and while some songs are just plain weird, there are a few front-loaded highlights that are really great (&quot;Nada,&quot; &quot;Mermaid Sashimi,&quot; &quot;Goldfish&quot;). As bold and curious as the music is on Mermaid Sashimi, the vocals are what really stand out and are likely to either make or break this album for most listeners. Though Son hails from Guadalajara, Mexico, the 25-year-old wunderkind sings most of Mermaid Sashimi in English rather than Spanish. The stand-out lead single, &quot;Nada,&quot; is one of the exceptions, as it seems most oriented toward commercial appeal in Mexico. Moreover, Son sings in a fey, otherworldly manner reminiscent of BjÃƒÂ¶rk and her Icelandic contemporaries Sigur RÃƒÂ³s. Though his vocal style may be off-putting to some, it's well-suited to the experimental nature of Mermaid Sashimi with its off-kilter beats, lo-fi keyboards, and free associated lyrics. In a way, Mermaid Sashimi could be seen as a Mexican response to trailblazing American indie acts like Animal Collective, and one can easily envision more music along these lines arising in Mexico in the years to come, in particular from those like Son who have cross-cultural experiences (he studied for a year in London, England, and his former band, Porter, toured internationally, most notably performing at the 2008 Coachella Festival). As impressive as the aforementioned run of front-loaded highlights are, Mermaid Sashimi feels like a formative effort by Son. Like Mexican alternative predecessors Natalia Lafourcade and Julieta Venegas, it might take him a couple albums to refine his style, reach his full potential, and drift into the mainstream. In the meantime, Mermaid Sashimi is a promising debut that's both fearless and trailblazing. ~ Jason Birchmeier, Rovi &lt;a href=&quot;\nhttp://itunes.apple.com/us/album/mermaid-sashimi/id323533133&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://itunes.apple.com/us/album/mermaid-sashimi/id323533133&lt;/a&gt;\n\n\n\t1. \tThe Remains\n\t2. \tNada\n\t3. \tMermaid Sashimi\n\t4. \tGoldfish\n\t5. \tEn Camilla Al Quirofano (A Medio Sedar)\n\t6. \tCaptain Whirlpool\n\t7. \tUnicorn s Puberty\n\t8. \tMarianela\n\t9. \tEl Resplandor\n\t10. \tMonitor Flotando Muestra SeÃƒÂ±ales De Vida\n\t11. \tToma Esta Menta\n\t12. \tAna Paula\n\n\namazon samples and customer reviews: http://amzn.com/B002Y5UQ0I\n\n2009 Mermaid Sashimi by Juan Son\n\n\nBrought to you by TQMP (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC http://flac.sourceforge.net/ and include covers...\n\nRipped using Exact Audio Copy V0.99 from 4. May 2009, encoded to FLAC @ 1024 kBit/s\nGet Your Free Copy of EAC and FLAC packages at:    &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\nHere is a guide: http://users.fulladsl.be/spb2267/\n\nFeel free to join The Quality Music Project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please) in lossless format and include Artwork. Include .cue, .m3u and .log files for the purists and the TQMP search tag in your title...\n\nYou can find all TQMP uploads at: http://thepiratebay.se/tag/TQMP\n\nEAC @ secure mode, freedb and AccurateRip working.\nDrive Options automatically detected, Offset and Overread corrected.\nInstalled external ASPI driver by VOB.\n\nArtwork scanned @ 1200 dpi, without edition and saved directly as a PDF.\nAdditional high quality JPEG album cover included.","torrent":{"xt":"urn:btih:ff1bcdb3999ea8b67b2254a4c665ab0a12a0f1c5","amp;dn":"Juan+Son+-+Mermaid+Sashimi+%5BTQMP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff1bcdb3999ea8b67b2254a4c665ab0a12a0f1c5","infoHashBuffer":{"type":"Buffer","data":[255,27,205,179,153,158,168,182,123,34,84,164,198,101,171,10,18,160,241,197]},"announce":[],"urlList":[]}}