{"title":"A Tribe Called Quest - The Low End Theory","uid":7702336,"size":274895758,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ff70886a7d5e1c67636e939809ce7b7d4623e979&amp;dn=A+Tribe+Called+Quest+-+The+Low+End+Theory&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SirScoops","files":-1,"time":1349561759,"description":"I know what you're thinking, &quot;What kind of fuckface uploads an album already listed on TPB like 15x?&quot;  Well, I'm a fiend for lossless quality... and those assholes decided that .mp3 is an adequate file format for one of the greatest/most influential hip hop albums of all time...  Painstakingly ripped of hiphoplossless.com and shared at much higher P2P speeds for your enjoyment! &lt;3 &lt;3\n\n\n\n...and finally a brief description!\n\nThe Low End Theory helped shape alternative hip hop in the 1990s.[19][20] It established the musical, cultural, and historical link between hip hop and jazz.[21] The album was considered an instant classic with a 5 mics rating in The Source. Reviewer Reef lauded their &quot;progressive sound&quot; and &quot;streetwise edge&quot;.[22] Writer Oliver Wang called the album &quot;a consummate link between generations&quot;, which took the essence of jazz and hip hop, and &quot;showing they originated from the same black center.&quot;[23] The group's &quot;mellow innovations&quot; helped jazz rap gain significant exposure from 1992 to 1993.[24] Rolling Stone ranked the album at number 154 in &quot;The 500 Greatest Albums of All Time&quot;, stating that &quot;people connected the dots between hip-hop and jazz -- both were revolutionary forms of black music based in improvisation and flow -- but A Tribe Called Quest's second album drew the entire picture.","torrent":{"xt":"urn:btih:ff70886a7d5e1c67636e939809ce7b7d4623e979","amp;dn":"A+Tribe+Called+Quest+-+The+Low+End+Theory","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff70886a7d5e1c67636e939809ce7b7d4623e979","infoHashBuffer":{"type":"Buffer","data":[255,112,136,106,125,94,28,103,99,110,147,152,9,206,123,125,70,35,233,121]},"announce":[],"urlList":[]}}