{"title":"Monty Python CD-ROM Games","uid":4351804,"size":2039668742,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ffd04cdcba8f899127a7615e3d8d0447ec900111&amp;dn=Monty+Python+CD-ROM+Games&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cic","files":23,"time":1219194511,"description":"Monty Python CD-ROM Games\n\nA Complete Waste of Time\nThe Quest for the Holy Grail\n&amp; The Meaning of Life\n\nDownloaded from rapidshare .de and .com. The Meaning of Life was repacked for this torrent to get rid of the password which is Opus.\n\nDescription: http://www.bbc.co.uk/dna/h2g2/A254404\t\n\nAnd now for something completely digital...\n\nAround 1993, a little upstart company called 7th Level, which at the time was based in Richardson, Texas, USA, somehow managed to make a deal with Eric Idle and the majority of the original Monty Python troupe.\n\nUnfortunately, Graham Chapman was unable to participate due to a prior engagement made four years earlier with the Grim Reaper. John Cleese also decided not to take part in the project, but the rest of the gang worked with 7th Level to recreate themselves in their own image. They were digitally remastered and remained fantastically funny, even though by that time some of them were grandfathers(1).\n\nThe Complete Waste of Time\n\nIn 1994, what is now known as Monty Python&amp;#039;s Complete Waste of Time (CWOT), came into being. CWOT was an instant success, as it guaranteed to reveal the secrets of the galaxy just by clicking around Mrs Zambesi&amp;#039;s brain and getting hopelessly lost.\n\nBased very loosely on the original 45 episodes of Monty Python&amp;#039;s Flying Circus, and containing tons of new artwork by Terry Gilliam as well as new voice-over work from Eric Idle, Terry Jones, Michael Palin and Terry Gilliam, the PC CD-ROM was amazingly exciting and fun, and a complete waste of time was had by all. It made absolutely no sense whatsoever... but who cared? It was funny, and once mastered, devoted fans could play the parrot sketch over and over again in a tiny little box on their screen until grey matter oozed out of their skulls.\n\nThe Quest for the Holy Grail\n\nTwo years later, out of a sheer desire to please their devoted following, and also to &amp;#039;retire at an early age&amp;#039;(2), most of the Monty Python members got together again and squeezed out a second PC CD-ROM game, Monty Python and the Quest for the Holy Grail, based less loosely and more flawlessly on the movie of the same name. This, some argue, is the best of the PC CD-ROM series.\n\nAdvertised as the &amp;#039;Best CD-ROM Game of 932 AD&amp;#039;, Grail includes games such as &amp;#039;Spank the Virgin&amp;#039;; &amp;#039;Burn the Witch&amp;#039;; &amp;#039;Drop Dead&amp;#039;(3); and &amp;#039;Knights in Combat&amp;#039;(4) among others. The game also allows you to follow King Arthur and his knights through the perilous and savage middle ages collecting gold and buying shrubberies and generally having a good time.\n\nAgain, Chapman and Cleese were not present, although by use of material from the original movie, few could dismiss the fact that they were certainly there in spirit. In fact, the notes on the second game credit John Cleese as Voice Talent, via &amp;#039;fax&amp;#039;, if that is at all possible.\n\nTo help render this tale into its new computer format, the troupe recreated the never-previously-performed &amp;#039;King Brian the Wild&amp;#039; scene, which was originally written for the movie script, but was never successfully filmed. Michael Palin faked the voice of Graham Chapman as best he could, and Terry Gilliam rushed together a black and white animation of the scene. Again it was funny. Again it made money. And again the Monty Python troupe secured their autumn years in the sun, with profits made from stuff they&amp;#039;d already done. A glorious and flawless plan!\n\nThen things took a strange turn.\n\nThe Meaning of Life\n\nDue to the success of the first two PC CD-ROM Monty Python game titles, 7th Level and Monty Python teamed up again to bring the world a third game. This one was to be based on the movie Monty Python&amp;#039;s The Meaning Of Life. However, 7th level underwent some serious management problems and a crisis of identity.\n\nBefore the third title could be completed, rights to the Monty Python games were sold off by 7th Level to the Panasonic Interactive Media Company. The computer company 7th Level changed its name to Seventh Street, got out of the CD ROM game business, and then changed its name again to Learn2.com, for reasons which may never be fully understood or explained.\n\nThe Monty Python fan community was in utter turmoil. Some fans ran around in circles mumbling near incoherent lines from the original series. Still others repeatedly banged their heads against walls until their brains hurt(5).\n\nDespite all of this, the third title was successfully made available to a waiting public. The third title was a two CD set game produced in 1997 that starts by following the motion picture of Meaning Of Life rather flawlessly and then sort of goes off on a mad tangent through the animated mind of Terry Gilliam.\n\nThough the game seems rather rushed towards the end, it does &amp;#039;contain hours of new material from all of the Pythons&amp;#039; including Graham Chapman, who they were able to get on loan from heaven via a seance and a promise by Eric Idle to God that he wouldn&amp;#039;t eat anymore of those horrible black jelly beans.\n\nEither on purpose, due to a vindictive and disgruntled ex-company employee, or by sheer accident, Meaning of Life the PC CD-ROM game has many bugs, flaws and &amp;#039;undocumented game features&amp;#039;. This simultaneously makes the game almost unplayable and uniquely more enjoyable. Only a Monty Python game could get away with being this haphazardly thrown together at the last moment and still impress the hell out of practically every devoted fan, and even a few people that hate the troupe&amp;#039;s collective guts.\n\nThe most notable &amp;#039;undocumented feature&amp;#039; in the game is near the end, where the blurb that is meant to appear on the screen asking you to switch discs is, for some strange reason, invisible. If you happen to know where to click, you might get past it, but many players of the game never got to see the end, despite hours and hours of futile fighting with the damn game to make some kind of reasonable sense.\n\nThe Internet has fixes and solutions for the worst of the game&amp;#039;s problems. Most notably, GameFaqs has a walkthrough document that will help you through the hardest parts. Overall, the third game is just as enjoyable as the first two, and being the first of the three games to enjoy 360 degree scrolling screens and high quality full-screen video reproduction of scenes from the original film, technologically speaking, it&amp;#039;s the most triumphant.\n\nWill There be a Fourth Game?\n\nThere was talk for a while of a fourth CD-ROM game from the Python troupe, based on the movie The Life of Brian. These were largely rumours, never substantiated by the troupe itself, and since the original team of computer talent that inspired 7th Level and Python to start this mad venture in the first place have since been scattered to the four winds, the odds of a fourth title ever being produced are slim to none.\n\nWith four PC CD-ROMs covering a quarter of a century of talent and humour, asking for more would seem quite an imposition on the part of the fan community. Also, after the shenanigans of the third title, perhaps they&amp;#039;d be best to quit while still ahead.\n\n    1 Not that grandfathers can&amp;#039;t be funny.\n    2 Quoted directly from Eric Idle, no doubt taken completely out of context and we apologise considerably.\n    3 Which is uncannily like that Russian computer favourite, Tetris.\n    4 Vaguely like Mortal Kombat, this game allows you to play either as the Black Knight or King Arthur in a fight to the death.\n    5 Those who were not fans of Monty Python noticed no significant changes in their own behaviour patterns.\n\t\n\tWritten and Researched by:\nZach Garland\n\t\n\tEdited by:\nGinger The Feisty\n\nRapidshare linkz:\n\nMonty Python: Complete Waste of Time\n\n\nno password\n\nMonty Python And The Quest For The Holy Grail\n\nPart 1\nPart 2\nPart 3\nPart 4\nPart 5\n\nno password\n\nMonty Python: The Meaning Of Life (ISO)\n\n\nPassword: Opus\n\t\n\t\t\n\t\t\n\n\n\t\n","torrent":{"xt":"urn:btih:ffd04cdcba8f899127a7615e3d8d0447ec900111","amp;dn":"Monty+Python+CD-ROM+Games","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffd04cdcba8f899127a7615e3d8d0447ec900111","infoHashBuffer":{"type":"Buffer","data":[255,208,76,220,186,143,137,145,39,167,97,94,61,141,4,71,236,144,1,17]},"announce":[],"urlList":[]}}